{"review_id":"D2TcNaPqXxDGQ6T0n-vHXw","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"iKMLsX1Je7P3wAOEc9scDg","stars":4,"date":1320624000000,"text":"I have been itching to get to Origin for months now after a friend of mine had gone and raved about the food. I dug the concept: tapas with a twist. This is definitely not your traditional, Spanish tapas. At Origin, you'll sample small plates with Asian, Italian and Latin influences. I didn't find the menu overwhelming, but our server was more than happy to help steer the meal so that similar and complimentary flavours were eaten together.\n\nIt was tough to narrow it down, as we would have been happy with just about anything on the menu. We started with the tostones: smashed, flattened and deep-fried plantains with guacamole on the side. The plantains were very well seasoned, with generous use of kosher salt and a light dusting of curry powder.\n\nNext up were the deviled eggs with smoked bacon and gremolata and the smoked cod croquettes with saffron aioli. Both were a big hit at the table, disappearing in a flash. I preferred the croquettes of the two, but I didn't exactly NOT eat my share of the deviled eggs either.\n\nThose scrumptious bites devoured, we ordered another bottle of wine (three cheers for Monday night dinners with lots of wine!) and anticipated the arrival of more delectable plates. While we waited, we marveled at the strangeness of the cutlery provided. The only way to balance your knife was blade up. That seemed...dangerous. Especially after the third glass of cabernet sauvignon.\n\nOur next dish appeared and we dove right back in (carefully, so as not to cut ourselves on our upturned knives). A gorgeously-presented order from the Mozzarella Bar: bufala mozzarella with pear, rosemary oil, pine nuts that was drizzled with honey and placed on a crunchy, toasted slice of calabrese bread.\n\nNext up was the Bangkok beef salad with peanuts, mint, mango, fried shallots and a sweet and sour dressing. There was a moment of hesitation while we all tried to dance around the fact that splitting this thing among the three of us might get violent. In the end however, we shared well (our kindergarten teachers would be so proud!). This wasn't an exceptionally complicated dish, but it was done to perfection: the beef was tender and pink; the mangoes were ripe and slippery; the shallots and peanuts added the crunch the dish needed; and the cilantro added the wonderful, bright note at the end. It should be noted that my friend said it was the third time she'd had this particular dish, and it was exactly the same every time. THAT is a sign of a great restaurant.\n\nOur final round of food was to arrive, and we were practically giddy with excitement. We had decided on the Chinois duck with pickled cucumber, hoisin and sriracha sauce on a chive pancake, the curried shrimp with naan and the miso-glazed black cod with soba noodles and a ginger vinaigrette. We knew each dish would be good, but didn't know HOW good. We had spent the first half of the meal happily eating away and we were by no means disappointed with our choices. But these last three dishes absolutely blew them all out of the water. The duck was crispy and, I must say, substantial. The kitchen does not scrimp on the portions at all with this dish! The sweet hoisin sauce was a great compliment to the duck and the heat of the sriracha. A definite must-order at Origin.\n\nNext up, we attacked the curried shrimp, which was intensely flavoured and perfectly spicy. The soft, aromatic naan bread sopped up the spicy broth that was left after devouring the plump, juicy shrimp. Another dish that hit its mark!\n\nFinally (and kind of sadly), we came to our last dish: the black cod. Black cod is one my favourite fish and I have it a fair bit. When I was out in Vancouver earlier this year, I had it almost once a day. but this black cod might be the best I've had...ever. It was flaky, tender and moist. The miso glaze was pleasantly salty and the skin, most importantly, was nice and crispy. The soba noodles were served with the ginger vinaigrette and by the time we were done, there was literally nothing left on the plate. In all likelihood, the best dish of the night though the three of us never could decide on a clear winner in that category.\n\nAll in all, I would definitely recommend Origin to anyone who has some reasonably adventurous taste buds and who is willing to share. There is one composed plate that makes a meal - a burger combo with Spanish fries and a float. I have no doubt it's delicious, but it seems kind of beside the point of a restaurant like this. Go with friends, go on a date, go with family. It's not a cheap night out, but it is most definitely money well spent.","useful":4,"funny":0,"cool":0}
{"review_id":"Vtd6Tqm7YMfRTBFLtZIoOQ","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"qhJ4GDULYbdb_sctDgbZgw","stars":2,"date":1313798400000,"text":"Alright, alright, so as it turns out I sometimes judge a book by its cover. Or, in this case, a bar by its' signage. Let's face it, I'm a sucker for good signage. And Souz Dal has it. The rusty globe hangs outside like a relic, the name of the bar cut into the side. Lit, and glowingfrom within, it reminds me of one of those tin punch-out crafts made from a (insert random legume) canat summer camp. But much cooler of course. It was this sign that caught my attention on more than one occasion, beckoning me in when I had somewhere else to be. Finally, one night a couple of weeks ago, I gave in to its sirens call. I was a little bit disappointed.\n\nIt was devoid of people save for us and the lonely bartender. I say lonely, butjudging by his charm (see: none) he probably liked it better thatway. Granted though, it was early - Souz Dal only has a drink menu - and a few more folk trickled in as the night wore on.\n\nThe stars I gave are attributed solelyto the bar's ambience. Dimly lit, and painted in muted reds and oranges it has an earthy orMoorish feel to it. Worn textiles and cathedral mirrors adorn the walls, while candles flicker on every table, casting shadows. The back patio has a similar vibe happening, cloistered in by high walls, andlit by candles wedged in the mouths of old wine bottles.\n\nNow I rarely turn down a good patio, but in this case I chose aseat inside, which says a lot.Reclined on velvet benches at our table by the open front window, we watched College Street come alive as we perused the drink menu. I was in a cocktail mood, and my friend had read somewhere that Souz Dal claimed to have the \"best\" mojitos in the city, so that was the first order I placed. \n\nNow I've been to Cuba. I did a little backpacking, starting in Havanaand makingmy way to the South coast. I wouldn't say I'm a connoiseur of the mojito because of this, but I diddrink my fair share, and like to think I know a thing or two about a good one. And this wasn't one of them. There wasn't nearly enough mint or sugar, so it was overwhelmingly bitter. I don't like my mojitos to taste like Kool-Aid, but I do like a little sweetness to curb the edge. \n\nUnlikely to order another of the same, but unwilling to give up on the bar, we tried a few other beverages. Nothing wowed us. The Moscow Mule with its ginger beer offered a nice slow burn, but it also wasn't a repeat offender. The fortune cookie garnish on the lychee-infused Soho martini was fun, but not nearly as tasty as a lychee would have been. \n\nAlthough funky signage and ambience mean a lot to me, a good drink means even more, so chancesare Iwon't be returning to Souz Dal. If however, you are in the market for an intimate date setting (see: empty bar) then head on over. And if a mediocre mojito is your thing, then you can get them herefor $5.75 on Mondays.","useful":0,"funny":0,"cool":0}
{"review_id":"ZOBEhxOeMnncqIJFkGumRA","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"gl1zQmiA8MUHmLL2wsCdVA","stars":3,"date":1294617600000,"text":"Away from the hubbub of the Annex and Little Korea, sushi joints become fewer and further between. On a relatively quiet stretch of Bloor West, between Dovercourt and Dufferin, sits Mazz Sushi.\n\nAn unassuming neighbourhood favourite for years, Mazz Sushi has been one of the few sushi options for Bloorcourt and Bloordale residents. Each time I visit, I am amazed by how bustling a place it is with the constant turning of tables and the rapid fire filling of take-out bags.\n\nOn a recent weeknight excursion, the small dining room was full, with a great mix of students, parents with young children and older couples; a typical audience for Mazz. Soon the servers were trying to accommodate extra guests and pointing out that it would be a '10 to 15 minute wait' for a table.\n\nSeated, with menus in hand, the server soon appeared with the tea that was barely just ordered. Mazz's tea is very earthy in flavour with a hint of barley. Moving on quickly to another table, he left us to continue to ponder the menus, not returning for quite some time.\n\nUpon his return, we quickly placed our order for various maki and sashimi hoping that the busyness of the place wouldn't slow the normally lightning-quick service.\n\nAfter a moment, he returned with a bowl of congee and an amuse-bouche of marinated tofu. Don't be alarmed, these are Mazz's welcome dishes. I find the tofu pleasant enough, but the congee seems a little too heavy and porridge-like to start a meal.\n\nBefore these two were done, he was back again with the ubiquitous Miso soup and house salad. The soup was seasoned and flavourful with lots of nori and tofu. The salad was a small mixture of iceberg lettuce with some vegetable shavings and slices: by the book, but not out of this world.\n\nJust as we were finishing our appetizers, the first of our rolls arrived. We ordered a Spicy Tuna maki: tuna mixed with crumbled tempura and hot sauce. My guest, not a fan of spicy food, likes Mazz's version, as she doesn't normally find it too spicy. Unfortunately this time they were a little too spicy for her. Good for me, but bad for her. A minor thing, but consistency means repeat business.\n\nNext, the rest of our food arrived: a sashimi dinner and Dynamite roll. The sashimi dinner is always a joy at Mazz, and this time was no different. The plate usually contains a nice selection of tuna, white tuna, salmon and possibly mackerel, and always has more pieces then advertised. This time was no different, and the fish was very fresh. The only complaint, and I've found this happens quite regularly in Toronto, is that the white tuna was served too cold. The Dynamite roll was large, but a little tasteless; seemingly prepared in too much of a hurry, a couple of pieces unraveled and fell apart on the plate.\n\nOverall, Mazz Sushi let us down a little on this visit. The staff seemed rushed and unable to provide the consistency that we have come to expect. Not once during our meal were we offered more tea, a slight unheard-of in a sushi restaurant. The food, although served quickly, wasn't up to their usual standards, and the wait to order was long. And although it remains quite inexpensive, the discount on the receipt for paying with cash seems to have disappeared with the updating of cash register system.","useful":2,"funny":0,"cool":1}
{"review_id":"fWdhtaQld99jXB-N9yu1tg","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"OR6iRk0vrMzE-1gLg-WYrw","stars":2,"date":1290384000000,"text":"If you've ever driven by High Park on Bloor street, seen the street-level sign that advertises 3 dollar breakfast, and considered stopping in to check it out, you're probably lucky you didn't. Sure, I know the breakfast is only 3 dollars, so I probably shouldn't be hard on it; but regardless of price, I'd still like my meal to be served hot and be put together with some level of care and attention.\n\nThis is a pretty mediocre breakfast here: a slice of warm ham, a strip of old bacon, browned toast, over\/undercooked eggs, leftover potatoes, breakfast served here is less-than-spectacular, and the service staff doesn't seem to care if you complain about it; I'm sure they've heard it all countless times before.\n\nAll of this, of course, is served in one Toronto's prized possessions, High Park. If it wasn't for the location, I certainly would have given them 1 star. In fact, it wasn't for the location, I probably wouldn't have eaten there at all. And in some strange way, I almost wish I didn't eat there. That way, the ad on Bloor street could have remained some mystical promise of a tasty, hot, and friendly-served breakfast somewhere in the heart of High Park.","useful":9,"funny":2,"cool":4}
{"review_id":"ujMcxx-EzqTHht2ZtsiQ1w","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"HOGdBz2w9VZbw2yyM-WA3g","stars":5,"date":1310947200000,"text":"The High Park neighbourhood is near-void of good places to grab a pint. Well, it was until The Mugshot Tavern opened anyways... The Mugshot easily provides the perfect answer to filling that void, and then some. Truly nice owners, delicious food, and a killer environment, this place takes the neighbourhood bar way beyond what it's expected to be.\n\nIf the Mugshot doesn't have the best draft selection in a 10 km radius, it certainly has the most well-thought-out one. These guys obviously love beer, and more obviously is that they've put a ton of thought into what is being pulled from the taps. It's all craft beer, and some interesting stuff at that. Chances are they have a few you've never even heard of, like the King Pilsner and Warthog Ale. It wouldn't be a stretch to say that they're probably one of only a handful of places in the city with either on tap. Don't expect to find Canadian or Blue here; what they offer is much more creative than any of that stuff.\n\nThe food, and the entire menu for that matter, is equally well-thought out. It's a killer mix of Southern-soul and comfort food, and they do a dam fine job of pulling it off. You can expect to find Southern favorites, like fried chicken with fritters, and some not so expected ones, like in-house-made corn dogs with chutney. The presentation is pretty decent too and again, goes beyond the typical bar stuff. It's pretty obvious that the people manning the kitchen know what the hell they're doing back there. Rarely do I go to a restaurant and have difficulty deciding what to order; at The Mugshot I was torn between a few items.\n\nThey've done a dam good job of ridding the place of all remnants of the defunct McKenzies that used to take up the place. They've clearly spent a lot of time, thought, and energy turning it into something completely new. The environment, painted in bright red and tactfully covered in old-school, famous mugshot photos, is easily the kind of space you could hang out for a long, long time. It's comfortable and welcoming, the way a neighbourhood local should be. Despite not being an overly large place, it still accommodates nicely, and any excess people can spill onto their cozy rooftop patio.\n\nAnd the staff at Mugshot? They couldn't be any friendlier. Having only been open about a week or so, you'd never know it by their attitudes. Likely working long hours, round-the-clock, getting the place ready and established, they're still sociable, out-going, and friendly. I sure-as-hell didn't feel like a stranger in this joint, and I don't think anyone with even the teeniest bit of personality would either. Even coming in by yourself is sure to get you some conversation.\n\nIt's clear that, after just opening, they're still trying to establish their crowd. It's still sorta random as to the people that might be in there. While one day the bar could be full of seniors, that evening it could be packed with a younger crowd. It seems to be dependent on the time of day, but it's also, unfortunately, the way the neighbourhood seems to work. Customers are sorta like family; you can't really pick 'em.\n\nThe Mugshot isn't just the kind of place you sit, drink, and hide from the world, although it provides that pretty well; it's also the kind of place that you can unexpectedly get some truly imaginative and delicious food in a comfortable and welcoming space. In a neighbourhood like High Park, The Mugshot Tavern is unrivaled in every respect.","useful":16,"funny":1,"cool":9}
{"review_id":"Wcquaa9O-kUULSFeV38hFQ","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"d_Go5TsiFMIRtCE6XS8Sjw","stars":4,"date":1335916800000,"text":"Located at the top of the restaurant strip on Roncesvalles, The Westerly is a cozy neighbourhood spot that is sure to please.  The uncomplicated menu features classic dishes done beautifully and just a step or two above others'. Five of us arrived for dinner last week and were greeted the charming co-owner, Tom, who presided over the evening with grace and warmth.\n\nWe spent an inordinately long time trying to decide from the 10 appetizers and 10 mains. Each looked better than the next and made our decisions more difficult than usual. While we deliberated, a bottle of shiraz and a custom champagne drink were ordered and a basket of some of the best foccaccia I've had in a long time arrived at the table. The crust was crispy and salty and the filled basket did not last long.\n\nAfter a solid twenty minutes of deliberation, we placed our orders: the romaine heart salad to split two ways; steamed PEI mussels in a grainy mustard butter with a side order of fries; roasted Chicken Supreme stuffed with pulled pork (yes, you read that right) served with bacon & smoked cheddar Israeli couscous; the house burger, made with ground chuck, veal and braised short rib; pan-seared arctic char served atop Israeli couscous with lobster; and roasted halibut topped with salsa verde and served with potatoes and mussels.\n\nWhen the food arrived, five sets of eyes widened. The plates were beautiful and smelled fantastic.  I'm lucky enough to have friends who share, so I got a little of everyone's meal. While all were delicious, there were a few outstanding bites that I would return for which I would The Westerly in a heartbeat. The Israeli couscous with smoked cheddar and bacon was aromatic and, surprisingly, not heavy at all. The smoked ingredients permeated the little couscous pearls, infusing them with a ton of flavour.  Next was the burger which was so tender it nearly fell apart in my hands as I ate it, juice running down my hands. It came with a spicy salsa that cut through the richness of the burger beautifully.  Undoubtedly, this is a big crowd pleaser.\n\nBetween the two fish dishes, I preferred the halibut. I liked the lightness of the fish paired with the bright salsa verde. There was certainly nothing wrong with the char - it was rich, not overcooked and the lobster-laden Israeli couscous was excellent. The balance and combination of ingredients in the halibut dish, though, really appealed to me and I will likely order it upon my next visit.\n\nAmazingly, we had some room left for shared desserts. I opted to split the warm apple crumble with fresh whipped cream while others went for the lemon tart. The crumble was comforting, filled with cinnamon and topped with large, buttery pieces of crumble. Incredible. Definitely a great end to a meal but I recommend sharing as it is quite heavy - otherwise you may be rolling out of the restaurant, pants unzipped.\n\nI would return to The Westerly, unquestionably. My friends and I had a great time in a charming restaurant in which we were treated well (though there was some miscommunication with a dessert, it was rectified gracefully).  If you haven't been, add it to your list and prepare for a lovely brunch or dinner!","useful":0,"funny":1,"cool":0}
{"review_id":"BP6XZmb7ugvc1De9mvoQpA","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"qDguZjZSYPOzq-je_EqO3w","stars":4,"date":1312156800000,"text":"Bamburger is the latest entry into the inexpensive \"gourmet burger\" trend taking over Yonge Street, including Gourmet Burger Co., South Street Burger Co., Burger Shoppe and Gourmet Burger.\n\nWhile Bamburger offers a decent take-out menu, we chose to enjoy their small, but friendly sidewalk patio, right in the middle of restaurant row at Yonge and Davisville. Bamburger is appealingly decorated in dark brown, natural wood and lots of greenery complimenting the patio and the booths. The lighting is soft and the seating is cozy. This is the kind of place that you could hang out for a great meal without the rushed \"diner\" feeling that often comes with burger joints. Our server was friendly, talkative and more than willing to explain the options on the menu, as there are many, and recommend some personal favourites.\n\nStarting off with drinks, Bamburger serves beer, wine, and old-fashioned Stewart's soda, but what is a burger joint without milkshakes? Bamburger specializes in milkshakes, including the usual vanilla and chocolate suspects, as well a special flavour each day for the nice price of $3.95.\n\nThe menu is varied, offering up soup, salads, sandwiches and desserts, as well as a kid's menu, but almost everyone here is in it for the burgers. Bamburger allows you to choose almost every aspect of your burger, from the type of bun, burger patty (beef, chicken, turkey, pork or veggie), as well as a plethora of toppings, some for the asking- tzatziki, chipotle mayo, olives, horseradish, pickles and banana peppers, and some for a price, $1-$1.50 each- bacon, avocado, onion rings, mushrooms, pineapple, and every kind of cheese you could imagine. Included in these cheesy wonders is \"Bamburger's Signature Cheddar Cheese Sauce ($1.50),\" and it is worth every penny. You can order the cheese sauce on your burger, or as a side for dipping your fries, and I would highly recommend both. Just try not to think of how much butter and cheese have gone into that little bowl, and instead, focus on how delicious it is!\n\nWe went with the \"Bambamburger ($11.50),\" which is 2\/3 of a pound of prime ground chuck, and the chicken burger ($9.95) for myself, on whole-wheat buns. Both of us outfitted our burgers with toppings galore, including mushrooms, onions, garlic mayo and cheese sauce for the \"Bambamburger,\" and avocado, chipotle mayo, dill pickles and jalapeno peppers for the chicken burger. Our meals took a while to arrive, as everything is cooked from scratch, but when they did, we received two overflowing burgers, with awesome homemade French fries and onion rings to match. Lesson learned from this particular trip to Bamburger is just because all of these delectable toppings are available, it doesn't mean you should put all of them on your burger. We both lost our buns to the slippery extras, and ended up eating our burgers by topping, not as one cohesive piece.  Next visit I will try a couple toppings at a time, and see if I fare any better.\n\nBamburger serves up great burgers, fries and shakes at a fairly good price, although if you go a little overboard with the toppings, you might quickly end up with a $20 burger, without realizing it. The service was friendly and engaging, and the atmosphere was very comfortable and neighbourly.\n\nIf you are hunting for a real deal on a burger, Bamburger might not be what you are looking for, but if you are more on the adventurous side, and want to have fun creating your own burger masterpiece, Bamburger will deliver.","useful":8,"funny":0,"cool":3}
{"review_id":"qn8taSTZERfaR6cPBEiOOA","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"amsvLzfEvCzLwP0MnXAJ1w","stars":4,"date":1290038400000,"text":"Since it opened, this place has become a West Toronto local favourite. And what's not to love? HUGE slices with fresh ingredients at reasonable prices. While I defintely have had better pizza before, for something quick, fairly inexpensive and reasonably tasty, there isn't much within walking distance that beats it. Just stay away at noon during the week, or the highschool crowd will eat you alive. \n\nIf you can't make it in, they have delivery available too.","useful":1,"funny":0,"cool":2}
{"review_id":"ytMNnwPkSBxmixfOrC--1Q","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"P6JCepLy6zlq-jEsrAqkKA","stars":3,"date":1295654400000,"text":"Having a craving for something spiced and exotic and motivated by a friend's comments that, \"there is a good Indian place over on Queen,\" I ventured out in hopes of finding something deliciously curried. Upon arrival we found that this is an odd spot on Queen West where a string of three of four Indian restaurants are all lined up side-by-side, so which to choose?\n\nOne thing I love about Toronto restaurants that you won't always find in smaller cities are menus posted on the outside of the building.  Little India stood out for it's well-organized, easy to understand and well-priced menu - in we went.\n\nIt is definitely an intimate spot, having no real capacity to hold very large groups, but was still quite comfortable for our dining duo. It was a cold Thursday night and not overly busy, so it did not feel crowded, and it gave the servers that much more time to be attentive.\n\nThe menu is substantial and has a variety of dishes. The price range is about $15 - $20 for an entrée, but be sure to ask which ones come with rice or Naan and which don't so that you can order them on the side.  First up was the mixed platter appetizer, which included samosas, onion bhajia, pakora and spring rolls. Everything was crispy, hot and just the right size for something before the entrée-and it came in at under $5.\n\nFor the main, I ordered the chicken kebab and my dinner partner had the Madras chicken.  Fair warning: if they tell you it's going to be hot, then it's truly hot.  We are all too accustomed to those Canadian-ized restaurants that tone down their spiciness to appease the masses, and it is arguable that Little India may do this too, but in any case, take the servers' recommendations to heart.  I do enjoy some heat, but my taste buds can't handle extremes, so I steered clear on this occasion-except for a little taste of the Madras.  For those of you who do like spice, you'll love this!  It has that heat that creeps up after a few bites, not that punch-in-the-face-burn that you might get from cheap chicken wings covered in Frank's Red Hot. Our server did lean my friend toward the less-spicy of the dishes she was deciding between at first, much to her dismay, but as it turns out his suggestion right on.  As for my tamer dish, it had more of a Mediterranean flavour to it; grilled, lemony and came with a cucumber salad garnished with cilantro.  It was a happy reminder of summer while dining in the depths of winter.\n\nOne of the greatest things about this restaurant is something I was not even able to take advantage of: the lunch buffet.  This is a bit of a hike from my own home and workplace, but for those of you in the area, I say go for it!  Buffets have a bit of a bad reputation (and for the most part it's well-deserved), but a small arrangement at a non-chain location like this can be a perfect opportunity to try a variety of what is on the menu, especially if it is food you're mostly unfamiliar with.\n\nOverall, I can't leave you saying it was the very best Indian cuisine I've ever had, but I can say that I wasn't disappointed, and I would go back again-especially for that buffet.","useful":3,"funny":1,"cool":2}
{"review_id":"lWZbF7GrYb8YFne_HN7m0w","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"pgomg_u3H2RtEVUYUcngXQ","stars":3,"date":1332288000000,"text":"I heart churros.  At least that's what the button said that was given to me by the man behind the counter at Pancho's Bakery.  After noticing the small collection I have attached to both my bag and jacket, he was quick to give me a new addition.  I was hesitant to let it join the ranks, after all \"I heart\" anything is a pretty bold statement, and to be honest, as of that moment, I had never had a mind blowing churro experience, or at least one that would have me declaring such strong feelings for them.  The only time I ever ate a churro was at an establishment once promoted by a talking Chihuahua, so you can understand my hesitation.  I pocketed the button, as its fate would be determined later.\n\nPancho's Bakery makes up a portion of what is titled the Latin American Food Court in Kensington Market.  The tiny little storefront on Augusta Avenue is deceiving, as it houses more businesses than I would have guessed.  Assuming it was only Pancho's in the building, I was surprised (and excited) to see a stall selling tacos, another dealing in empanadas, and the infamous pop-up Agave y Aguacate.  Pancho's itself occupies the space right up front, across from the Korean dumpling stand... I'm not sure exactly how they fit in.  Apparently the Latin American Food Court doesn't discriminate, and why should they?  Dumplings are tasty, and well, I'm sure another vendor only helps pay the rent.\n\nIt was around twelve o'clock on a Friday when my friend and I decided to check out Pancho's. Neither of us had eaten, but we couldn't quite justify having churros for lunch. We are of the mindset however, that believes dinner shouldn't be the only meal followed by dessert, so our afternoon repast that day would have a churro chaser.\n\nFull of carnitas tacos, and kimchi empanadas (Korean dumpling cart influence!), but not too full to pass up deep-fried dough, we made our way back to Pancho's.  I was promptly questioned as to the whereabouts of my button but I quickly placed my order as a distraction.\n\nThe churros at Pancho's are piped out in the front window, and brought to life for all too see, before quickly being led to their delicious demise in the deep fryer.  They are served hot, either plain or filled with your choice of chocolate, dulce de leche or strawberry syrup.  We ordered four, one of each flavour, and a plain.  At my servers recommendation I also grabbed some bread pudding and traditional Mexican concha bread.  As we had lost our seats (there aren't many to begin with) and the sun was shining, we took our treats to go.\n\nWe started with the chocolate, moved on to the dulce de leche, followed by the strawberry, and thus ended anticlimactically with the plain. They were crispy and sugar coated on the outside, while soft and (with the exception of the plain) accompanied with a burst of sweetness from within. Churro rookies be warned... a churro is a like a deep fried dough straw.  Any filling that goes in the top, will ultimately come out the bottom.  We left a sticky trail through the streets of Kensington that led back to Pancho's.  If Hansel and Gretel only knew about these, they would have rethought the breadcrumb idea.\n\nLater at home, I popped the bread pudding and concha into the oven.  Concha is a sweet bread that resembles a clam shell, hence the name.  It tasted a little of brown sugar, but overall it was bland.  I think the idea however is to serve it alongside a cup of café con leche or hot chocolate and get to dunking.  I could see this working in its favour.\n\nThe bread pudding however (traditionally served around this time of year to be eaten for Lent) was delicious.  Dense, but very moist, and just sweet enough, my girlfriend went nuts over it. Apparently she doesn't have a problem with dessert after other meals either - and this time it was breakfast.\n\nNow I'm not a fan of donuts, and the churro is essentially the donuts Spanish cousin, but I would take a Pancho's churro over a donut any day, and these are what I will return for.  As it turns out, I really do \"heart\" churros after all.  Now where did I put that button?","useful":2,"funny":2,"cool":1}
{"review_id":"ZXfIARFQ5sKpO0IEdc9qlw","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"Uw-kIS3HTuAohfg0edQZ3Q","stars":3,"date":1291766400000,"text":"Joy Bistro is a beautiful, sophisticated resto just inside Leslieville on Toronto's East side. It's likely that you've heard of it, or at least driven by and noticed the huge signage. It's become somewhat of a Leslieville landmark.\n\nFirst things first, I've heard a lot of negative comments about this place. By the sounds of it, it's one of those places that's hit-or-miss and completely different from one visit to the next; amazing one time, awful the next. Because I've never had dinner there, I can't vouch for evening dining, but I can say this: if you truly don't want run the risk of being disappointed, stick with their weekend brunch. This place is known for brunch. While they may have their issues, Joy Bistro has no problems delivering an upscale brunch experience that is chock full of style.\n\nBrunch at Joy Bistro is not really bistro-ish. The brunch food here is mostly just what you'd expect to see on a brunch menu in most Toronto restaurants, but they do their brunch stuff particularly well. Eggs benny is served up in numerous styles like Benetine (with spinach and peameal bacon), Norwegien (with stacked smoked salmon), and Teddy (with peameal bacon, roasted tomatoes, and spinach). With their near-perfect hollandaise, eggs benny at Joy Bistro is a solid choice.\n\nThat, and they've got a killer patio. Intimate and relaxing, their patio is probably one of the best things about this place and the likely reason that a lot of people still frequent it even after having poor experiences. Leslieville has got a few patio spots, but for sheer space, warmth, and location sitting on a busy little Leslieville corner overlooking Jimmie Simpson Park, Joy Bistro's patio is in a league of its own. Worth the sit down in the summer.\n\nThey've recently undergone mass renos, which has resulted in Joy Bistro Bar. Although this may have helped the space modernize, it's also contributed to changing their clientele base. Neighbourhood locals that frequented Joy over the years seem to have gone looking for other spots while those looking for a more trendy experience seem to take over. I guess as Leslieville becomes more popular, Joy Bistro wants to change with the nighbourhood, and while change can be good, in most cases, if it isn't broke them why fix it?\n\nDespite that new clientele, it's still a great place for brunch. So the next time a nice, summer weekend rolls around, head out to Joy Bistro for brunch on the patio. By the sounds of it though, I certainly wouldn't do anything but brunch.","useful":2,"funny":0,"cool":2}
{"review_id":"070Mmij4jDIqLV-Cy5w7bw","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"TFftsYkRIUtdo6ZhRwJ2lQ","stars":4,"date":1319500800000,"text":"So lately I've been on a bit of an Italian kick. Maybe its the changing of the seasons, and I'm subconsciously trying to carbo-load for the winter months ahead and preparing for hibernation. Whatever it is, this past Monday I was looking for just that at Terroni on Queen West.\n \nThe camp is divided on Terroni. People either rave about it or complain about the pretentious servers, the 'no-substitution' rule, or the slice-it-yourself pizza. Being a fan of this place, I have a rebuttal for each of these complaints. \n\nWhile (some of) the servers may seem a bit curt at first, I owe this to the fact that Terroni is busy - always busy - and their no-nonsense attitude is often mistaken for pretentiousness. Our server, although brusque, took our order diligently while complementing our choices, had our wine to the table in no time, and managed to pour two glasses of the stuff from the awkwardly shaped porcelain decanter without dribbling it everywhere (which is something we later failed to do). \n\nAs for the no-subsitutions rule, if you want to choose your own toppings, then head on down to that infamous sub-par pizza joint (you know the one...with its orange boxes and redundant title) and stuff your crust while you're at it. Since when did slicing pizza become a chore? Just a few simple back and forth motions with a knife and voila! Freshly sliced pizza.  \n  \nRegardless of the division, Terroni is always packed. Monday at 9:00 found us one free table upstairs, which was where our preference lay anyway. Although I do love to pull up to the bar, it tends to get a bit clustered on the lower level, and while the upstairs isn't exactly quiet, shouting across the table isn't required. \n\nOur waiter promptly brought us the menus and we poured over the apps and the twenty-nine - yes, twenty-nine - pizzas they have to offer.  \n\nWe started with the Funghi Assoluti ($12.95):  breaded and baked oyster mushrooms served on arugula, sprinkled with parmesan, and drizzled with a balsamic glaze.  It was superb, but sharing proved to be problematic, not because the portion wasn't large enough, but because we simply didn't want to. Social graces saved us, but I had visions of the two of us in an Animal Planet-esque showdown... circling the last mushroom with fangs bared and hackles raised. \n \nWe chased all of this down with a velvety Piemonte that was oddly served in a jug, which made it difficult to pour. Our server made it look effortless, but us? Well, we just made a mess. I did manage to solve the problem however (pour from the side, and not from the oddly shaped lip) and fortunately for us we had a seemingly bottomless half litre.\n \nNo sooner had we finished sharing the last 'shroom was our pizza delivered to the table. We went with the Primavera ($15.95) to contribute to our daily recommended dose of veggies and to somehow convince ourselves that we were being healthy. All of the pizza at Terroni is thin crust and ours was weighed down heavily with tomatoes, red pepper, (more) mushrooms, and artichokes with a few black olives decorating the centre of the pie. \n\nNow when I say thin-crust, I mean it.  Maybe I'm just speaking for myself here, but I have absolutely no difficulty finishing a whole pizza without any assistance at Terroni. I'm a big fan of folding slices before biting into them, and the crust at Terroni is so thin and pliable I always envision myself folding a whole pizza in half,...and then in half again...and then having my way with it.  Once again, as with the sharing, social norms seem to get in the way...","useful":2,"funny":1,"cool":1}
{"review_id":"MhkLj0c7EjcasKObXbr35A","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"tEfmHuo_dNanyTaC5PyoOQ","stars":3,"date":1366848000000,"text":"Torontonians have welcomed Momofuku with open arms and with satisfied stomachs. Last month, David Chang, founder of Momofuku and internationally renowned chef, was in Toronto to play host in an unexpected arena: The TIFF Food on Film series. He joined a sold-out theatre of fellow foodies (including us) to watch his favourite culinary film, Ang Lee's \"Eat Drink Man Woman\", and then engaged the audience in an informal Q&A session that spanned topics ranging from film to the trappings of celebrity chef-hood.\n\nThree hours of salivating over delectable Chinese food on the screen left us craving more than popcorn, so we decided to check out Chang's Momofuku Daisho shortly after...\n\nMomofuku Daisho's ambience is definitely the highlight of the experience. It's open concept and top to bottom glass gives it a simplistic, modern feel. After a successful debut in NYC & Sydney, Chang was lured to Toronto by what he says was a 'perfect and unique' opportunity presented by the Shangrila Hotel: to house three, different takes on his cooking in 1, single building.\n\nWith the accessible Noodle Bar already a favourite of ours and a recent lacklustre (and wallet-busting) venture to the top-rated Shoto, we were eager to try our hand at Momofuku Daisho a mid-level offering that centers the menu around pre-ordered, 'family-style' dishes.\n\nAs you can probably imagine, it can be challenging enough to pick options in the moment, let alone coordinate an order for our group of 7 a week in advance (of which we were), but eager to get the full experience, we pre-ordered the much hyped about fried chicken and beef short ribs. The waitress kindly cautioned us to tread lightly when considering the rest of our order, on account of the deluge of food on the way. (Warning: Consider your wallet and alternative menu opportunities prior to committing to the pre-order. On a do-over, we would have banked one family style dish and ordered the rest off the menu.\n\nFirst we enjoyed two dishes of lightly pickled, chilli-infused cucumbers. If these cucumbers are the Asian take on 'bread and butter' the West is in more trouble than economists predict!\n\nNext came the Spicy Sausage and Rice Cake dish, inspired by Chinese Szechuan cuisine: these melt-in-your-mouth rice cakes punctuated by spiced sausage and Asian greens are a quintessential menu creation, packing flavour of Momofukian proportions!\n\nWe then indulged in a Momofuku classic: a pork-style bun, this time of the deboned chicken wing variety, coupled with dill, a glazey hot sauce and crudité; a real crowd pleaser for our group of 7.\n\nAnd then, the massive plate of fried chicken arrived in all of its glory. Included with vegetables, scallion pancakes (oily and delicious) and a fancy soya type sauce.\n\nLastly, we tried the beef ribeye shortribs flanked by white Kimchi, bean sprouts and some sticky white rice. In our not-so-humble opinion, the ribs were a tad on the fatty side,\n\nWe decided to end the night right and order the chocolate - five different textures of it. A healthy spectrum of liquid to solidity; an interesting experience, but we'd suggest the more intimate smaller size, even for a larger group like ours.\n\nAll in all, we were blissfully overfed at Momofuku Daisho. It was lovely dining with David Chang in town and we luckily caught him at the restaurant to snap a pic. Good friends and good food - what could be better?","useful":2,"funny":0,"cool":0}
{"review_id":"YCilP6BtVj-3Pjq3uTXVwA","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"uF86ZhygpBEGr3CudNemYA","stars":1,"date":1300320000000,"text":"For those that don't know, O.Noir is that unique place where you dine entirely in the dark. Yes, it is completely pitch-black, and no, your eyes will not eventually adjust. You can't see a dam thing down there in O.Noir's dark and dingy basement dining room.\n\nSeriously though, O.Noir is easily one of the worst dining experiences I've ever had in Toronto, not just because the food and service were awful, but also because I left the place feeling ripped off. O.Noir took a concept that could have been interesting and did absolutely nothing with it. It was nothing more than eating crappy food in a dark basement room with the lights off.\n\nFirst off, the food at O.Noir is horrible. It's just glorified, hotel banquet food. You know the stuff: salad with balsamic vinaigrette, pre-cooked steam-table-held vegetables, chicken with coriander sauce. It was all of those boring old courses served at weddings and buffets in the 80s and 90s; there's nothing imaginative going on in the kitchen here. The food had absolutely no bearing on eating in an environment void of light. You'd think that if they were going to block your sense of sight, they'd want to serve food that would heighten your other senses, like food with strong aromas or flavours. Nope. Just unthoughtful, crappy food. In a way, the food was so bad that I'm glad my other senses weren't heightened by the lack of light.\n\nI ordered the 'surprise' menu. I mean really, why wouldn't I? I'd like to at least try to see if I could use my 'enhanced' senses to not only guess but also to better appreciate whatever it was I was eating... For me, the 'surprise' was that I still don't know what the hell I ate. No one ever told me. I sort of assumed that once we were finished eating, the server would have at least told those of us that ordered the surprise what it was we ate so that we could confirm our suspicions, but nope, he just took our plates away without any explanation at all.\n\nSpeaking of our server, he was one of the worst in the biz. Not only did he not bring us anything to drink until we were finished our first course and constantly get our orders mixed up, but he was inattentive and bored; I don't blame him though, it'd be hard not to be bored down there in the dark dining pit of O.Noir. He often left us wondering where he was, not because we were in the dark, but because he often left the room or crept up behind us.\n\nThe seating arrangements leave you feeling bored and isolated too, especially if you're part of a group. In a dark environment, you'd be better off sitting at a round table so that everyone can be part of the conversation. Our seating arrangements at a long, rectangular table left those on the end of the table feeling isolated and alone.\n\nSitting near the entrance to the dining room sucks too. Believe it or not, the servers actually signal that they're entering the room by banging on the door. We must have heard it 40 or 50 times. In a room that is supposed to heighten your senses, this seems absolutely ridiculous. Surely there must be a better way to enter the room and make sure that no light enters. If there is, O.Noir didn't figure it out, or they didn't care. They just decided to stick with the loud banging.\n\nAlthough we couldn't see anything, a quick feel confirmed that we were using those cheapo hotel-style metal chairs and wooden tables. I mean, I know we can't see anything anyways, but if our senses were supposed to be heightened, then surely our sense of touch should be a part of that. You could argue that because you're eating in the dark, the restaurant doesn't need to spend as much on the space, but I'd argue that because you're eating in the dark, the restaurant needs to spend more on the space and everything in the environment needs to be taken into consideration.\n\nOn the way out, the bartender asked us if we were staying in the attached hotel, and right then, it all made sense to me; this place was taking up the old banquet facilities of the hotel. It explains the strange layout the dining room has and the trend of hotel food and furniture. It confirmed one thing for me: if you're going to have a restaurant where your guests eat in the dark, then the space definitely needs to be built specifically for that purpose. There's little doubt that because they didn't, O.Noir sees little repeat business. People come for the novelty, but likely leave disappointed.\n\nO.Noir offers nothing more than eating crappy banquet food in a dark basement with the lights off; absolutely nothing more than that. The pitch-black did nothing to make the experience better or heighten my senses in anyway. I was just eating crappy banquet food in the dark...","useful":15,"funny":3,"cool":1}
{"review_id":"8Jw4NUzEWzHnNu4-Z2QRiA","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"-chGaXHZsoLKLHPJMMsdmw","stars":5,"date":1312502400000,"text":"Utopia Cafe and Grill is aptly named. Let me tell you why... One hot and muggy Saturday evening, I found myself walking down College Street in search of sustenance and something cold to slake my thirst. Now, I'm notorious for my inability to make a decision when faced with many options, and College Street has a lot to offer in the way of restaurants. I passed by bistro after restaurant after lounge, growing hungrier by the minute. How did I choose? Divine intervention lent me a helping hand as the sky opened up and let loose a torrential downpour sending me running into the open arms (see: doorway) of Utopia.\n\nIt was already jam packed, which had nothing to do with the rain. There was a line-up for tables, but I managed to grab a seat at the bar to peruse both the menu and the environment. What is it about exposed brick and hardwood floors that make a place so cozy? Whatever it is, Utopia has both.\n\nNeedless to say, I was immediately enamoured, and when I opened the menu, that bubble remained intact. Now, I wouldn't call myself a vegetarian, nor would I dive into a steak with gusto, so for a selectavarian such as myself, I couldn't have designed a more heavenly menu if I tried. All but three of their appetizers are meat free, and they allow you to substitute soy (grilled or breaded & fried) for meat in most of their main dishes. Meat lovers and vegetarians unite!\n\nAnd if that wasn't enough, it gets even better! I forgot to mention earlier that in between appreciating the exposed brick and opening the menu, I honed in on the beer selection (tunnel vision at its finest). And it made me smile, for they had KLB Raspberry Wheat on tap. Typically, I like my beer to taste like, well...beer, but I make an exception for KLB, especially in the summertime (although I find excuses to drink it at other points in the year) as the natural raspberry essence paired with the beer itself is possibly the most refreshing combination ever. Like angels dancing on my tongue...delicious, raspberry angels. Its difficult to find on tap, and Utopia has it, so I chalk them up some more points.\n\nI started with the Mumahari Dip (roasted red peppers, pomegranate molasses and walnuts) that comes served with naan. While the dip itself wasn't exactly visually appealing (but really how many dips are?) with a likening to cat food, I was willing to overlook it. The Everlasting Gobstopper of dips, every bite of the Mumahari started sweet, moved onto nutty and finished with a bit of a kick. Delish.\n\nBetween the dip and the KLB, I was already very satisfied, but I wasn't done yet. Next came my Grilled Veggie & Goat Cheese Burrito. I love a good burrito, and this one didn't disappoint. Grilled zucchini, red peppers, eggplant, onions and a generous layer of goat cheese came wrapped in a soft tortilla. Served alongside substantial sides of both garden salad and rice, I couldn't finish it if I tried...and I tried. There is absolutely nothing wrong with leftovers though, and I can vouch that a Utopia burrito tastes just as delicious the day after.\n\nOn a tight budget? All of Utopia's mains hover around the $13 mark which in my opinion is a great deal considering the quality of the food and the very sizeable portions. I can easily see two people splitting a burrito and leaving the place with full stomachs (and wallets). The only problem with this scenario however, is the lack of leftovers.\n\nIf Utopia has any drawbacks, it's that the place is hot in the summer - really, really hot. The lack of air-conditioning combined with the open kitchen may have something to do with it. If I were anywhere else, I just may have been uncomfortable, but I had my pint of KLB, exposed brick, and a smiling bartender that made me feel like I was the only person in the room (okay...now I'm just getting carried away, but that being said the service is genuinely warm). Looking around, even though everyone had a sheen to them, nobody seemed to mind. Everybody just looked happy. People don't sweat at Utopia...they glow.\n\nFor a pasta-heavy neighbourhood, Utopia provides a nice deviation. It's the kind of place I could eat at everyday, so it's probably a good thing I don't live nearby, but it will definitely be my College Street go-to. They also have a four season patio (another good reason I don't live in the area, as much to my liver's chagrin, I have an almost instinctual draw to drinking outside).\n\nUtopia is a contradiction unto itself: it's frenetic, but it's calm; blazers sit next to longboarders; meat lovers co-exist amongst vegetarians; it's hot, but oh so cool. As its name implies, this Bohemian spot in Little Italy is truly ideal.","useful":3,"funny":0,"cool":2}
{"review_id":"8xhfrLJ9SGpX2NU6FTiTHA","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"4LXZzgsrM1ZyS_-uB9Od2Q","stars":4,"date":1291161600000,"text":"I'm a sucker for top-notch pizza. By top-notch, I mean pizza that is served sizzling and fresh and made with high-quality ingredients. Pizza like that is true craftsmanship; pizza like that I could eat every day. In my continuing effort to find superior pizza, I looked to Lil' Baci in Leslieville. My visit didn't disappoint me.\n\nLil' Baci's dining room is a decent-sized dining space, but the tables are packed pretty tight, so don't expect too much privacy. You'll likely hear everything that the table next to you is talking about. If you need to escape your neighbour table, in the warmer months you may want to check out the cute backyard patio. Comfortable, busy, and social, it's the place to be when the sun is out.\n\nWhen I'm eating Italian food, I like to start off with a glass of red vino or cold Italian beer. Lil' Baci's wine list is small but thorough and their beer list offers some nice Italian choices; Moretti and Perroni are my personal favourites.\n\nLil' Baci has a seriously amazing dandelion greens salad.  If you've never had dandelions as food before, this would be the one to expose yourself to it. The greens are slightly bitter, but the bitterness works well topped with shaved Parmigiano, cracked black pepper, and freshly squeezed lemon. Perfect starter.\n\nAnd the pizza, they do it right. Lil' Baci has a savoury and seasoned tomato sauce base that expertly compliments the four cheeses that are layered on their Quattro Fromagi; my personal favorite.  They've got some other really outstanding pizzas to choose from like the Margherita (with tomato, basil, and mozza), the Lil' Baci (with pecorino, sausage, and fennel pollen), and the Gorgonzola Dolce (with gorgonzola, Yukon gold potatoes, and caramelized onions). All of their pizzas are served on signature thin crust dough that is seared and blistered perfectly.\n\nLil Baci has got a really small pasta menu. Ridiculously small. There's only three items. But still, these 3 items are done perfectly. They're all made with quality ingredients and use that great tomato sauce that's on the pizza. My favorite is just the plain ole' Spaghetti and meatballs.  It's got just the right amount of fresh basil, sauce, and Parmigiano. The portion size isn't huge, but with that dandelion salad and something from their Insalata menu, it's more than enough.\n\nLil' Baci also has a Panino menu, which surprisingly is different from their pizza menu. I love the Panino Tonnato. Packed with Italian tuna, caper aioli, sun-dried tomatoes and arugula, it's perfectly pressed into an amazing bite.\n\nThe dessert menu has a few options, but when I was there I had a lemon prosecco tart. The crust was buttery, but a tad on the dry side. The custard-like lemon filling had a refreshing prosecco flavour, which balanced the acidity nicely.\n\nI head to Lil' Baci when I want some decently priced Italian food and some amazing pizza. Lunch or dinner, what you end up with is a steal anywhere in the city!","useful":1,"funny":0,"cool":2}
{"review_id":"6kDLjGNr7SzoUTwhwTazBA","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"8MWiywu09bhLWIpzVaD4gw","stars":3,"date":1290729600000,"text":"I was here the other day for lunch and, as expected, there was a bit of a line.  That's usually a good sign, and in this case it's definitely true. But waiting for a table isn't all bad; there's lots to see in this place: kitchy cute decor and lots of memoribilia that reminded me of my childhood. When I was there, the place was cramped and full of hungry people, but everyone was in good spirits. \n\nWhen I look at the menu, i always find it difficult to make a choice. They've got a big, diverse menu with both savory and sweet items. All of it looks delicious.  \n\nFirst off, I'm a vegetarian, but, like to get the breakfast pocket, sans pemeal bacon of course.  It's chock full of fluffy eggs, caramelized onions, mayo and cheddar cheese on a warm and soft onion bun. Aunties and Uncles encourages you to choose between a few sides, but I've never chose anything but the potato salad. Seriously, this stuff is good. A great combo of chunky red potatoes, dill, Dijon and spices, it's savoury and creamy. Admittedly, my food did and usually does take a bit of time to arrive, so if you go, don't go when you're in a hurry.\n\nFruit juices and iced teas are good choices, but I wouldn't finish off with an espresso as they may suggest. Their espresso is nothing special and just plain weak, and it certainly doesn't stand up to Manic coffee located just a few doors down. If you're craving an after-meal-caffiene-fix, I'd suggest you head over to Manic.\n\nAunties and Uncles loses points in service. The service staff seem a bit cold, sorta aloof, and alot grouchy, but despite if you're willing to overlook that, then this is worth a visit if you're in the College & Bathurst area.","useful":0,"funny":0,"cool":0}
{"review_id":"zNu5ytMhNJ9N70AF04X9rg","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"zz3CqZhNx2rQ_Yp6zHze-A","stars":5,"date":1299888000000,"text":"I am in love...\n\nHow do I know? I paid $22 for a burger lunch and am absolutely ok with it.\n\nGrindhouse is serious carnivore territory.\n\nThe first thing to stand out, though, was my drink. I went for my usual diet cola and I got, \"Sorry we don't have anything with aspartame.\" In fact, you shouldn't go there expecting to get your go-to big brand soft drink at all. Well, well, well I better go for something really interesting then. Boylan's Birch Beer - a root beer drink, sweetened with cane sugar, with pure vanilla extract and only one preservative (sodium benzoate, typically used in soft drinks and other acidic preserves). Their amazing dedication to fresh and natural ingredients obviously did not end there.\n\nAll of the ingredients are local and fresh, the burger meat comes from naturally raised livestock and is Genetically Modified Organism, hormone and antibiotic-free. You will not find anything that has refined sugars, or artificial sweeteners (hence the lack of Coca-Cola and Pepsi on the premises). They literally prepare everything in-house. The buns are made there and they also make the ketchup and mustard themselves, right in the back kitchen. The \"fresh and never frozen\" attitude is not good enough here; if you're going to do it, do it right.\n\nTheir burger creations are unique and creative; a turkey burger with black truffles and cranberries, yes they do have a veggie burger and it's soy-free and, my choice, the black and blue burger are just a few of the menu items. I was presented with a Cajun spiced beef patty smothered in blue cheese sauce and cooked only to medium, with a side of onion rings (who was I kidding with that diet cola anyway).\n\nIf you can be sure of the meat quality, requesting a burger cooked less than well-done will give you much more flavour and a better texture. On my first bite there was an immediate rush of barbecue charcoal flavour emanating from the patty; it tasted like summertime. The blue cheese sauce was mild and, considering the Cajun description, it was spiced, not spicy. The onion rings were huge and somehow satisfyingly greasy but unbelievably crispy.\n\nI actually don't often talk about presentation because, frankly, it's all about the taste for me. I have eaten enough beautiful yet disappointing and ugly yet amazing dishes to spend much time considering plating. However, the simple beauty of this burger and onion rings dish was lovely - just a white plate and a burger, without a toothpicked-pickle piercing the bun. Lovely.\n\nMuch like my University professors, I hesitate to give out a \"perfect\" score and I can't on good conscious say that this was the very best burger in the city, but - a big but - they gave me something pretty darn close to the best burger around and the attention paid to good, fresh and healthful ingredients truly impressed me.\n\nTheir name might be harsh and gory, but you'll find burger-fare inside that is gentle and kind to you and your body.","useful":3,"funny":1,"cool":1}
{"review_id":"nauqE-2FDrcfjGinmGA9Xg","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"gIQZsUBJhtyLquNd2Wss1w","stars":4,"date":1303257600000,"text":"Cupcakes have reached a point of utmost popularity in the world of baked goods. Why are people flocking to these brightly coloured, frosted, palm-sized desserts? Well, I'm sure there is some greater social commentary to be made here about a reversion to childhood or a need for comfort foods in our over-stressed, over-worked lives, but, in the case of Prairie Girl Bakery, it's just simply that they taste so darn good!\n\nWalking into Prairie Girl Bakery is almost like entering a fine clothing store - everything is placed just so. The whole space is pristinely clean and clear of clutter; literally nothing exists except a counter and back-wall display. The cupcakes are kept safely behind the employees, lined up row by row waiting to be selected and boxed up. All of the focus is on their one and only product. There is no time wasted on brewing coffee, serving tea, or making sandwiches. Everything comes down to one thing: the cake and the icing.\n\nWhen I first walked into the store, I thought I made a mistake. I went in to grab a dozen cupcakes for a work function and was shocked at the lack of merchandise on the shelves. I had to ask, \"was I supposed to pre-order before coming in?\" Not at all. They just take extra care to provide the freshest product possible, promising never to serve a \"day-old cupcake.\" So, baking in big batches to keep the shelves stocked to the brim all day is out of the question. The team at Prairie Girl Bakery prides itself on being resourceful and limiting waste; they even take any leftover cupcakes to a local charitable organization, Toronto's Second Harvest, that is dedicated to providing realistic solutions to hunger. Are cupcakes a necessity for a charitable food organization? Of course not, but why not give where you can and provide something a bit more luxurious than canned food to those in need.\n\nThe cupcakes come in two sizes, 13 flavours, and an array of beautiful colours. You won't find any unneeded extras here, like (in)edible sugar flower toppings disguising an otherwise delectable treat. The cakes are simple and the swirls of icing are in the spotlight on top of light bases. The range of flavours include peanut butter banana, red velvet with classic cream cheese icing, chocolate-chocolate, chocolate-vanilla, chocolate-hazelnut, chocolate cake with peppermint icing, and my ultimate favourite, chocolate cake with strawberry icing. The strawberry colour was fairly mute, but the flavour was intense. Even more impressive was that the chocolate cake didn't overpower the icing or vice versa. Each deep flavour perfectly complemented the other.\n\nA dozen mini-cupcakes come in at $18.95 and one dozen regular size at $31.95. My gluttonous side will only order the mini cupcakes from now on, allowing me to eat two or three different flavours in one sitting. However, there is something supremely gorgeous about the sight of one of their regular sized cupcakes sitting in it's very own container (complete with viewing window) waiting only for you.\n\nWant to feel a little less guilty about completely indulging in these sinfully tasty treats? Prairie Girl Bakery's dedication to remaining as all-natural as possible streams throughout the whole operation. Not only do they use recyclable cardboard packaging, but they are absolutely free of preservatives, artificial flavours, and hydrogenated or \"trans\" fats. I'd say that's mostly healthy eating.\n\nOn one final note, I have to say that I love the mythology around this place. The story is that Prairie Girl Bakery's creator, Jean Blacklock, learned all she knew from her family back on her Saskatchewan farm. She eventually left a career in law to bring that down home prairie, old fashioned baking to us city-dwellers. I don't think there could possibly be more charm or more beauty in the simplicity of what Prairie Girl Bakery is and what they produce.","useful":2,"funny":2,"cool":3}
{"review_id":"fPy3Kzbv0xXE78bhvh3gNQ","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"bEVWHtBRYVwqaaNF4mWNYg","stars":4,"date":1317600000000,"text":"Coquine Restaurant serves up an excellent weekend brunch, with all the charm and flavour of a European patio café. The restaurant is decked out art-deco style, with lots of white tile, dark wood and vintage posters lining the walls. Coquine boasts several large dining rooms and a quaint patio, perfect for people watching or a leisurely meal. A large group of us descended on Coquine one Sunday morning for a late brunch, and found the menu to be both classic and eclectic. Let me explain. .\n\nTraditional Sunday morning brunch normally sees a line-up of the usuals; pancakes, omelets and waffles. While Coquine serves up all of these items, they do it all with a pronounced French flavour, not afraid of adding a little gourmet to your breakfast.  Coquine's wonderful Apple Jack's ($11) offers up a stack of fluffy pancakes, topped with delectable caramelized apple and maple syrup. The delightful Vanilla French Toast ($12) is flavoured with fresh vanilla bean and served with a berry compote and Chambord. The Steak Frites ($19) were delicious, and came with a side of Parmesan truffle fries and mayo. While you may not be able to fly to Paris for weekend brunch, you can certainly enjoy the savoury French-style cuisine just south of Yonge and Eglinton.\n\nEveryone found their meals to be excellent, and I can personally attest to both the quality and quantity of the wild mushroom and shallot Quiche with chévre ($14). Coffee (and Bailey's) was always available, and attentive extras like water for the group, and non-stop breadbaskets make the service at Coquine both pleasant and under-stated.\n\nOverall, the value for meals was very good, as portions were large, and fit for sharing. Both the hostess and the server were polite and attentive, but never obvious. With an excellent location between Davisville and Eglinton subway stops, and great food and service, Coquine should be on your list as a must-try for weekend brunch.","useful":2,"funny":0,"cool":1}
{"review_id":"XC9yT_qCACdgsyLhWOjR6A","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"vnIdWzIB2W4j9cDcd6tHAQ","stars":2,"date":1299628800000,"text":"La Revolucion is amazing! Well no, it isn't, but that's exactly how I wanted to start this off. Man, I really wanted to love this place. La Revolucion just looks so dam cool, that I figured the whole experience was going to be amazing. When I was first drawn by the interesting front stained-glass window and poked my head inside to look around, I figured that in no-time-at-all, there'd be a lineup to get in. Sadly, I don't think that's going to be the case anytime soon.\n\nLa Revolucion is a Mexican restaurant, but at first glance, it certainly doesn't scream Mexican; after eating there, I'm not even sure that's what they're going for. It's a sparsely decorated joint that for some reason--at least while I was there--feels the need to distance themselves even more from their Mexican roots by blasting annoyingly loud rave music. I mean, their food is the typical, standard Mexican fare you'd expect, like enchiladas and tacos and burritos, but other than that and the few Mexican-esque decorations, there wasn't much Mexican about it at all.\n\nThey're heavily pushing the banditos aspect of Mexican culture, which is actually a pretty cool gimic in my eyes. While I get the whole concept of banditos and revolution, it seemed as though La Revolucion fell a little short of their delivery of the theme. While what little decor they have there is mostly bandito-related, the rest of the theme is left to interpretation. La Revolucion does feel as though they're finding their identity, but they have a lot of difficulty conveying what that identity is exactly to their guests. Sitting there, it doesn't feel as though you were part of the revolution, it feels as though you're interrupting them while they plan it, and they can't wait for you to leave so they can get back down to business.\n\nPresentation isn't their strong point either. They haphazardly slap the food down on the plate, without much concern for appearances. My enchiladas were slightly warm and covered in tasteless green salsa; my burrito was humungous, but it was bland and not nearly warm enough. When I asked for hot sauce, because it was nowhere to be found, I got a small ramekin with some sort of sauce, but it's details remained a mystery that was left for me to find out with no explanation from the server, and while you're waiting for that stuff to all arrive, there's no offer of chips and salsa or even water for that matter, which would have definitely improved the experience.\n\nInterestingly enough, before this place was a Mexican place it was, well, a Mexican place. Whoever it is that owns it probably just decided it was time to rebrand, and while that may have been a great idea on their part, the execution of their new brand and concept needs some polishing because it's hard to tell exactly what the concept is. La Revolucion may be a restaurant, but a revolution it is not.","useful":7,"funny":3,"cool":2}
{"review_id":"vl_fNpZEXn30gWc8Aj2CJA","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"SeRG0f7jIS2Jq-CTZKqGoA","stars":3,"date":1304467200000,"text":"The Rotisserie House is a family-run, Portuguese barbeque (or Churrasqueira) restaurant in the Liberty Village area. Like most places owned and run by families, this restaurant is small, a bit cluttered with a mishmash of décor and, no matter the number of other patrons there at the time, has a staff that makes you feel like the centre of attention.\n\nThey happen to be closed on the weekend, but from Monday to Thursday they are open from 11:00 a.m. to 7:30 p.m. and Fridays from 11:00 a.m. to 8:30 p.m. The hours are slightly odd, but it makes for a great lunch spot, especially for those like me who tend to take lunch anytime between about noon and 3:00 p.m.\n\nThey offer a variety of chicken dishes, a number of different sides and even one vegetarian option. You can get a 1\/4 or 1\/2 rotisserie chicken dinner - white meat or dark meat - with a choice of two small sides for $6.50 - $10.00. For an additional $0.99 (small) or $1.98 (double) you can get a side of onion rings, Greek or Caesar salad.\n\nThe menu itself is pretty huge and is filled with quite a few options. The regular roster of sides, for example, includes Portuguese rice, roasted Parisian potatoes, steamed vegetables, French fries, garden salad or potato wedges. Mains include the abovementioned chicken combos, rib combos, a variety of salads and soups, chicken wings and fingers and sandwiches, like pulled chicken, grilled vegetable, grilled chicken, pork or sausage. They even offer catering.\n\nI decided upon the pulled chicken sandwich with a side of Parisian potatoes. The pulled chicken is topped with their \"famous\" hot sauce, served on a white or whole wheat Kaiser and is dressed with mayo, lettuce and tomato. All of this, with a drink, came in at about $9.\n\nOne of my all-time favourite side dishes are those lemony, roasted potatoes available at most Greek restaurants. Well, The Rotisserie House's Parisian roasted potatoes are a close second. They are red, probably from Paprika, and just a bit fiery from the restaurant's signature hot sauce. The pulled chicken sandwich was flavourful, tender and also had the same red hue from the sauce.\n\nI do enjoy spicy foods, though I am a bit of a wimp. This restaurant's hot sauce had a great kick and a good flavour, but it won't burn your mouth to the point that you can't taste anything else. This is really important, since they throw the hot sauce on their dishes, whether it's requested or not. Don't fret too much about all the spice if you're grabbing lunch and heading back to the office, you can buy a pack of gum here too!\n\nConsidering the size of this restaurant, I was quite surprised by the number of items they have on the menu. It was not overly busy when I walked in, so everything went very smoothly as far as timing and service went. The staff is extremely friendly, but very small, so I am curious to see what happens when it gets really busy. However, they seem to have it all figured out.\n\nIf I lived closer to Liberty Village, I could see this being a regular staple for me for a quick lunch, or to grab some dinner on the way home from work. The prices are reasonable, the food tastes good and it's quick and satisfying.","useful":5,"funny":0,"cool":1}
{"review_id":"fDOAUUMS9KY4NBPI_XArjQ","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"Lmqj8Me1EiYljYj0N1W7JA","stars":3,"date":1309478400000,"text":"The most common praise of Dark Horse is its patio; the most common complaint about Dark Horse is its lack of service on the patio...\n\nIf you've been to Bloor West Village, you know that there aren't a lot of patios in the neighbourhood, and any patio that you do find is likely going to be small, cramped, and full of people. With the exception of the Firkin on Runnymede, Dark Horse has one of the biggest and best outdoor spaces in the village to drink pints, people watch or eat burgers and fries.\n\nBut, as many people have pointed out before me, the service can range anywhere from slow to crappy when you're sitting out there. While you're waiting, you may even be waiting so long for service that you'll feel compelled to go inside and get your own drinks, which causes the server to give you attitude when she eventually gets to your table, which causes you to feel uncomfortable; you see the vicious circle taking shape here...\n\nAll-in-all, the food at Dark Horse isn't half bad. Granted, they aren't going to win any awards anytime soon, but for pub food that goes well with a few drinks, it's pretty decent. While some of the food, like the calamari and nachos, is previously frozen and highly unimaginative, other items, like their Village Burger or fish and chips, are clearly made in-house and truly tasty. They also serve a weekend brunch that is worth checking out, but expect to wait for a table; it fills up quickly with the neighbourhood locals.\n\nAll of the expected draft options are here...I think. Truth-be-told, the server never actually rattled off the draft list to us in the limited time she spent at our table. Luckily, there were a few beer-branded signs in the patio, which makes the process a little easier, but a lot less convenient.\n\nDark Horse's problems are easily fixable; they just need a bit more staff. Trust me, sit back on the patio, have a pint, and watch them work. It'll quickly become obvious that they're understaffed. Another server or two during their busier times, and Dark Horse could be fantastic.\n\nTruth be told, it's just a pub, and a fairly average one at that. If you're in a hurry, you may want to avoid this place, but if you've got some time to kill and want to soak up some sun on a patio, Dark Horse provides nicely.","useful":3,"funny":2,"cool":0}
{"review_id":"cRJcKF3fQCUDjX69daVTzA","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"y-sRypoTK2L6EuozhEMQzA","stars":2,"date":1293580800000,"text":"Located in the Annex, in the middle of Mirvish Village, The Central is a bar, a restaurant, and a live music venue.  The dimly lit house-turned-restaurant with the splendidly seamy vibe immediately and completely tugged at my heart strings.  I loved the rickety setting and little details like the \"Draught: Use Your Eyes\" sign behind the bar.\n\nBut, as with any new love, first impressions can often deceive you; The Central played with my emotions.  The menu - and be warned the online menu is not what you will find when you arrive there - has so much potential and I very much wanted the food to live up to my expectations.  My party of three shared grilled calamari with side of salad greens in a light citrus dressing, followed by entrees of grilled mushroom salad with shrimp, a grilled vegetable sandwich with sweet potato fries, and a cheesesteak sandwich with Tom Yum soup, all of which (with three beers) came in at just over $60.\n\nThe menu items are not very risky, but still need to be done carefully to be successful.  As much as I wanted everything to come out perfectly, it simply did not.  First of all, the calamari was a very large serving - so far, so good.  But, in grilling it whole, the tips became overcooked and the centre remained undercooked, and there was a hint of burnt charcoal flavour.  The grilled vegetables were also overcooked, producing an all-over brown hue, making them completely lose their individuality.  The cheesesteak had the right flavour, but again, the beef was slightly overcooked and chewy.  Finally, after looking forward to trying one of the desserts in hopes for menu-redemption, like the candied strawberries or the ever-infamous deep fried Mars bars, we were told that all they had available was ice cream.  Not so impressive.\n\nWhile the main dishes and lack of desserts were disappointing, I do have to commend them on a couple of things.  All of the side dishes were on-point; the dressing on both the calamari dish, and the mushroom salad were light, flavourful and had a good citrus tang; the sweet potato fries were crispy, and came with a side of a creamy cinnamon dip that was a great alternative to regular ketchup; and the Tom Yum soup was hot, spicy, and a great choice for a chilly December night.\n\nI have decided that The Central could very well become a favourite spot of mine for drinks, and maybe appetizers, but is just not an ideal choice for a full dinner.  The venue itself is one that you should check out, and I expect it is only better when the patio is open in the summer.  If you don't want to sit in the main bar to listen to the band they have a cozy lounge space upstairs that can be rented for private parties.  Also, they clearly take pride in the beverage menu, especially the beer choices.  When we had some trouble deciding on a pint, we were offered a sample of a new label on tap called Netherworld, a Flying Monkey brew, which is similar to the popular Mill St. Tankhouse Ale.\n\nI give them an A+ for atmosphere, but only a gold star-for-effort on the menu.","useful":2,"funny":0,"cool":1}
{"review_id":"Mk_ZW9-ol4mFr9HMvjQmiQ","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"vOUIiRfyA9jtra7Hez6mpg","stars":3,"date":1326412800000,"text":"Wanting to try something new, and looking for a cool place to go for pre-Yuk-Yuks dinner and drinks, my friend and I decided to try out Everest Restaurant on Queen West.\n\nWhat seemed to be a quiet Saturday evening when we first arrived at 7pm, quickly turned into a fairly busy \"club\" like dining experience. And Everest is certainly dressed to impress. The restaurant feels both sexy and modern, with dark mood lighting, clean lines, comfortable and cozy booth seating, and an eclectic playlist\/DJ, depending on what night you are in. With a great view of Queen West for people watching, and MuchMusic across the street, the atmosphere, music and style of the restaurant blend in perfectly with the locals.\n\nI was very excited to try a new place with an interesting food theme, something a little different from the usual weekend dinner and drinks, and hoping to find a new \"go-to\" place for a fun and creative meal. I secured reservations before our arrival, however, we were greeted with a bit of a frosty reception, waved to an area in the front of the room, and told I could sit wherever I wanted. Unorthodox, maybe, but sit we did!\nPutting the hostesses' indifference behind us, we decided to delve straight into the wine menu, and with a little help from our server, selected the Beringer Cabernet Sauvignon Knights Valley, a California vintage from 2009 for about $40. The wine was excellent, and I found the wine menu to be well priced for the quality of wines on the list.\n\nThe dinner menu ($15-$20) presents a somewhat more challenging predicament. Filled with Tibetan and Indian dishes, along side the same old North American stand-by of pasta and sandwiches, I found myself unsure if this was a Tibetan restaurant, or your average Italian eatery all dressed up. It's not that I mind an eclectic menu, in fact I appreciate one, however when venturing out to try a new type of cuisine (in this case, Tibetan), one wants to be sure that the restaurant is absolutely committed to their craft, and have their \"specialty cuisine\" down pat. Thus, I was unsure of whether venturing into the momas (Tibetan dumplings) and sha-momo (spinach and beef), or the fettuccine alfredo was the better option.\n\nAfter some quality deliberation between the Tibet\/North America paradox, I decided to try a platter, a mix of several different Tibetan style foods, to allow myself to experience as much of the cuisine as possible. The menu seemed heavy on potatoes, stewed meats and rice, so I decided to try almost all of the above. The stewed potatoes were good, cooked just right, but tasted much like something I could make at home, no real special spice or flavour that made me feel like I was trying something exotic. The rice was cooked with raisins, which just didn't do it for me, and was a little bland.  My meal was served with steamed Tibetan vegetables (broccoli and carrots), which aside from not seeming exceptionally Tibetan to me, were surprisingly good. An interesting side note, both of our meals were served with naan bread, which really was just pita bread from my estimation. Overall, I was fairly underwhelmed by my choice. My friend ordered the butter chicken on rice with naan bread (same problem), and said that she enjoyed her meal. The butter chicken looked and tasted pretty standard to me, so that must be a good thing, but neither of us could really wrap our heads around the lack on naan bread at restaurant serving Indian food. \n\nWhile I thoroughly enjoyed Everest restaurant for its attention to the design décor and ambience, I was definitely a little disappointed with my first foray into Tibetan food. I think the next time we decide to go out for Tibetan style cuisine, we will try \"Little Tibet\" further down Queen Street.","useful":0,"funny":0,"cool":0}
{"review_id":"kUgUo3SfZDj_XwAECQtkjQ","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"HX0QhTVWztcawNof0KUhgQ","stars":3,"date":1302998400000,"text":"Despite it's seemingly religious name, this Blansdowne cafe has nothing to do religion. It's a little cafe chock-full of character and a cool, homey-sorta vibe. You know the type of place I'm talking about: mismatched plates and cutlery on the tables, Value Village-esque paintings and pictures on the walls, slightly damaged panelling on the ceiling. It sorta looks like one day someone decided: 'Well, we have a stove. Why don't we open a restaurant?' It seems random, but truthfully, it doesn't matter all that much. If anything, those details make it better and much more comfortable.\n\nThere really isn't that much for food here. They've got a couple of items that are fairly easy for the lone person working to make when the place gets busy, which it definitely does. Mostly it's just the standard pressed sandwich kind of thing. No soup, no fries, no salad, as a side anyways. The friendly guy working there told me that it's not that kinda place. He said that it's mostly a cafe and a place to drink booze.\n\nThe menu is up on a chalkboard, and like I mentioned, it mostly has pressed sandwiches, like grilled cheese with apples and Tandoori chicken stuffed Naan bread. The sandwiches certainly aren't bad, but sadly, the majority of the stuff they make seems to have been brought in with little of it made in-house, like the Naan bread. The Naan was the kinda stuff pressed and packaged somewhere distant, and then bought at some grocery retail giant. It definitely would have been better if they worked with someone local to get some truly authentic stuff. They do have quite a few baked goods too. I'm not sure if those were made in-house or not, but they look nice next to a cup of the great coffee they serve.\n\nI've seen some pictures of brunch items at Holy Oak, like eggs Benny, but based on when I was there I couldn't see that happening. Maybe they do bring someone in on the weekends to cook, but they guy working never mentioned it to me when I asked him about the food or the limited menu.\n\nI went during the week for lunch, and this little place was pretty packed. Mostly with twenty and thirty somethings in front of laptops. It seems like a pretty cool place to work for those of us that frequent coffee shops for that sorta thing, because there really isn't much else in the neighborhood that offers it. It's cozy and comfortable, and I could easily see myself sitting there with a coffee, comfortably typing away.\n\nHoly Cafe is a neat place, but it certainly doesn't warrant a big trip to get to it. If you happen to be in the neighborhood and you're looking for a comfortable place to soak up WiFi and get a decent cup of coffee, Holy Oak can definitely provide. But it doesn't offer much more than that.","useful":5,"funny":1,"cool":3}
{"review_id":"yH17eZfSnECroW_OLBaJAg","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"ILlebFUb89ZozizpVGeHdQ","stars":4,"date":1331337600000,"text":"Sharkey's is no more! And thank God for that. I mean, I know the restaurant options in Bloor West Village are limited, but I really have no idea how that place hung on for as long as it did. With horrible service, brutal food, and staff that spent more time admiring themselves in the mirror than their customers, they created a place that was meant to be avoided. Yet somehow, it managed to exist on that corner for years.\n\nSo, imagine my surprise when I saw the beautiful sight of a building permit and brown construction paper covering their windows one day...\n\nA few months later, The Kennedy Public House was born. And boy-oh-boy, this place is exactly what  BWV needs. BWV is virtually void of restaurants serving great food. Ok, so there's earth and Dr. Generosity, but other than that, your choices are pretty limited compared to the tons of options available to other Toronto neighbourhoods. That's why seeing something as untraditional in BWV as The Kennedy is such a welcoming sight.\n\nThe Kennedy has a cool vibe that, if you know the neighbourhood, you wouldn't expect to see there. It seems oddly out-of-place while at the same time seems oddly comfortable being there. With a laboriously nice interior space, the entire design is well-thought out a nice to be in. But surprisingly, The Kennedy isn't just nice to look at; it also has exceptionally good food.\n\nThe Kennedy's menu doesn't serve your typical pub grub; it's much more imaginative than that. Non-traditional items, like polenta burgers, calamari po'boy sandwiches, and pork belly casoulet easily compliment more traditional pub fare, like wings, macaroni and cheese, and thin crust pizzas. Their menu does a fantastic job of covering everyone while still remaining concise and well-thought out.\nWorking with a number of local businesses, the Kennedy also proudly sources bread and meats from places you're probably familiar with, like Cobs bread and Wellington County Beef. Nice. I've always found that knowing where the food comes from somehow makes it taste better.\n\nOne other thing worth mentioning: The Kennedy has unisex bathrooms. And they've incorporated them into the place really nicely, except for the hand-dryer. The bathroom hand-dryer must be the loudest dam one in the entire free-world. If you happen to be sitting in the back-half of the restaurant, it might even ruin your experience. Hopefully they'll turn to either cloth or paper towels, or they'll just find one that is quieter.\n\nKeep in mind though, if you're looking for a relaxing experience, this isn't the place. With strollers and screaming babies during the day that makes it resemble a Montesorri school, and lineups and loud music in the evening that makes it resemble something at John and Adelaide, The Kennedy doesn't provide a quite and relaxing experience; what they do provide is a killer take on the food you wouldn't expect to find in a typical public house.","useful":1,"funny":1,"cool":1}
{"review_id":"iXp5A9Zl02oomdjHyIgVjA","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"m7PPpShEdfhtV-7NnPN1Nw","stars":3,"date":1292630400000,"text":"The Duke of Kent serves up traditional pub food in a cozy spot at the corner of Yonge and Eglinton.  Kent is just one of a series of 'Duke Pubs' scattered around Toronto, and judging from the fairly comprehensive website, each has a slightly different décor, but all of them seem to tap into that English corner pub ambience.\n\nAfter a long week at work, I was on the hunt for a casual space to grab a pint, enjoy some hearty food, and catch up with some friends; the Duke of Kent was a great choice...for the most part.\n\nI snagged a corner booth with my dinner group on a busy Friday night.  When we first walked in, it seemed hopeless. We wanted dinner, but there was nary a table to be seen.  The staff did everything they could to make a space for us so we weren't forced back out into the cold to one of the other countless restaurants in the area.  That is what service is all about, and we were happy to stay.  Many thanks to the serving staff for being so accommodating on a hopping Friday night!\n\nAs for the food, it is the expected and welcomed pub spread.  They offer up fish & chips (yes, served in a basket on paper), pot roast and potatoes with buttered peas, and even bangers and mash.  You will find an array of reasonably priced English pub food on the menu, with entrees coming in at about $12 across the board.\n\nAs I've said before, I tend to go for the specials, and that night it was Moroccan Stew.  Unfortunately, I am sad to say it was disappointing.  The dish was somewhere between a curry and a Mexican chili, and I was given a healthy serving for the $12.99 price-point.  But, I couldn't help but become envious of those around me who had gravy-topped pot pies, crispy fish and chips, beefy burgers and gooey quesadillas.  I probably would not have been as put-off by the it if it was labelled on the menu, as it was on my bill - just 'vegetable stew'.  It was not as exotic as the name lead me to believe, and with a delicious-looking curry dish on the main menu, I expected more spice and life in my 'Moroccan' Stew special.\n\nFor a visit to the Duke, I suggest going full-English.  I saw enough plates of fish and chips go by to convince me that it is a popular item, and how much more traditional can you get than that?  Also, I have the 'famous' deep-fried pepperoni targeted - it has to be famous for a reason!\n\nAt the end of it all, the Duke of Kent draws in a wonderfully lively crowd, and provides a great atmosphere and service, albeit a bit slow - but hey, it was busy!  My food may have only been so-so, but the brew was cold, and my night was great.","useful":3,"funny":1,"cool":2}
{"review_id":"3kYgvvUUMP6nR49sTWrmCw","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"_DuPG5sSEwZcgfjdndQc4A","stars":2,"date":1320883200000,"text":"Hey Meatball! Hey Mediocre! Walking into Hey Meatball! instantly feels like you are walking into your old high school cafeteria. A few two and four person tables are set up, and there's one long 16 person table down the middle, all this in a space that was clearly not built for this many diners. I wasn't entirely sure if we were to seat ourselves or wait for direction. We inquired with the cashier\/order taker\/owner to find out. I know he was the owner because he told us.\n\nFor a restaurant that serves all meatballs, all the time, we were surprised to find that there were only three entrée selections on the chalk board and a few side dishes to choose from. Of the four side dishes, two had already been crossed out for the day, leaving a side salad or butternut squash soup. I decided to order the vegetarian eggplant 'meatballs' with polenta and parmesan, and my dining partner ordered the Porky  meatballs, (a combination of pork and ground beef) with tomato sauce on spaghetti. Immediately I was told that they were out of polenta and was asked \"what would I like it on?\" Unsure of my options, even after asking, I replied with \"spaghetti,\" as that was the only thing on the chalkboard that I was sure that they had in stock.\n\nWe each ordered a homemade cream soda, we were given a number, and we took a seat. Our number was called out about 10 minutes later, and we immediately noticed the disparity in portion size. My eggplant 'meatballs' were served on a huge swirl of very al dente spaghetti, whereas the porky meatballs arrived on what could be considered an order from the children's menu- if there was one that is.\n\nThe food was good, but not great. The eggplant 'meatballs' had a nice consistency, and were spicy and full of flavor. The tomato sauce that the dish was served with was hearty and not too salty, however I thought that the pasta could have been cooked a little more. The Porky meatballs were excellent, the combination of pork and beef proved to be a hit, however we both found that the tomato sauce served with the meatballs was far too sweet for the savory nature of the dish.\n\nThe saving grace of the meal was the amazing cream sodas they make fresh on site. They were a throwback to the Jones cream soda that you used to drink as a kid, but without too much fizz. Unfortunately, when the beverage you order to go with your meal is the best part of the experience, you know that there is something missing.\n\nHey Meatball! is missing the warm and friendly atmosphere you would expect to find in a restaurant with a wide open kitchen, communal tables and a chef that endeavors to use ingredients within a 100-mile radius of Toronto. All great qualities to have in a unique restaurant with a unique concept, but here, it just didn't seem to create anything memorable. There was no music playing while we were in, and the gruff reception and fluorescent lighting that made it a little harsh on the eyes made Hey Meatball! mostly a letdown.","useful":5,"funny":1,"cool":2}
{"review_id":"We853schI2SMtGPJHYHYtA","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"Egn5h9fStvVKcFH7kaLQig","stars":3,"date":1367020800000,"text":"3030 has young-professional written all over it. Craft beers, slightly pretentious menu and crowd, its Junction location (sigh, I remember the days when they avoided this area). And although I spend quite a bit of time in the neighbourhood, I only managed to getting around to checking it out a few days ago. That's mostly because it's a difficult place to notice, with an unassuming, simple '3030 stenciled on the front door, and not much else to identify it.\n\n3030 is huge inside... seriously huge; especially for a place in The Junction. Stuffed full of small table settings and 2 full bars, it seems more like you're in a concert hall than a neighbourhood restaurant, and that's with good intention. 3030 is built to be a live music venue that doubles as a food-venue, and in my opinion, not the other way around (although that's what they go for in the off hours).\n\nOne thing's for sure, they put a lot of thought into their draft selection. The back bar has taps full of local-ish craft brews, including Wellington, Beaus, and even some other, more difficult one's to find, like the Junction Craft Brewing's IPA (which was fantastic), a Sawdust City stout, and a Broadhead White. Clearly, they take their beer selection very seriously. The unfortunate thing about the bars though is that with no stools to sit on, you get the distinct that they don't want you hanging out there.\n\nMuch like you'd expect from a place aimed at young-pros in The Junction (sigh), the atmosphere sets it up as a pretty cool place to hang out, with shelves full of board games and walls lined with old-school pinball machines and plenty of interesting art. With the retro pinball machines all lit up in the evening, it gives the perfect backdrop to a night out.\n\nBut with just a little '5 dollar snack menu' card on each table, you wonder what about those of us that were there for more than snacks. Our server haphazardly and unconfidently rattled off the items they serve (there was only 4 of them at the time) but not before having to go back to the kitchen a couple of times before she could get it right. I asked if the items changed daily, hence no menus and the difficulty remembering them, but nope, these items had been here for a while she said. While it's cool to try items out to see what works, I hope that eventually they'll put together a more permanent and more expansive menu, or at least one that changes seasonally.\n\nBecause none of their mains sounded appealing to us, we instead opted for the items on the snack menu. The Butter Chicken Wings, while mostly tasty with the typical strong flavours you'd expect, arrived lukewarm. The Potato Wedges on the other hand, were indescribably and inedibly  hot, which turned out to be ok because they were bland and tasteless anyways. Overall, we just didn't find any of the items on the snack menu impressive at all.\n\nIf you're in the neighbourhood, 3030 may be worth checking out, but I'd say solely for their draft selection; and although the fact that there isn't much like it in the neighbourhood makes it the kind of place you want to check out, I'd wait until there is a concert or show you want to see before making the trek. In my opinion, it just isn't worth going out of your way for.\n\nWith a Gabby's now opened next door, I remember feeling a little upset for them having competition so close from some evil, corporate chain, but really, it's of little consequence. It's obvious right away that they'll both be attracting very different types of people.","useful":2,"funny":1,"cool":1}
{"review_id":"-4BMAgivIQ7hj3ca_Wnapw","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"RADloW1UROUn4FJFU4JJNg","stars":4,"date":1319846400000,"text":"I know St. Lawrence market is full of great food, but I never would've thought that tucked way in the back of the building I'd find something quite like Buster's Sea Cove.\n\nKeep in mind though, this takeout shop isn't Rodney's or Oyster Boy, and I'm definitely not trying to convince you that it is. In fact, Buster's Sea Cove isn't even in the same boat. At Buster's, you won't find soft lighting, romantic ambience, or table-side service, but what you're pretty much guaranteed to find, is some killer seafood served up really, really quickly.\n\nFresh-made fish and chips are the staple in this place, but they've got so much more than that. Their huge menu has everything from crab cakes and clam strips to fried oysters and fish-topped salads. And their fish-type sandwiches, something that they happen to do really, really well, are outstanding. I'm not talking about your standard old fried-fish-on-a-bun here; Buster's rivals the best seafood takeout places with crab cake paninis and seared tuna melts sandwiches.\n\nBut don't overlook the fish and chips either. This little takeout stand easily delivers one of the best plates of the stuff in the city. They've got a few varieties of fish to choose from, and each of them is served up expertly battered and crispy. Each plate of fish and chips also comes with in-house made fries and a killer slaw.\n\nBuster's also has a few other options you wouldn't expect from a takeout stand. Grilled swordfish, seafood bisque, rainbow trout, even octopus to name a few. It ain't fine dining by any means, but they truly do push the limits of what takeout is both in quality and selection.\n\nChances are though, once you get your food you'll be spending most of your time searching for a place to eat it. Busters only has 4 tables or so scattered around in front of the counter, but if those are full-and they probably will be-you're on your own. There's an exit close by to the Market's back patio and parking lot where most of Buster's customers end up, but trust me, if it's a nice day out, that'll fill up pretty quick too and you'll be left looking for a place to eat your by-then-getting-cold food.\n\nTruth be told though, even if you're standing out back of the market among parked cars and alleyways, it won't matter all that much. You might not even notice. Whether it's a crab cake sandwich or plate of fish and chips, the food at Buster's is just that dam good.","useful":2,"funny":0,"cool":1}
{"review_id":"j1eUfIWCc-IlZNmRlROqtQ","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"YWd0I1BxSzFG61lSyC3IyQ","stars":2,"date":1290038400000,"text":"Disgraceland isn't bad, but it's definitely a bit overrated. Thier biggest fault is that it's completly hit-or-miss. Somedays everything comes together, other times... \n\nTheir menu takes an exceptionally creative look at stuff you'd expect to find in the southern states with heavy concern for those that prefer meatless. Everything from Southern-fried chicken and Tenessee pulled pork sandwiches to grilled veg stew and fried tofu sandwiches. They also have a fairly original selection of sauces to dip your fries in that's worth mentioning. The staff are cool, layed-back, and they actually seem to care that you're there.\n\nBut like I said, all of that can change the next time you go in. Food could come out luke warm and greasy, staff could be stuck-up and simply not care. \n\nDisappointingly enough, the one thing that you can count on that Disgraceland has that is consistently great, is one hell-of-a cool name.","useful":1,"funny":0,"cool":0}
{"review_id":"r13Q1UVbPED1I-RRsbJDgw","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"5PO5ZIHIcaTNIiHNoRKDqg","stars":1,"date":1340236800000,"text":"The Kensington Cornerstone offers a gluten free menu.  It has gluten free beer.  It has a cute patio and it's painted to look like a circus tent.  I chose it for all of the aforementioned reasons.  It checked a lot of boxes on my list.  I won't be going back.\n\nThis past weekend found me turning another year older, and because I've been experimenting with a gluten-reduced diet as of late, I decided my birthday dinner should be had at the Kensington Cornerstone.  I looked at pictures.  I perused the menu.  I read reviews.  It all seemed positive.\n\nIt was a beautiful evening, so I was happy that we snagged a spot on the patio.  We had to wait awhile for our drink order to be taken, but at this point we were still taking in our surroundings, people watching (Kensington offers some of the best), and trying to catch passing bubbles being dispensed from somewhere across the street. \n\nJust when I was at the point of helping myself to my neighbouring tables' pitcher of beer, our waitress appeared.  The up side to the wait was that we had enough time to choose not only our drinks but our meals, so we placed all of our orders to make up for lost time.  While we had intended to order one of their pitchers of sangria (and\/or mojitos, and\/or margaritas), we all ended up opting for beer.  My girlfriend and my mom split a pitcher of Upper Canada Lager, while I decided to try one of their 4 gluten free selections.  I figured having a wheat beer with my gluten free meal would be like washing down a pie with a diet pop, so I stuck to my guns.  I've had what Nicklebrook has to offer in the line of GF beer, so I was looking forward to trying a new one.  I asked our server what the most popular one was, and she pointed me in the direction of a red ale by La Messagre that operates out of Montreal.\n\nWhen our drinks arrived, I took that first sip so full of hope, and for a split second I thought I was going to have the chance to gloat in the face of my girlfriend (I know, I'm nice aren't I?) that my beer didn't taste horrible.  I didn't have that chance.  Did I just drink beer?  Or did I just suck on a penny?  Even I was a bit confused at that point.  It started off so well, but then finished with a strong metallic and bitter taste that seemed to coat my tongue and the back of my throat.  Bitter...just like I was at that point.\n\nSo by this time about 30 minutes had passed since we ordered.  Our thirst was quenched but we were more than peckish.  Thank goodness our server was coming our way!  But instead of food, she came bearing bad news.  My girlfriend would not be dining on the stuffed peppers that she had ordered as they had run out, and for some reason, they just thought to tell her now.  Not only would we have to wait even longer for our food, but our plan to share our meals was scrapped as we now both had the pulled pork sandwich coming to us. \n\n(Sound of clock ticking)\n\nAnother half hour passed and our meals finally arrived.  As hungry as I was I couldn't make it through my sandwich ($13).  It looked appetizing enough, but the pork wasn't nearly as tender as it should have been (I've been spoiled by the likes of Fidel Gastro lately), and the sauce was a bit of a turn-off, being too heavy on the tomato and cilantro.  The gluten free bread was quite good, and even had a bit of a cheesy crust but unfortunately it had been sitting in pork juice, so it was now more of a sponge.  Yes, a pulled pork sandwich should definitely be messy, but you should still be able to pick it up. \n\nMy mom was impressed with her salmon ($18), but she wouldn't complain if there was a gun to her head.  It did look good though, and the portion was generous, so not all was lost.\n\nLooking back on it now I wish I had just scrapped the GF diet and stuck with an old faithful restaurant.  What was I thinking trying to eliminate carbs for my birthday dinner?  Why did I go out of my way to both experiment with a restaurant and deprive myself of something I love on my special day?  Who does that?  So while I'm not taking the blame away from the restaurant, I will share some of it with them...but only some as the service was really what ruined our experience.  Maybe the food wasn't amazing, but the fact that we had to wait so long for it was the added insult.  The servers themselves were lovely girls, but somewhere back in the kitchen, the ball was dropped. \n\nAfter we begrudgingly paid our bill, I decided to throw the whole GF thing out the window and head to Ronnie's for a bottle of (gluten rich) 50 to end the night on a positive note. As we sat there on the patio I couldn't help but stare across the road at The Grilled Cheese.  Oh, what could have been.","useful":1,"funny":1,"cool":0}
{"review_id":"l_xCcePP38yNSPrlziIQSA","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"-dcI8oWvxdMCGp00da8Ksg","stars":4,"date":1359331200000,"text":"Jalapeno Pale Ale?  Yes, please!  Mexicali Stout?  Yep!  The on-site brewed beer here is awesome.  Creative, delicious and local.  A perfect hat trick of beers!\n\nThey had a great accoustic singer who started in the afternoon but got talked into playing into the evening... he was fantastic.\n\nThe atmosphere is pretty bare-bones, which is nice.  A long picnic table, some bar tables and some covered outdoor seating that I cannot wait to try.  It was COLD in there, my husband wore his coat and I used mine as a blanket... \n\nThe service is friendly.  The crowd, as usual for NODA, is ecclectic and fun, friendly and non-pretentious.  They also offer a 1\/2 gallon fill-up to go, or to enjoy on-site, which was a great price at $14.\n\nBonus: they serve peanuts.","useful":2,"funny":0,"cool":1}
{"review_id":"W_sbnKfvzxlgNNqqg93Orw","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"E0TK141YMBP0LBknhVKEqw","stars":3,"date":1359244800000,"text":"Seriously? This restaurant has 4 crepe options on the menu for dinner.  Totally disappointed. The spinach and mushroom crepe was delicious but it was the only vegetarian option.  Call me crazy, but with a name like \"Crepe Cellar\" I imagined several options...\n\nThe tap beers are a sampling of the UK... Which is great but the best local brews are a block away.\n\nThe atmosphere is nice.  We sat at the bar.  My hubs had the fish and chips, which he enjoyed.  We skipped dessert.  MIght be a better option for brunch?","useful":3,"funny":0,"cool":0}
{"review_id":"FadohB_xUDDuhNRHPiSWYQ","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"JsUytp_MuZ4AX5JWfi2eLw","stars":4,"date":1347062400000,"text":"Target at Midtown is a fantastic shopping experience, especially if you happen to have Val as your cashier.  She is a smack-talking hoot!\n\nSeriously, with parking that protects you from rain and all aisles usually open, how can you not love this Target?  \n\nDon't get me wrong, I am all about shopping local, but with 3 children that need a dump truck load of back-to-school supplies, Target is my choice.  And, seriously, where else can you pick up a cute top, scarf and set of sheets, while simultaneously loading up a cart with colored pencils, paper, and notebooks?  (And their junior dept. clothes, while tricky to find smaller sizes, are hard to distinguish from pricier brands... a huge bonus to this mother of a middle schooler).","useful":0,"funny":0,"cool":0}
{"review_id":"_1VmRHWm9gs0-N6TLlDPBA","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"ewSh93zoRx0DIWRKU-fFwQ","stars":5,"date":1345248000000,"text":"I am not a 5-star person.  I think everyone\/everything has room for improvement.  But, Fenwick's?  They are spot-on, delicious every time.  \n\nThis is owned and operated by Catherine, of Catherine's on Providence for any old-time Charlottean.  She is a superb chef!  Her culinary and wine skills are some of the best in Charlotte.\n\nThis is not fine dining.  It is not fancy.  In fact, it is quirky and small and you often feel a little close to your dining neighbor.  \n\nMust try:  Tomato Bisque Soup, it comes as a side option with their meals.  My hubbie says these are the best burgers in Charlotte... I am a veggie, and I beleive their grilled veggie burger is the best in town.  Their fries are great.  Sweet potato fries?  Delicious!  Tuna salad, with  melt-in-your-mouth croutons and an array of homemade dressings to choose from?  Pure yumminess.  My husband also adores the club sandwich.  Oh, and the muffins.  Delectable!\n\nAs creatures of habit, my order is always the same: Veggie burger, with cheese, side of soup and fruit.  And this is a 5-star meal delivered with 5-star service.  \n\nSit at the bar and get to know your neighbors!\n\nPretty tight for families with children... I don't bring my younger ones in here.","useful":1,"funny":0,"cool":0}
{"review_id":"8MQ4k_NResZ6H4c8ZS8y_Q","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"7cnz3nRaVuwHLVTTaV5-PA","stars":5,"date":1345248000000,"text":"Me loves!\n\nThe stir fried wide noodles are perfection!  \n\nThe make your own spring rolls are my favorite... a big plate overflowing with fresh mint, basil, cilantro, noodles, bean sprouts, cucumber, and tofu.  Soak your rice wrap in the hot water, fill with goodness, squirt with siriachi, and dip in sauce.  Delight taste buds.  Repeat. Again and again.\n\nThe atmosphere is nothing to write home about but with authentic food like this, who cares?\n\n--Restroom is yucky, bring sanitizer--\n--My kids love this dining experience--","useful":0,"funny":0,"cool":0}
{"review_id":"2nI2kKeoXlBAdPk6MoBTsA","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"KEGLWeFAWXvo0W2LnujhtQ","stars":5,"date":1345507200000,"text":"This has been a favorite for 13 years or more.  I have tried a lot of the menu items and have never been disappointed, but my favorite remains the make-your-own spring rolls.  A close second is the vegetable hotpot, and my children love (like squeal-out-loud love) the fried pineapple rice-- it arrives in a pineapple boat and it is delicious.\n\nFirst off-- you do not come here for atmosphere.  They have gussied the place up a bit with some fake bamboo and updated posters on the walls.  The fact that you can see a run down laundromat and a car inspeciton station that may or may not be boarded up should not deter you from this spot.  \n\nDo come for the hot tea, the service, and the food.  It is outstanding.  Although, the rumor is the \"original\" Lang Van owners are now the owners of Ben Thanh (which might explain my love affair with that restaurant).  The staff is so helpful and knowledgable in assisting with food selections.  We have taken several people here for their first visit and our waitperson has always helped make selections that were enjoyed by our guests!\n\nThe food is plentiful.  You will not leave here hungry!  Flat noodles, hot pots and spring rolls are our favorites (and the aforementioned fried pineapple).  We also love the little cookies that come with the check... perfectly sweet but do have peanuts.\n\n--This is a FUN place to bring a small group of people (6ish) to sit around a round table and share food.--\n\n--This is a great restaurant for children to experience delicious and healthy food.  The servers dote on well-behaved children here.--","useful":1,"funny":0,"cool":0}
{"review_id":"5AaqmPwBBcxE_vB6k8fFyQ","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"foD6m1lhxAAfNEHdUbBpOA","stars":5,"date":1348099200000,"text":"I love this park.  I love the tennis courts.  I love the lake (or pond?).  I love the aggressive geese that steal picnic dinners out of unsuspecting children's hands.  I love the interesting people that study, read, and play frisbee on \"hippie hill\".  I love the bridge to the band shell.  I love the yoga that is offered here on occasion.  I love the caddywampus dogs that people are walking here.  I love the random fishermen.  I love catching a little bit of a baseball game here.  I love the train.  I love the second playground with its big sandbox and swings.  I love the nature trails.  BUT, the thing I love the most is having a picnic in this park on a lovely day-- loading my car with scooters and bicycles and balls and dolls and watching my children behave wildly!  I also love the lacrosse for girls offered by CYLA at this park.  \n\n--Festival in the Park is a fun (but crowded) event held here annually.\n--lots of charity walks and runs here...\n--bathrooms are at your own risk!  yucky!","useful":2,"funny":2,"cool":3}
{"review_id":"VKPLM1C4fLIVP2wKpwYXeA","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"a2h9nrVMpNvfwMBo1e8ffg","stars":4,"date":1354924800000,"text":"I love The Fillmore.  I was between 4 and 5 stars and the reason I went with 4 stars is because I paid $18 on Wednesday night for two Bud Lights.... and I think that is ridiculous.  And I am not a fan of the VIP seating they had on the second level for the Willie Nelson concert... it took up way too much room, making the venue feel a little overcrowded.  These seats were not there for the Black Crowes or Five for Fighting and I prefer them not to be there the next time I am lucky enough to take in a show here.\n\nThe bathrooms are great here, which is an added bonus and a surprise!\n\nThis venue is fantastic for those who love to get up close and for those who want a more intimate setting for a show.  Really, Willie was spectacular and I loved the small venue for such a big man.  It makes it nearly impossible to think of going to a coliseum\/arena event.\n\nShows often sell out, so buy tickets early!","useful":0,"funny":0,"cool":0}
{"review_id":"oejdurr3hkUWd0707UZtyQ","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"XagMSw5tADQbNSx0IM7TaA","stars":5,"date":1374883200000,"text":"This gem never disappoints!  It is the perfect store to browse and giggle and pick up fun and\/or lovely gifts for those hard to shop for people in your life... or the people in your life that have a wicked sense of humor.  \n\nFirst, the books and magazines that greet you as you enter.  A fantastic collection of art and architecture coffee table books, some novels that are NYT best sellers, some fantastic journals and calendars.  There is usually a well behaved and very lazy dog lounging in this area as well.  From here you move into candles- YUM!- and picture frames, bath goodies and such, onto hialrious housewares, fabulous earrings and other jewelry, cute clutches, perfectly inappropriate cards, magnets, coasters, bottle openers... you name it!  Even cute and quirky baby and children gifts, which are sprinkled with a few gold standards.\n\nYou can literally knock out your entire Christmas shopping list here, from your gay boss to your ultra conservative mother-in-law, Paper Skyscraper has you covered.\n\nStaff is adorable and super friendly.  Parking is a weebit of a pain.","useful":1,"funny":2,"cool":0}
{"review_id":"zLpHu74_eyCZLsHJHuTrAw","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"QSv8Om6yHTypbXfvWb4C2g","stars":3,"date":1358208000000,"text":"This is a wonderful place to get lost in one lazy weekend day.  Their selection ranges from the weird and absurd to vintage and kitschy to antique, retro, funky cool.  Unfortunately, as of late, their selection has not turned over very quickly, is dull and uninspired and priced all over the map.  There were times when I could not leave without that breathless feeling of finding the perfect treasure you had no idea you needed until you saw it, the maze of aisles confusing me with treasures galore, all over the store and me not being to remember them all.  Not so at present.  I am hopeful that the Spring yard sales and Estate sales will breathe some life back into the long, winding aisles of the Sleepy.\n\nI have come here for years.  I had a booth at their old location and at this location-- I love the hunt, the repurposing of goods, the uniqueness that only this type of place can bring into your home... I hope this is just a little bump in the road for us.  I was there-- in and out-- in under an hour this past Sunday (unheard of!).  And left without anything... not only did I leave with nothing, I left not seeing anything that I would buy if only I could... \n\nFree popcorn in the front and some of the nicest sales staff anywhere in Charlotte.  I will be back and will hopefully be able to re-review my once very faithful bazaar\/homegoods\/yard art store.","useful":1,"funny":0,"cool":0}
{"review_id":"vkUxdDaO0eI4UrJy3-XGxA","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"PqcOSnCsJTT9Yd2xWKIMWw","stars":4,"date":1344816000000,"text":"Falafel pitas, with hot sauce?  Delish!\nHummus?  Delish!\nTabbouleh?  Delish!\nBabba ganoush?  Delish!\n\nService?  Outstanding!  (The owner loves children... has a gaggle of them himself.)\n\nPrice?  5 pitas, hummus, tabbouleh, baba ganoush, and a bag of pitas ~$25.00\n\nThe BEST picnic to-go in Charlotte.","useful":1,"funny":0,"cool":1}
{"review_id":"yZDw-hR6TsXtPc2FkoNgEw","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"j9xwoU47J57I3I36sye4rw","stars":2,"date":1346284800000,"text":"I have practiced here a lot.  Not because it is my favorite studio, it's not, but because of the convenience and because of Adam W., one of the instructors.  And Shana, my other favorite.  The classes are often very smelly, and I have had to leave when the odor is so overpowering that I was able to taste it in my mouth.  The hallway is crowded and annoying, both before class and after. Classes often are so crowded that you are touching your neighbor and getting their sweat drops onto your mat. eeek.\n\nThe crowd is definitely...interesting.  Lots of overzealous, scantily clad women who stay for more than one class in a row.  \n\nThis is not so much a yoga studio as much as a bootcamp-like atmosphere that uses yoga as the tool for your exercise.\n\nAdam is the consistent exception to the bootcamp mentality.\n\nI appear to have a masochist bone in my body because sometimes a good a--kicking as a workout suits me fine, but when I want yoga-- the exercise, the mindfulness, the spiritual component experience, I go elsewhere.\n\n--They do offer a lot of karma classes, which is nice--\n--their schedule works--","useful":15,"funny":10,"cool":5}
{"review_id":"m7AstDi2eYVQTHhfRQWAKA","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"UTU4wNXX8iqz0R4NgOlnDg","stars":3,"date":1345334400000,"text":"I eat here every week for lunch with a lunch group (their choice, not mine).  The lunch menu is changed weekly and always includes Pad Thai and a curry dish (number 4).  All can be made vegetarian.\n\nThe lunch comes with a spring roll and soup.  I enjoy both.  My favorite meal is when number 4 is green curry with eggplant and green beans.  It is spicy- beware!\n\nThe service can be hit or miss but I can easily order, eat and pay within 50 minutes.  As a parent, I have gotten quite good at scarfing down a meal...\n\nIn the summer this restaurant is HOT.  And I don't mean hot as in crowded and covered with paparazzi, I mean they keep the AC at 78 degrees... sit in the main dining room rather than the sunnier side -room to keep from completely melting down- figuratively and literally.\n\nSadly, the food has declined in quality.  What was once a 4 star establishment is now a 3 star restaurant.  \n\nGo get your curry on!","useful":0,"funny":0,"cool":0}
{"review_id":"dzriS3mAnZ1ParcHx7pWZw","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"Qt_N75Fc6JiPOIZPLMV9jg","stars":5,"date":1346630400000,"text":"We have used tham a lot and they have never disappointed!  They take care of our deaf puppy, a big mutt dog, a bunny rabbit and 2 chickens for us.  They text us to tell us how everyone is doing and leave a lenghty note after each visit.  They also water plants and get our mail!\n\nWe have been thrilled with Little Friends!  They called this morning to tell us one of our chickens was missing (she wasn't, just has switched coops).  I appreciate their thoroughness and the attention they lavish on our pets.\n\nMuch less expensive than boarding, much happier animals, too!  They also have been wonderful at helping us \"last minute\" because, fortunately or unfortunately, that is how we roll sometimes...","useful":2,"funny":0,"cool":0}
{"review_id":"vsgYu7KdwsWnmP8kg8aBYw","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"VeFqptSzekFAc3FZOpi81Q","stars":5,"date":1354838400000,"text":"Run to Alexander Michael's this Christmas season for dinner or drinks.  You will thank me.   \n\nTucked away in 4th Ward (which in and of itself is reason enough to head to A.M.) it is quaint and, right now, decorated with lovely garlands and greenery and twinkling lights (I love twinkly things).  It truly looks out of a movie.  And the houses around it are also decorated so sweetly.  A little bit magical.  \n\nI was a 4th Ward resident and kinda lived at A.M. for a few years and had not been in awhile.  We went  last night to meet friends for drinks and dinner before heading to one of my all-time favorite venues (The Fillmore... but I digress...).  Great beer selection.  We all had different meals-- nachos are delish (salsa not so much), my hubs said the burger was good, fried pickles (yum!), veggie pita was great, but you have to get the \"what it is.\"  What it is sustained me for years.  I'm veggie now, so no chicken for me... but, it was good all those nights!\n\nWhile the food is not 5-star worthy, the atmosphere, the bar, the beer selection, the people, and the staff make this a 5-star establishment, for sure.","useful":3,"funny":3,"cool":3}
{"review_id":"U2j3HMTTIZHMMGR5r1LDeQ","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"sEeV71wQBgNM8ipdfHszkw","stars":5,"date":1357084800000,"text":"I cannot believe I have not reviewed this bakery gem, this little slice of Heaven, the sugary wonder, my sweet and reliable Suarez Bakery.  \n\nCream Horns-- seriously, the flakiest pastry shell, sprinkled with powdered sugar and filled full of the lightest, fluffiest frosting-like fill.  \n\nSnickerdoodles-- cinnamon sugar yuminess on top of an elephant ear like cookie\/pastry.  \n\nElephant Ears-- a huge treat that is as large as a 5 year old's head (really).\n\nSugar cookies-- all shapes and decorations, perfectly sweetened to be able to eat several without feeling ill!  --- They also make these to order--- perfect for school parties that require cookies for decorating and the mom who does not bake!\n\nCupcakes-- all different flavors.  Delicious and lovely.\n\nCakes-- Tizzerts.  Need I say more?  Just the best cake you can put in your mouth... Our wedding cake was Tizzerts, and have had several other special occasion cakes from Tiz.\n\nThumb print cookies--  perfect for the little bit of sweet tooth, a small sugar cookie\/ shortbread like cookie, topped with a smudge of frosting (this is my go-to treat).\n\nI do not have a sweet tooth like the rest of my family.  So my go-to is the thumb print cookie but, even without a sweet tooth, the temptations of all this goodness cannot be resisted.   We celebrate milestones and accomplishments and hard days and completed projects by occasionally popping into Suarez and picking out a delectable treat.  \n\n-- Seriously, the made to order cookies have saved me for years as a room mother who cannot bake--","useful":11,"funny":1,"cool":6}
{"review_id":"c0YaKp8miTpvVRmQ1qxYqw","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"2S6p5ICNswz_EdgcZk76qQ","stars":3,"date":1345593600000,"text":"As other reviewers have mentioned, the beer selection is great, but.... no Guinness on tap!?!  Isn't there a rule about this, somewhere?  That to be considered a bar with a good beer selection you have to have the real King-of-Beers on tap?  Out of a bottle does not do my Guinny any justice.  \n\nThe food is bar food but for a vegetarian, it is a terrible selection.  The salads are not good.  HUGE but not tasty.  My husband liked the wings just fine.  \n\nToo many other places with beer selection and good food for this to my go-to bar.  Or to be a go-again bar.","useful":1,"funny":0,"cool":0}
{"review_id":"27D7CWE8oo_n96Hcw65lUg","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"aIJqDWUt10iS45zYCr0KcQ","stars":4,"date":1348012800000,"text":"The best massaman curry in town.  I get it with tofu.  My hubs likes the gang dang with chicken.  \n\nWonderful tea.  Wonderful service.\n\nI love this cozy place in the winter... it is so endearingly ecclectic on the inside: it is small but not tight, it has a great window onto the sidewalk of East Blvd., it has twinkly lights around said window.  Walking in here from the cold, sitting down to a hot pot of tea and some massaman is a great way to spend a lunch hour but an even better way to spend an evening.\n\n--the parking is tight--","useful":0,"funny":0,"cool":0}
{"review_id":"_kBUPVy8wKyUTSMSRTlz8A","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"6zi7dAlnk7vgvlGbUMoKkA","stars":2,"date":1355443200000,"text":"OK, the atmosphere is fun and festive.  Who does not like colored lights strewn about and awesome old rock band posters on the walls?  The floors were clean and the bar area was fun... a great place to meet a friend for a canned beer.  Yes, really.  And with a gut washer choice of one chardonnay, you will drink the canned beer.  Or the draft beer- but beware, the Shiner Bock was flat and not very cold. Disappointed, party of one.  Ok, Ok... so, you might enjoy a fun atmosphere on a great street to meet friends for... drinks.  But not dinner.\n\nI had the fried avocado tacos and the black eyed pea salad.  Both were bad.  The bean salad, and I love stuff like this, was swimming in salt and vinegar.  I think those were the only ingredients.  It was bad.  The fried avocado tacos (as a vegetarian this prospect sounded delicious to me!) were, ummm, tasteless. Which might be better than the black bean salad which might have benefited from being tasteless?  The queso was good.  But, seriously, who can't melt some cheese?  \n\nI like food too much to return here.","useful":2,"funny":1,"cool":1}
{"review_id":"zPRRy6tQZQEAP46IGQn_8Q","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"3VvPKmr-6LXJ7aWlFtp4Yg","stars":4,"date":1369008000000,"text":"I've been waiting for Live Market to open for a while. From the moment I saw the familiar \"Live\" sign appear in Liberty Village, I've been waiting. They opened in the week I was out of town visiting family, so for a week, I watched from a far, watching my friends post pictures of the various things they had bought, and ate,  looking forward to being back in my hood of Liberty\/Niagara so I too could eat this stuff too.\n\nLive Market is conveniently(?) located right near my gym, so I have been here three times in a fairly short time period, and it's nice to have such a great post-workout option, and really extra nice to have a close non-starbucks coffee\/tea option near my house.\n\nBoth times I've actually ordered food, it's been very very tasty. First time - the chickpea burger, second time, upon the recommendation of the server - Burdock Burrito (Do order this. It is yummy.) Live Market also keeps me in Silk Road earl grey tea. I've had the wherewithal to arrive shortly before the influx of Liberty Village work folks coming in on their lunch break.\n\nI often feel like the best way to tell the service level of a restaurant is how they handle minor errors. My partner ordered and ended up waiting a fairly long time for his lunch order, so not only did they make it right, they apologized, and offered him a coffee for his trouble. Smooth. Empowered staff make me a happy camper, so we just left liking them even more.\n\nThey've got Ezra Pound roasted coffee, and prepared ready-to-go items, juices, snacks, and treats, as well as order-in items if you have a little more time. \n\nThere are lots of locally made products like ChocoSol chocolate, Stasis Preserves, Bunner's Cookies, Sweets from the Earth treats, amongst other things. You can buy protein powder, tea, coffee, and even make up. They also have jars of Rawtella for sale, which I wouldn't call \"healthy\", but I would call really really delicious (since I did end up buying some on my last visit...)\n\nService has been consistently friendly, food has been consistently good, and I feel like I get good value for my money when I go there.\n\nThings to know: They don't have debit\/credit working yet, but it's coming soon. I.E., At the moment it's Cash Only.","useful":2,"funny":0,"cool":0}
{"review_id":"jk9POXdfBbBfLTjgO8YFFg","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"cRMC2eQ9CP6ivhEY8EdaGg","stars":2,"date":1299110400000,"text":"I guess I'm not excited about this place because for me, it not only has limited options, it doesn't actually have a good option. The \"Juicy Vegan\" is one of the most expensive items on their menu, and when I ordered it, the woman at the counter asked me if I want sour cream or cheese. And I ask... well is it vegan sour cream or cheese? to which she replies \"no it's not included\" (???) \n\nDear restaurants, if you have something labelled \"vegan\" on the menu, could you let your staff know what \"vegan\" actually means? Thank you.\n\nWe waited about 20 minutes to get our orders. After I picked out the big tasteless spears of tofu out of my not so juicy  \"Juicy Vegan\" it wasn't so bad. I liked the diversity of vegetables, it was an ok size, but I'd probably opt for Big Fat Burrito or Burrito Boyz instead of going to this place again.\n\nMy friend ordered the special of the day which was a Korean BBQ burrito and his reaction was equally meh. \n\nI wanted to like them, because I love burritos and I'm nearly always in the village, but it just didn't happen.","useful":2,"funny":3,"cool":2}
{"review_id":"K8rhK9yIKeQxNb72ILiTjw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"VvSmE1NnTjnaTPHT0WrCaQ","stars":2,"date":1286496000000,"text":"I finally went to King's Cafe after it was recommended to me by a lot of other people.\n\nI had sampled some of their very delicious appetizers at the Vegetarian Food Fair last month, so I was excited to try an entree. Well... I had the Soy Fritters with Curry Rice, and I don't know if it was just the wrong dish to order or what, but I didn't think it was very good. Fried tofu gluten fritters with carrots, potatoes, beans and cauliflower sounded so yummy but it wasn't.\n\nThe only thing I really enjoyed the flavour of was the potatoes, because they seemed to have taken on the most of the curry flavour, the veggies and soy\/gluten stuff weren't very flavourful. I needed some hot sauce for sure.\n\nAt least it was on the Special Order menu so it was only 5.99, some of the other items were 10-13.\n\nThey also wouldn't let me plug in my laptop and were generally kindof rude. so, eh. Not very enthused.","useful":2,"funny":0,"cool":2}
{"review_id":"IIrkRcw2i95xsm3yUH57Zw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"OK_djnmJWmK4G3NMAjGGjg","stars":5,"date":1380240000000,"text":"You know, it's been two years since my first review of this place, and often, places start strong and then fizzle a little, sometimes I expect that quality will go down, or the atmosphere might change. Not this place.\n\nI straight up love Boreal Gelato. They have vegan-friendly gelato in interesting flavours, today they had chocolate, salted caramel, and coconut. Fruit based  sorbettos are great and all, but these were extra exceptional, creamy, rich, and just all around delicious. \n\nI know flavours rotate, but I haven't yet tried any flavour of their non-dairy gelatos that wasn't tasty.\n\nThere is ample seating, inside and a little area outside to sit on, service was quick and friendly, \n\nGo there.","useful":1,"funny":1,"cool":0}
{"review_id":"UZEvglRhpX_bQNM59mvsyw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"gSPALi3f3Ga01HGXHrhlUQ","stars":5,"date":1336176000000,"text":"I've been going to the Depanneur nearly once a week for a few months. They have a casual atmosphere, and are generally a good venue to find local food stuffs. Corner store by day, dinner establishment by (some) nights, it's really a great space.\n\nThe drop-in dinners are usually why we end up there once a week (or more) whenever they have a vegan one (which is on the regular.) It's always something different, but it has been consistently delicious. The chef stylings of Len (who I think is the owner) cooking something up every Tuesday, Emily Z, or Kalmplex (and many others) make this place just a total hidden gem (that I kind of don't want to tell anyone about, because I want to keep it to myself.)\n\nAs people have mentioned, sign up for the newsletter on their website (or connect with them on facebook\/twitter) to keep up with the events they have going on, there is always something for everyone. \n\nThe house made sodas are totally delicious (elderberry, blackcurrent, maple lemonade, just to name a few), they also have coffee\/tea, apple cider, and soy milks. \n\nPackaged foods include local mushrooms, jams and jellies, ketchup made in house, and freshly baked buns and breads (often with gluten-free options as well), soups, milks, yogurts, and other small business produced products.\n\nThere is WiFi, there is table space, and the service is always friendly. It's like a home cooked meal in the best possible way.\n\nThings to know: CASH ONLY (there is an ATM available at the convenience store across the street)","useful":6,"funny":0,"cool":6}
{"review_id":"lEwYfkqQEPfvUs-0inB2-w","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"sscP36MO34i5ep4QO8c7KA","stars":3,"date":1294272000000,"text":"I had a terrible latte here. Bitter, weak foam, and unexciting. Maybe it was a bad day to go in, since I walked in on Boxing Day, and it was one of the only open cafes. I might give it a do over after I'm done with the rest of my Indie Coffee Passport stops, but I'm not in any rush.\n\nI enjoyed the space itself though, that wide open emptiness. My table was covered in magazines (so if you don't bring reading material, you're more than covered), they have wifi and I read and finished a book without interruption (it's quiet). I'd probably go back eventually, buy a coffee I might not even like, solely to hang around. Maybe that's why there isn't much seating, there is a certain dark homey comfort to this place I can't quite put my finger on, but I like it.\n\nWhile I'm happy they offer soy AND almond milk, I don't like that they charge extra for it.","useful":3,"funny":0,"cool":2}
{"review_id":"nUOZFEJtFnlcve_5s8DwVg","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"phxC_5lTppMGf79F8Y-uHQ","stars":4,"date":1409443200000,"text":"I went for my first ever float yesterday evening and I really liked it. Staff at Float were super friendly and helpful, and offered me a nice peach tea while I waited for my turn to go in. It was very relaxing.\n\nI've been getting a few questions about the process so I figured it would be helpful to have some idea of what happens when you walk in.\n\nSo this is what happens when you walk in.\n\nI had already paid and made my appointment online, so I just walked in around 15 minutes before my appointment. I signed a release form, drank some tea, and waited until my turn came. A friendly member of the staff showed me to the room I would be using, explained a bit about the tank, and some advice on ear plugs, then he left me alone to do my thing. \n\nThe doors lock, so you have some privacy.\n\nI had the last float of the night, so it was 2 hours long, but standard floats during the day are around 1 hour.  They have 5 rooms, each with flotation tanks in them, and it's easy to make an appointment online, which was a major plus.\n\nEach room has a shower, a bench, and a flotation tank, and a robe. Towels & ear plugs are also provided. They have scent pre-float shampoo & body wash you can use to get ready before going into the tank, and a more scented post-float shampoo and conditioner.\n\nThe flotation tank has about 10 inches of water, and a whole bunch of dissolved salts (for max float potential), so it's easy to get into the tank, sit on the bottom, close the door, lay in the water, and then open it again, or whatever you feel comfortable with. \n\nAt first I was a little anxious about getting lost into the abyss of the tank, and it just seemed to get darker, but as I found out, it's easy to find the door handle in the dark, and easy to open it whenever you need to. So after realizing it wasn't a big deal, and that I could open the door anytime, I closed the door, and floated away 2 hours without realizing it.\n\nWhen your time is up, there is music that comes on, and gets progressively louder to gently wake you or get you out of your relaxed state.\n\nThere is no right way to do it, but I had a great time just floating around with my eyes open, enjoying the feeling of gravity mostly disappear, and also got some really good stretching in as well. Just be careful with the salt water, as you might expect, if you get it in your eyes - it stings! (but there is a towel with a water bottle near the tank door if you need to rinse)\n\nThere was only a brief moment in the beginning of my float when I heard a siren from the street, otherwise, I didn't notice any street noise at all, and considering what I saw when I left Float last night, that's really impressive (lots of police activity, another ambulance that I hadn't heard). I'm usually pretty sensitive to sound, so mostly for me it was nice to have some near-total quiet and no vibrations other than the sound of my heartbeat for a couple of hours.\n\nI think they've got a great set up, and I didn't find their prices high (especially when compared with some other float places I've seen in the past) and they've got a variety of options to choose from on their website. \n\nThe one thing that is worth mentioning, is that after floating and being relaxed and blissed out, walking out onto Queen Street at 1 am on a Friday night can be kind of shocking (not like this is a surprise of course, it's loud, and busy). I know I'd like to try and do a late night 2 hour float during the week next time. Otherwise, I had a really great time.","useful":9,"funny":3,"cool":6}
{"review_id":"ocMVC0Vguf9tGkpflSqvHg","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"r-uKGbHOb3Qdz_s2U-PuFQ","stars":4,"date":1298592000000,"text":"Another one of those lovely places that I'd probably have missed if it were \nnot for the Indie Coffee Passport.\n\nFirst thing Saturday morning, I went over there to meet up with Nicole H. for a minicoffee crawl.\n\nI got there way too early, but the moment I walked in, I instantly felt comfortable and welcome. It's the kind of place I could see myself visiting everyday for a coffee. Very friendly atmosphere, the lighting was great, and there was ample seating (but of course,  it was 10am on a Saturday morning). It was obvious this was a local spot, people coming in and out, chatting with Bob (the owner) like he was an old friend. \n\nI ordered my usual large soy latte. It was so good. Thick, with a cute three dimensional heart made of crema. And I just loved the cup. I commented on it in my head and then again to Nicole H when she got there. It was the perfect size and shape to hold with both of my hands. Also, I was very happy to see they don't charge extra for soy milk!\n\nOther things that are great: \n- They have free wifi (when I went in, the password was on the chalkboard at the front)  \n- There is definitely an outlet at the back corner. I didn't look anywhere else, but there is at least one!\n- There are vegan snacks, soups, sandwiches in addition to several nonvegan options.\n\nComplaints: \n- None really. It's a bit out of the way for me, but I would go back anyway.","useful":9,"funny":4,"cool":6}
{"review_id":"8I7pohJcQcGWuSXVjClxdQ","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"oM4nwtYDw5Ml-hrJdgv8TA","stars":4,"date":1336694400000,"text":"Working in the Yorkville area, I've come here regularly for lunch. I love the location and the interior. It's a nice break from the everyday, and it's automatically relaxing. Calm, ignorable, music fills the restaurant, interspersed with the occasional loud whirring of a blender.\n\nI like that there is always a bottle of water on the table, because I end up getting a couple litres of my H2O intake for the day while I'm there.\n\nI've ordered a bunch of different things, but the Pad Thai was easily (and most expensively)  my favourite. Nice filling serving, with a fresh rich flavour.\n\nThe nacho plate is pretty delicious too, but as some other reviewers have mentioned, don't expect a giant nacho plate portion here. It's not huge, but paired with a meal it's a nice snack.\n\nSmoothies are always thinner than I expect them to be (and after ordering it several times you'd think I'd be used to it by now, but I'm not) so that's something to be aware of and set less thick mouthfeel expectations. \n\nOverall I like it here. I do find it feels expensive, especially since there is no guarantee of organic ingredients, but service is always good and not intrusive.\n\np.s. Get a macaroon (or three) they're delicious.","useful":0,"funny":0,"cool":1}
{"review_id":"XyFCr4BVEbKymURD7dSjKQ","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"yV7f80Nw8nJGilZpRnS6HQ","stars":4,"date":1286582400000,"text":"I went to here the other day. It had a lot of places to sit (most of which were occupied), free wifi, but no power outlets that I could find.\n\nThe latte I had was beautiful, but not super exciting flavourwise. I've been spoiled entirely by the Sam James Espresso Bar. The one from here, was probably the second best one I've had in the city so far though.\n\nIt seems like the perfect place for both hanging out (there are cozy spaces behind the coffee bar) and group work (they have giant tables by the windows) and it's a great location (close to Kensiginton Market.) \n\nThey do charge extra for soy milk, and it was the second most expensive latte I've had, but I loved the space and would definitely go there again. Of the food items they had available, I saw a couple vegan cookies from Sweets From the Earth which was nice.","useful":2,"funny":0,"cool":1}
{"review_id":"Df9X2MfmHiVR8KGCt0c53w","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"aEnoF_79jQE83s-I756n8w","stars":3,"date":1335139200000,"text":"I walk by this place on the regular, and through the power of the Indie Coffee Passport, I decided to actually go in and check it out. It was crowded and very white, modernish interior, with an absolutely beautiful espresso machine. Their chairs aren't comfy and the interior was brightly lit with natural light from all the windows, so it's definitely set up as more of a pick up and go place than a sit down for a while place.\n\nThey charge extra for soy milk, and did so when it pushed the price over the $4 dollar Indie Coffee Passport limit. The service was indifferent and the soy latte was okay, but wasn't spectacular. \n\nThey don't have any vegan baked items, though I think they had something gluten free while we were there.  Since I have too many options for really fabulous vegan friendly indie coffee shops in the neighbourhood I probably wont return to Thor.","useful":0,"funny":0,"cool":2}
{"review_id":"6PkCZqMq9pgpBBQEe00eDg","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"leMIHa6TogufHv5HNYjnfw","stars":2,"date":1310083200000,"text":"We ended up at Ravi's Soups on Queen Street a few days ago, after a failed attempt to check out E.L. Ruddy (they were closed).\n\nRavi's Soups had a big group of people waiting for wraps, so that was a nice sign. They had a veggie wrap on the menu, and a vegan soup option. That said, I wasn't excited about this place from the very beginning.  Service was weird and all over the place, there wasn't a line waiting by the time we were at the counter, but he was still frenetic and rushed, but the food didn't come to us for quite a long time, and as with most simple vegetable dishes, I feel like I could have probably just made the wrap at home.\n\nThe veggie wrap normally has brie in it, and jut as a heads up, one of the unlisted additions is mayo... so you know if you're vegan, ask for it without, or just skip it and just opt for soup. (or go somewhere else.) The wrap came with a tiny salad, that of course, had \"just a little bit\" of mayo on it, I guess \"a little bit\" of mayo is the same as \"no mayo\"? Not quite.\n\nMy friend had the wrap and the Porcini Mushroom Soup and loved it. It's based on an onion broth, and has mushrooms, barley, and truffle oil in it, so it's actually vegan. However, soups all come with a cheese biscuit.\n\nThis place, like most of Toronto's restaurants, is great for lacto-ovo-vegetarians, but going there made me wish I had gone somewhere else on Queen that was a bit more vegan friendly with more exciting options.","useful":3,"funny":0,"cool":1}
{"review_id":"urhz69ahF0pVy0IbI1PMeg","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"y-Zbg19VSb-k15A_yzruYg","stars":3,"date":1289779200000,"text":"Before we decided to wander through the AGO yesterday morning, we stopped into Frank for brunch. The server was awkward, stiff and extremely formal (in a way that seemed unnatural), but overall very attentive and helpful, so I wont hold her attempts at trying too hard against her.\n\nFrank has a vegan dish on their brunch menu, the roasted shiitake mushrooms with heirloom squash, which was nice to see. The server suggested a slightly more substantial dish the chef could make for us with braised lentils and eggplant (also with heirloom squash and tat soi salad). It was phenominal.\n\nBeautiful presentation, and absolutely delicious.  But, with phenominal food, comes a phenominal price tag, so that part was an unpleasant surprise.","useful":1,"funny":0,"cool":3}
{"review_id":"AnPjCb40a6zeTM_55kEctw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"3ycYtMXIAMz7SSyFUfSppA","stars":4,"date":1289952000000,"text":"I snuck in here when it started to rain and wandered around looking at more Barbapapa stuff than I'd seen even when I was a child, adorable little baby products, cookbooks aplenty and the most beautifully unnecessary (albeit potentially useful) kitchen accoutrements and accessories.\n\nI loved this store. Couldn't help making a little list in my head of all the things I wanted.\n\nOne of the folks at the cash was pleasant and even held the door open for me when I was coming in; the other one was pretty much off in her own world. Though this was fine with me, since I just wanted to browse the store in peace, and they didn't seem to care that I had been in there for a considerable amount of time.","useful":5,"funny":0,"cool":4}
{"review_id":"3pPmYHmobYxEBUJqw7CvgA","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"c6f8wBjPLDzyubEBqgcMnw","stars":5,"date":1352851200000,"text":"I went back here this weekend and had a pretty great time. The staff are friendly, the cafe was busy but the line moved quickly, and our soy lattes were delicious.\n\nI still love this place, and I still wish I was closer to them because I'd drink their coffee more often. Staff are so nice, and seem to like working there and with each other. That makes a huge difference to the whole coffee experience. \n\nThere are no vegan baked goods, but it doesn't matter, because their coffee is good enough to stand alone. (though you know... I wouldn't be sad if there was a vegan cookie or two someday...)","useful":2,"funny":0,"cool":1}
{"review_id":"0FcdLS7o6pQ4WPFooisfbg","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"Zrx25j1M794Nh8fUGB8E9A","stars":4,"date":1381190400000,"text":"I love TGIF ever since but I never wrote a review.  The food is good, the dessert is not to miss and their happy hour on drinks is cherry on top.  This one inside The Orleans is great place to dine after or before going to the movies or bowling (or to gamble for the gamblers).","useful":1,"funny":0,"cool":0}
{"review_id":"_wzBkx7HCHcpdSAf-oX0Ug","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"4tWF2w6jP2LNK2xTVNEMFw","stars":4,"date":1249516800000,"text":"Could be the best Mexican cuisine I've ever had in Vegas?! Coconut margarita is liquid nirvana.","useful":0,"funny":0,"cool":0}
{"review_id":"gBKDf27W9LAysSANwH_cEA","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"1Vn_lex3LGGwuTo-xeJnww","stars":5,"date":1254528000000,"text":"I love froyo and Yogurtland makes it a dream come true.\nThis is my fave venue since the ambiance is cozy and relaxing due to plenty of tables and chairs to unwind unlike the one in Town Square.  \nService is definitely friendly and warm.\n\nOverall ~ I am a big fan!!","useful":1,"funny":0,"cool":1}
{"review_id":"kcUIeVskF2zAnUSYeqTyAg","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"JTSk0BCHw-uusHO4snGePA","stars":4,"date":1375142400000,"text":"My experience with Portrait Innovation was great!  The prices are stiff but the photographer took her time with the shoot and was patient with my baby boy.  We will come back for a family holiday photo this year and I will make sure to use their coupon (I didn't the last time and paid $180 ~ yikes!).  This place is much better than JCPenney on Grand Canyon.","useful":1,"funny":0,"cool":0}
{"review_id":"ceKleTs7hPyWIX4_KpHCZQ","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"Zmfq3DVhHdtVChhSxzoUHw","stars":4,"date":1254528000000,"text":"Thai food is just delicious but Panna Thai makes it irresistible.  \nFood is scrumptious with good portions.  \nAmbiance is very private, mellow yet warm & friendly.  \nPrices are very reasonable (almost like Thai BBQ).\n\nOverall ~ will be coming back for more!","useful":2,"funny":0,"cool":1}
{"review_id":"9ivLrV6UgjaeabqkEmq4Fg","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"IcOvxejpd5FLFIkj20Opqg","stars":4,"date":1249516800000,"text":"The only place where I get yummy red bean or green sesame balls.  Also their steamed pork buns are my favorite.  This is where I order birthday cakes - mocha cake with coconut filling is a must-have!","useful":0,"funny":0,"cool":0}
{"review_id":"G9Wd0iKSuFyHuEc2sIGK0g","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"pybIuTluqRhH_BQ3CJHlLw","stars":5,"date":1375142400000,"text":"The food is absolutely delicious.  The price is a little higher than other good Thai restaurants however you really get every penny's worth, plus the ambiance really takes you to Thailand unlike other restaurant.  You must try and I will definitely come back!","useful":0,"funny":0,"cool":0}
{"review_id":"h0m315KtVu2g8YfXc5LA6w","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"SycXTaA4MeJZuDK4Y1owDQ","stars":3,"date":1249516800000,"text":"I'm not a burger-fries-shake kind of person, however, Islands have delicious burgers and thick shakes.  I would recommend this place.","useful":0,"funny":0,"cool":0}
{"review_id":"3gWfTCum4nGVnX0FTffBTA","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"5shgJB7a-2_gdnzc0gsOtg","stars":5,"date":1249516800000,"text":"One of my favorite hang-out spots in Vegas!  My friends and I been loungin' at Firefly since 2005 and I have nothing but praises to say.  Sangria and Mojitos are smooth plus their calamari and paella are delicious.  As I said, I have nothing but praises!!","useful":1,"funny":1,"cool":1}
{"review_id":"RuQbhgENXUlf28wcv2Cwsw","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"NXNa5OYmN1CNmXwHhDxpRA","stars":4,"date":1421107200000,"text":"My first time and there was no wait, so plus. Wait staff are friendly & accommodating; the menu is simple and easy to read; price is reasonable less than $10 for a regular size bowl of ramen. i would come back here.","useful":0,"funny":0,"cool":0}
{"review_id":"DtBjK1efAKKk4xr-MOtFjw","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"BEplfZTUzYwApjMUaOA12w","stars":3,"date":1249516800000,"text":"Chicken tacos are delish especially their guacamole ~ not so pricey even if it's inside The Venetian.","useful":0,"funny":0,"cool":0}
{"review_id":"MrrMGfG7ee6qvoRrWbA9MQ","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"ZGXd87vme_dDVYqr-HpRQQ","stars":4,"date":1246233600000,"text":"My old boss took us out for lunch and we went to Bamboo Bistro.  The ambiance is clean and casual.  The food is delicious however they have a triple-layer dessert that just didn't hit the spot.  Overall it was a pleasant dining experience.","useful":0,"funny":0,"cool":0}
{"review_id":"ddAAYIGyBvgLOg3jPYzCAw","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"NvKNe9DnQavC9GstglcBJQ","stars":5,"date":1249516800000,"text":"Grand Lux is the higher end scale of Cheesecake Factory.  Their menus are quiet similar yet very different.  I love all their food especially the chicken flautas and strawberry lemonade topped with creme brulee' dessert.  The only downfall is that it's inside The Venetian resort and I'm not a fan of the strip on my days off. XD","useful":0,"funny":0,"cool":0}
{"review_id":"1th2vReHW-c2CNvszrRxxg","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"ixAh9crILnJ9tM8LhWFhkw","stars":3,"date":1249516800000,"text":"My younger sister suggested Archi's for lunch and I enjoyed the place, however I prefer Thai BBQ better.  Archi's ambiance is pretty, service is good but food is not the most delicious.  Overall experience is fair.","useful":0,"funny":0,"cool":0}
{"review_id":"ys7qIpoSMx_tIfbeCKqcxA","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"OK0ba4X5seibH8oMWh4bhw","stars":4,"date":1249516800000,"text":"Definitely my fave sushi restaurant in Henderson.  Ambiance is relaxed and friendly, service is efficient, price range is reasonable, sushi is delicious.","useful":0,"funny":0,"cool":0}
{"review_id":"ZGfMyCFAYg7PtTF16eSXZg","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"N4BbeIbQNgtUEEMutu9U3w","stars":4,"date":1246233600000,"text":"This location is the only one I've been to and I would recommend it.  I usually come for dinner and I would say there's about 10 - 15 minute wait on weekends but the staff is friendly and courteous, the food is good and prices are reasonable.","useful":0,"funny":0,"cool":0}
{"review_id":"Jbmccd7w_rPduEsLphMAHw","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"h5a8aJ_Pd71JzUGFA-IaAg","stars":5,"date":1249516800000,"text":"One of my favorite lunch spot whenever I'm craving for some Thai Iced Tea and Thai BBQ chicken.  Restaurant size is quaint but staff is friendly, price is cheap, and food is scrumptious.  Highly recommended for casual lunch!","useful":0,"funny":0,"cool":0}
{"review_id":"jaQL4mkn_nJ9qLtDD_PVHA","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"0WoQQlMXVIDEgI0xNdENKA","stars":4,"date":1375142400000,"text":"I love this place!  The food is good and such a great selection unlike other buffet. This is my first choice buffet off-strip.","useful":0,"funny":0,"cool":0}
{"review_id":"0C52L4Gr4yfqodk1q2IeRg","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"n_K2xa_nqzUqaUJa0S_5tQ","stars":4,"date":1246233600000,"text":"I love this place. \nMy girls and I are always here.  Taro balls, snow white snow ice and tea-flavored spiced pork chop are my favorites.","useful":0,"funny":0,"cool":0}
{"review_id":"9bA1GBclAfD4MWXYxIj8cw","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"uu5AtMrz_94e8kk4Gixg9Q","stars":4,"date":1314230400000,"text":"One of my fave Filipino fast food restaurants here in Vegas.","useful":0,"funny":0,"cool":0}
{"review_id":"lt7nl9Zlmlo8Uq175yIVaA","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"ewIXHLlaIfp9U3NrsgilVw","stars":3,"date":1249516800000,"text":"My first time to try Brazilian Steakhouse a couple years ago and I went to dine at Yolie's.  Atmosphere is serene and romantic, salad bar is not as articulate as Texas de Brazil, however the food is just the same ~ great steaks, friendly gauchos but not as friendly as TdB's gauchos, price range is reasonable (shelled out $35 for dinner of 1).  I would recommend this place.","useful":0,"funny":0,"cool":0}
{"review_id":"IHiMVpP-MpcKXThaxL977g","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"iAuOpYDfOTuzQ6OPpEiGwA","stars":3,"date":1246233600000,"text":"Memphis BBQ is one of the good BBQ restaurants in Vegas, next to Famous Dave's and Lucille's.  The atmosphere is relaxed and casual, the staff is friendly and available, food is delish and prices are reasonable.  I would recommend this place.","useful":0,"funny":0,"cool":0}
{"review_id":"8EzblhtDWD1ytBkfmCTK6g","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"u3nwislXMKKwkpHAXAArbQ","stars":3,"date":1314230400000,"text":"The food is good but a lil' pricey, however the restaurant is open until 2am; so that's very convenient.  The service can be better but I'm used to Chinese restaurants, they all kinda have an attitude. You must try their deep fried tofu ~ it's delicious.","useful":0,"funny":0,"cool":0}
{"review_id":"-kK8CqRPb72BXy-DO9r0zw","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"A5Rkh7UymKm0_Rxm9K2PJw","stars":4,"date":1249516800000,"text":"Besides Blue Martini - Yard House is a new hang-out for cocktails spot in Las Vegas.  They have a vast selection of food and libacious drinks.  Music is always blaring so the patio is a good spot if one wants to have a conversation or to people watch.","useful":0,"funny":0,"cool":0}
{"review_id":"piNQ5bEOWLtf_88ypWMG1Q","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"g8OnV26ywJlZpezdBnOWUQ","stars":4,"date":1249516800000,"text":"I haven't been here in about a year and I missed it alot! My younger sister introduced me to Hash House and I fell in-love at first bite.  Ambiance is upbeat yet comfy, staff is friendly, price is reasonable, food is excellent.  Best all-day breakfast restaurant on my list!","useful":0,"funny":0,"cool":0}
{"review_id":"KQhSpjVqBTTDPiGGzAkoNQ","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"UCpUOtvqR-NBWBNVMzJleA","stars":4,"date":1249516800000,"text":"A weekend favorite between my girls and I ~ have a mango martini and their Vesuvious chocolate cake.  A girl can indulge after an hour long of cardio workouts. XD","useful":0,"funny":0,"cool":0}
{"review_id":"Cn6gKCsMCjapKE0AaPAWBA","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"Gaq3S9lmjXVcuDCZ8ulppw","stars":5,"date":1249516800000,"text":"I just love sushi so I'm biased when it comes to sushi restaurants, however, Oyshi Sushi is my new fave in town! Ambiance is beautiful - they have a big Japanese mural in their private room ~ so lovely to look at.  Service is excellent ~ food is delicious ~ price is reasonable.  Highly recommended!!","useful":0,"funny":0,"cool":0}
{"review_id":"F4ELoYHmmrltynnXsaTnPA","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"8Q6jl7OW8DZzwANggDspcw","stars":4,"date":1345939200000,"text":"Ambiance is eye-candy, the food is good, the drinks are quiet lovely and the dessert menu will give you a toothache just by looking at it.   The menu is pricey but not overboard.  I liked my experience and would definitely go back again.","useful":0,"funny":0,"cool":0}
{"review_id":"0Tb0YxC6frN-6g64b53yTQ","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"Cr4ipI-tr-R8Q0NilkWNkA","stars":4,"date":1249516800000,"text":"Located on the 64th floor of Mandalay Bay Hotel on the Las Vegas Strip where the view of the city is breathtaking.  I celebrated my 25th birthday here and we'll be celebrating my friend's 25th birthday here tonight! I love this place ~ ambiance is techie yet comfortable.","useful":0,"funny":0,"cool":0}
{"review_id":"hrmSJm_xq5hQRnoYx4wFKA","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"LrxDRg8SQdgHMoz3TSAYFg","stars":4,"date":1345939200000,"text":"their menu has specialties that other Filipino restaurants do not have, and food is pretty good","useful":3,"funny":0,"cool":3}
{"review_id":"jWtCr0uTnNSBUbaktQSfog","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"RnAb4KkRDmWUBWhhZhugZQ","stars":4,"date":1246233600000,"text":"I ate lunch here when my office was on Durango and it gets a little busy around noon to 2pm but the chicken and beef teriyaki is delicious and they serve Thai Iced Tea.","useful":0,"funny":1,"cool":0}
{"review_id":"41m2QGYiKYlztPTixEoGxQ","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"MpmFFw0GE_2iRFPdsRpJbA","stars":3,"date":1249516800000,"text":"XS in Encore is a beautiful nightclub especially their outdoor pool; however the crowd is mainly tourist and women have a cover charge of $20.  boo hoo! altogether rating - not so bad!","useful":0,"funny":0,"cool":0}
{"review_id":"vtaT5GOw1BLf6RFn8xAb0w","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"bcJmbFHVAkLFqhJbUTdbyQ","stars":5,"date":1278547200000,"text":"Another fave bakery in Las Vegas ~ their pastries are delicious and oh so irresistible ~ I haven't been for a few weeks since I'm on a bikini-beach diet for my vacation in coming up.  So watch for more reviews. This place is a must-try!","useful":0,"funny":0,"cool":0}
{"review_id":"9LbjHzW8YzMRCmC4cHNlbQ","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"A-KVm7iKLOe1X1yAQP13FA","stars":2,"date":1427500800000,"text":"Overall: Unless I was in the area, I wouldn't go out of my way to go back. \n\nService: Our food took a while to arrive but they all came around the same time. \n\nFood: I liked the dosa and curries. My mango lassi was room temperature.","useful":0,"funny":0,"cool":0}
{"review_id":"thgVx8OypGAsf8yRJx62OA","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"ofw8aDSEg1HoQdmCgvLtaQ","stars":4,"date":1427500800000,"text":"I tried the beef brisket, pulled pork and butter chicken pies. My favourite was the pulled pork but they were all good. Each pie is hearty and the pastry was flakey. There was plenty of filling so one pie would be more than enough for me. \n\nThe place is on a side road, tucked in the lower level. There are 2-3 stool seats inside but a couple larger tables outside. \n\nFrozen pies can also be bought and reheated later. The to-go box includes instructions on how to reheat the pies.","useful":1,"funny":0,"cool":0}
{"review_id":"OF45ie3PYEe39zBA_moaLw","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"ORqZyyZafJyZcgTGNrJ_oA","stars":3,"date":1451433600000,"text":"Got the lap cheung (Chinese sausage) and seaweed egg waffle and matcha ice cream. The soft serve ice cream was very creamy and while it was good, I didn't think it needed to be incorporated with the waffle.\n\nThe lap cheung waffle was an interesting mix of sweet and savoury. There was no line up when we went at night and the waffle was made well. Not underdone or overdone.\n\nWasn't going to come because of all the hype and most likely won't be back unless I happen to be in the area.","useful":1,"funny":0,"cool":0}
{"review_id":"At1d9VRv995PILES3Iathg","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"r_BrIgzYcwo1NAuG9dLbpg","stars":4,"date":1403308800000,"text":"1. Grabong ($10): Deep fried battered squash fritters with a garlic tamarind dip\n- I really like this as an appetizer. The tangy dip complements the sweet squash well.\n\n2. Gaeng Kiaw Wan in a coconut ($15): Green curry with bamboo shoots, kaffir lime leaves, basil leaves, green peppers and coconut milk. Served in a coconut with rice. Choice of: chicken, beef, pork, shrimp, fish, tofu or veggies.\n- Lots of meat in the curry. Good for sharing.\n\n3. Khao Pla Tawt ($14): Crispy basa fillet with oyster sauce, crispy shallots served with 2 sauces: fresh chilli sauce and tangy tamarind sauce\n- I loved this because the fish was crispy the entire time and it wasn't greasy.\n\n4. Khao Soi with beef ($14): Fresh egg noodles in a golden curry topped with crispy noodles, coriander and green onions. Choice of braised beef, chicken breast or chicken drumsticks\n- Consistently good dish from Chef Nuit. The golden curry is flavourful and rich but not heavy. Braised beef was tender. \n\n5. Papaya salad - salted crab ($10): Shredded green papaya, tomato, long green beans, garlic, red chilli, tamarind juice, fish sauce, coconut sugar and freshly squeezed lime\n- The salted crab tasted like sashimi and though the claws were small, they were very salted which balanced out the rest of the salad. \n\n6. I Moo Ping ($10): Northern Thai Street Grilled Pork on a skewer\n- 3 skewers","useful":0,"funny":0,"cool":0}
{"review_id":"Sb2acgyby6sbFd3gBqA8ZA","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"UivDzG-AWhcfX-ADpg3Riw","stars":3,"date":1427500800000,"text":"The squared pies and the box it comes in makes it easy to eat on the go. \n\nI tried the jalapeño chicken and chicken pot pies in the big size. They were filling but the small ones would've been a great snack. \n\nThere are about 15-20 seats inside and the decor is math (pi) and science themed. Each table also had a photo of famous mathematicians.","useful":0,"funny":0,"cool":0}
{"review_id":"QFGLrzN3GKdGBMGfB4yK7w","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"XCxxPZ3Lu5mwmIo7IQRf1g","stars":4,"date":1403308800000,"text":"Toronto roll\n- Looks like a mess but loaded. \n- Top layer: cucumber, avocado \n- Middle layer: assorted pieces of sashimi \n- Bottom layer: tempura roll \n\nOverall:\nGood sushi, big portions, price is decent for the quality and quantity","useful":0,"funny":0,"cool":0}
{"review_id":"xIhsEyb8LTuDXxrEaYBkGQ","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"dumO6I2X9g6dv_70NDWkmw","stars":2,"date":1392422400000,"text":"We were hungry and didn't want to wait for a table at Sushi House a few doors down. \n\nGrilled duck breast ($8 for 5 thin slices): It was overdone so it was dry and a bit tough. \n\nKatsu don ($10): The rice was too burnt on arrival and it tasted a bit too salty. There was a lot of rice and not a lot of chicken. \n\nRaku roll ($13): Their signature roll was small. Inside was white fish, crab meat and cucumber. The spicy sauce was good. We could taste the torched flavour (aburi).","useful":0,"funny":0,"cool":0}
{"review_id":"o_58w-4pzCTImpnv7D9TRg","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"K2CdjES-IZDDEgetOnf0Vw","stars":5,"date":1408320000000,"text":"The prices are good, the food is authentic and the portions are big.\n\nThe laksa is flavourful and quite spicy (even when we ordered as mild as possible). \n\nI liked the durian shake because I could taste the durian. This is definitely not for everyone.\n\nOnly a few seats available so it's best to get it to go. \n\nCall and order ahead because there is usually a wait, especially around lunch time.","useful":0,"funny":0,"cool":0}
{"review_id":"JMze73HpaNQfCqIe4Gqszg","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"0cpLF0LFQHHRFNlL0iy_Aw","stars":3,"date":1403308800000,"text":"1. Big eye tuna sliders ($10.96): Ahi bigeye tuna, wasabi napa slaw, sweet soy, pickled ginger\n- I ordered this appetizer for lunch and it was enough for me. Good balance of slaw and fish. The buns were soft and toasted.","useful":1,"funny":0,"cool":0}
{"review_id":"mDmBLneb8D-vFXHruNKBtA","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"cj_9eTPR0JBqk9qt2VmzFw","stars":3,"date":1403308800000,"text":"I've only been when it was about to close but the pancake still tastes good. \n\n1. Brown sugar\/peanut pancake\n- Great warm snack any time of the day. Not too sweet and would go nicely with tea or coffee.","useful":0,"funny":0,"cool":0}
{"review_id":"mldnei2GGYCPYDN53BEWgg","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"Yv4P4qUwd7F-qQ4Y4eD1JQ","stars":4,"date":1427500800000,"text":"I liked their version of a charcuterie board because it had katsu (fried pork cutlet) and shrimp tempura. \n\nI tried the soju flight and it was interesting. The flavours were strawberry, cucumbers and ginseng. \n\nThe sweet potato fries and chicken wings were one of my favourites.","useful":0,"funny":0,"cool":0}
{"review_id":"MB4rRTjU-urXQ5ri9JRVwA","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"G6EkDTXZ6zMUovg7JTG4YQ","stars":3,"date":1404172800000,"text":"1. Pad thai\n- Not ketchup-based or too sweet. Mine was salty but it would've been good if it was less salty. Not spicy. Comes with shrimp and chicken. \n\n2. Vermicelli with spring roll, shrimp on sugar cane\n- Spring rolls were small and over-fried. Shrimp on sugar cane was bigger than other places.","useful":0,"funny":0,"cool":0}
{"review_id":"AIjYq6Svq76Sc0eJ3Md-6g","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"ceK2VvPlxPBPo1evXOlD7g","stars":3,"date":1439164800000,"text":"The food was similar to a homecooked version I've had so I liked it. \n\nThe restaurant's decor is modern and definitely stands out from the rest of the ones in the plaza. \n\nTo order, you pay at the counter and find a table until your food is ready. There's a bit of confusion when the bell is rung because no one knows whose meal it is until you go up to check.\n\nOverall, not a bad lunch spot but probably won't be on our regular rotation.","useful":0,"funny":0,"cool":0}
{"review_id":"STTywk69Lkvh5DHt0A2Ebg","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"Vg4N2DsGrzzoam9jS1L3Wg","stars":2,"date":1403222400000,"text":"1. Burger - $3.05\nBig burger bun, patty is pre-made from a manufacturer. Condiments and toppings are basic: sautéed\/raw onions, mustard, relish, cheese (extra)  \n\nOverall:\nFor a late night burger, it does the trick. \nNo tables, just a counter and a bench. Many people eat in the parking lot or their car.","useful":1,"funny":0,"cool":0}
{"review_id":"ZIWZtVZyscL9Re7W7mARew","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"VRwT0pscR5vESCrAnUpNwQ","stars":3,"date":1431820800000,"text":"The nacho chips, guacamole and cheese dip were our favourite. \n\nPulled pork, fish and bulgogi tacos were all just ok. \n\nThe space is nice and fits with the King West atmosphere. Seating is \"community\" style (shared tables). You place your order and grab a seat when it becomes available.","useful":0,"funny":0,"cool":0}
{"review_id":"GuOKAJLYsFEK5VWZcIYiiw","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"uAAWlLdsoUf872F1FKiX1A","stars":4,"date":1403308800000,"text":"1. Ice cream sandwich - half portion: Gingerr cookie (with chunks of candied ginger) + cinnamon toast ice cream\n- I really like the homemade ice cream. It was creamy and flavourful. Cinnamon was not overpowering and did taste like Cinnamon Toast Crunch \n- Cookie wasn't too sweet or ginger-y\n\nOverall:\nI would go back. There was a lineup after dinner on a weeknight but worth the wait.","useful":0,"funny":0,"cool":0}
{"review_id":"xxOOWVyQ40vkN8KGPAFYlg","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"jBFUsag4GA8vvsSX14mbLg","stars":3,"date":1391040000000,"text":"I like the appetizer rolls with lettuce and pork. It's definitely meant for sharing as the 2 rolls are cut into 8 pieces but can also be eaten as a meal. I also like to order the bun  (vermicelli) with spring rolls and Vietnamese sausage. For the quality and the price, I think it's good value.","useful":0,"funny":0,"cool":0}
{"review_id":"CDLla4GM3KvayJbbI1kxeg","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"Uq-GOs9_IqweUsB5MdII9w","stars":3,"date":1426723200000,"text":"The French toast was thick (only finished 1 of he 2 slices) and the maple syrup has citrus flavours in it which may not be everyone's cup of tea but I liked it because it cut the sweetness. \n\nThe eggs Benedict were good but the roasted potatoes stood out to me more than the eggs Benny.  \n\nWe got there at around 10 and had to wait about 5-10 minutes. Shortly after that, the line grew and it got very busy before brunch time.","useful":1,"funny":0,"cool":0}
{"review_id":"u5SvLRxdTJHWZeGgJPMQHA","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"3k9treY8PmsZ42bKmuICgA","stars":3,"date":1404086400000,"text":"Sunday lunch: à la carte lunch special ($12) or AYCE ($20)\n\n1. Chirashi + miso soup + seaweed salad + 4 pieces of sushi \n- For $12 and 3 appetizer\/sides, I thought the meal was good. The chirashi had a variety of items. I wish there was more salmon but can't complain for a lunch special. \n\nOverall:\n- I enjoyed my meal. I've been to the Mississauga location and really enjoyed the pad thai there. I would come back to this location to try the pad thai. \n- 15% gratuity automatically added for large groups (we had 10 people) \n- Service was good. They let us split the bill and pay individually.","useful":0,"funny":0,"cool":0}
{"review_id":"XZLqTkMNFSMqBS0BDhnkug","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"nXoShX5FzJiFFD07aANiVw","stars":3,"date":1390780800000,"text":"We ordered 3 chicken shawarmas, a beef shawarma and a beef samosa. The beef samosa was very big and packed with meat. It was a bit spicy but not so strong that it would burn your mouth.\n\nThe shawarma wasn't that big compared to other places but I liked that it was warmed on a panini press first. They were 2 for $8.50 so for the price, it was good.","useful":1,"funny":0,"cool":1}
{"review_id":"OzZQaIQsYXCQfZis0a68cg","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"dy0O7DaSUd49NZWSEtvz_g","stars":1,"date":1403308800000,"text":"The Asian fusion aspect of the menu was not great.\n\n1. Crab\/avocado salad:\n- Not bad but nothing special. Expensive for half an avocado and crab.\n\n2. Lamb\/duck prosciutto dumplings \n- Loaded with meat, crispy skin. I liked this one.\n\n3. Taro fries\n- The crispy ones were good but the thicker fries were chewy.\n\n4. Ribs\n- Expensive for 2 pieces of ribs. Very saucy and tender but wouldn't recommend this.\n\n5. Steamed black cod\n- Fish came in 2 pieces of aluminum foil. The small piece of fish was sitting in a pool of soup. The truffle oil was unnecessary and overpowering. Wouldn't recommend this. \n\nOverall:\nWe won't be returning due to the mediocre food and service.","useful":1,"funny":1,"cool":0}
{"review_id":"egbxpSn7GFRGLkqg9Ckc5A","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"GEvolb_U74NXgfgdxrVtyQ","stars":3,"date":1392076800000,"text":"Spider roll - $11.99\nThis roll was bigger than expected and I was definitely full from it. I was impressed with the crispiness of the batter around the softshell crab.\n\nService\nThe service was good. We were given a complimentary pan fried salmon head which was unexpected and a nice touch.","useful":0,"funny":0,"cool":0}
{"review_id":"R4Zfk-P6WWHtdGUs62cJhQ","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"goihA0c0gTfhNKmgBOHYBA","stars":3,"date":1365638400000,"text":"When I was looking for the menu online, most of the information out there was out of date. The prices have gone up $2-3.\n\nSpicy pork neck tacos ($10 for 2 tacos)\nI liked the amount of meat and cabbage in the tacos.\n\nSpicy pork buns ($9) - 1 burger cut into quarters\nI liked that the buns were soft. We tasted the same spicy sauce in the tacos as the tacos. It was good but didn't jump out at me.\n\nSoo yook - 48-hour braised beef ($12)\nI'd skip this one\n\n\"Galbi ssäm\" set - short rib ($20)\nI liked the galbi. Flavourful and not too much fat (I usually leave the fat behind).\n\nService\nOur server could've been more friendly\/pleasant. She wasn't rude but didn't appear very welcoming either. Maybe that's the casual vibe they're going for?\n\nReservations\nThey do take reservations, but when we arrived it didn't seem like we needed one on a Tuesday night around 7:45pm. I used OpenTable anyway to get points.","useful":1,"funny":0,"cool":0}
{"review_id":"BuQYpKfuLwQvAFBOONXOaQ","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"LWtKuyX8w5SFm-JviPr4qQ","stars":2,"date":1390867200000,"text":"The food is not great but the price is ok. We don't come for the service but we don't have to wait for a seat during the Sunday lunch hour so it's bearable. If we have a group larger than 8, we get the party special. Otherwise the other lunch specials are reasonably priced (about $8-10).","useful":0,"funny":0,"cool":0}
{"review_id":"Haw0-6QBUehLjsP9pm9SqQ","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"AYLxEeVq8NKG2UhcBiggrA","stars":4,"date":1476921600000,"text":"On a Wednesday night, the restaurant was about half full so no wait needed for a table. The staff was great. \n\nGot a free delicious garlic bread with a Yelp check in. \n\nThe small personal pizza is about 9-10 inches. \n\nReally like the simple minimalist decor.","useful":0,"funny":0,"cool":0}
{"review_id":"eI14GD-Fimc44xwXDT92fw","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"-J6FVdY9pSgAdFmmalO-pQ","stars":3,"date":1428364800000,"text":"Food: \nLunch specials ranged from $7-9\nThai iced tea was $3.50 but we found it a bit watered down (not as much condensed milk or tea flavour as we would've liked)\nPad Thai: sweet and sauce and not ketchup based\nKhao Soi: the noodles didn't seem like egg noodles but the overall flavour was good. There was some spice to it which we liked. The beef was ok, not too dry like most places. \n\nService: \nWe experienced good service and had no complaints. Our server patiently explained the items we weren't familiar with. \n\nParking:\nWe went on a Sunday for lunch and there was ample parking in the small plaza's lot. \n\nOverall: we would go back to try some other dishes.","useful":1,"funny":0,"cool":0}
{"review_id":"bLFibCuVWzDEP7NJCj1Uig","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"42-UJ-c_97IeqUc6BWjmnA","stars":2,"date":1403308800000,"text":"Nice decor but would rather pay less for the same dish at another location.\n\n1. Vermicelli with spring roll and grilled pork \n- Crispy spring roll, pork was not dry. Noodles were not clumpy. \n\nOverall:\nAs nice as the decor is, the prices were higher than other similar pho restaurants and the menu was smaller. Service was good.","useful":0,"funny":0,"cool":0}
{"review_id":"zPZrjrcrtvN5xtGFHz8V5Q","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"LE94B7yvaxh0l_wh_yEpjg","stars":3,"date":1403222400000,"text":"Expensive Mexican food. Ingredients and technique were good but execution could be improved. \n\nCeviche verde\nNice big chunks of fish\n\nPollo en Pippian Rojo\nThe chicken was bland and the red sesame sauce\/ancho chile didn't add much flavour, just spice. Could've used more salt (I usually don't need to add more salt to anything)","useful":2,"funny":0,"cool":0}
{"review_id":"0roBFbQ_gZJ4QHRwNTfovw","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"v-supbjeNBKNwomn3sLc8g","stars":3,"date":1391212800000,"text":"I only come here because it is cheap and there isn't usually a wait or a very short wait. There is a tea surcharge but still ends up being cheaper for the same amount of food as other places. \n\nThe quality is fine..especially for the price. \n\nThere are about 3 large tables for groups of 8 or more. Mostly tables for 4-6. Some tables of 2 along the wall. \n\nLots of parking (the plaza is mostly empty).","useful":0,"funny":0,"cool":0}
{"review_id":"glvmn8Dz4h6MjYNz3YCwSg","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"cDoo0Pf1d_P79Rq3ZNk-Mw","stars":2,"date":1391212800000,"text":"We had a reservation on a Friday night at 6:30 and the place was practically empty. We asked for a room which had space for our legs below. Service was fine. \n\nThe food was fine. Nothing above and beyond what you would expect. The sashimi pieces were a good size. The sushi rolls didn't have too much rice. My tuna\/avocado tartare appetizer was bland so it tasted like a tuna roll without the rice. \n\nI probably wouldn't come back.","useful":1,"funny":0,"cool":0}
{"review_id":"NVrctfa0yT9XRO1JPwrkaw","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"33IS-0QBNwRC8cXnHABpbg","stars":3,"date":1365638400000,"text":"Duck salad - $15\nMy favourite dish out of the 6 we ordered. The portion was bigger than I expected. A good mix of textures and flavours. Warning: peanuts.\n\nRare beef - $16\nThere were 4 slices of soft rare beef. I thought it was ok..probably wouldn't order it again.\n\nTartare 2 ways - $10\n1) Spicy tuna with avocado on a crispy rice cake\n2) Salmon with shallots on a crispy rice cake\nI enjoyed the tartare and the deep fried rice added a nice crunch\n\nBraised spiced short ribs - $22\nThis was my least favourite dish but it was probably because I was expecting thinly sliced short ribs (like galbi short ribs). \n\nShanghainese steamed pork belly with sauteed brandy apples - $19\nThe pork belly was ok.  I don't like cooked apples so that didn't appeal to me. \n\nOur meal came with complimentary dessert (I believe every diner gets it) which was a nice surprise. \n\nService\nWe went shortly after it opened so we weren't surprised when there were a few dishes that were delivered to us by mistake, but the staff was very friendly. Kai came out to chat with us and apologized that we couldn't take a photo with Susur because it was during the dinner rush. \n\nMenu\/prices\nOverall, I liked our meal. It's out of my price range so I probably wouldn't go back unless it was a special occasion.","useful":2,"funny":0,"cool":0}
{"review_id":"V7Biz07tJScTgan6l4Q1pg","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"FnQ-_pGdw11za0LQ_aORxQ","stars":2,"date":1406764800000,"text":"1) Crepe \n- Nothing special about the crepe. The basic topping was jam. Costs ectra for toppings like fruit, nutella, etc.\n\n2) Macarons\n- Flavours sound unique but some were strange. Lavender was my favourite. \n\n3) Creme brule \n- The custard was ok. The brule could've been done better. It didn't taste like it was made to order.","useful":0,"funny":0,"cool":0}
{"review_id":"0vITqbidNLldWrDSah6Uqg","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"snw9iNNLpFYZeHotW00uVA","stars":3,"date":1374537600000,"text":"If I go back to Lee, I would only order the slaw again. The decor and ambiance in the main dining area are  Asian-inspired, as expected but also appears somewhat dated. \n\n1) Singaporean-style slaw\n\nWe ordered Chef Susur's famous signature dish, the Singaporean-style slaw ($20) and added tuna sashimi ($10). This slaw was very good. There are so many ingredients but they work well together and it was refreshing and light. \n\nThe tuna sashimi was smoked on the outside and it didn't really add any flavour so I would probably skip that. The tuna does add a contrasting texture to the crunchy slaw. I arrived hungry and felt full after eating half of this dish.\n\nNote: there are peanuts. \n\n2) Peking & Char Sui Duck ($29): Beijing duck garnish, steamed pancake, foie gras pâté\n\nThis is not the same as what you would expect from a traditional Chinese restaurant style Peking duck. I didn't enjoy this very much. \n\n3) Warm Molten Chocolate Cake ($12): caramelized jackfruit & banana, vanilla bean ice cream\n\nNothing unique about this dessert but it was delicious anyway.","useful":1,"funny":0,"cool":0}
{"review_id":"R9mg7G1a4BlS3icwOCzUvQ","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"9z1T2lgmirOxrTpFh9ellw","stars":3,"date":1476921600000,"text":"Customizable level of spiciness and niceness. Even a mild level of spice may be too much for someone who can't take much heat.\nAsk for additional noodles at no charge. \nCan only pay by debit with minimum $20 purchase. \nThe lamb noodle bowl was ok. The lamb smell wasn't that strong.","useful":0,"funny":0,"cool":0}
{"review_id":"useIM496OuyjFzyLV9mAzQ","user_id":"UGW-9bbBEB3eP1o6mWD_WA","business_id":"XiMvHK4Nq0xPa1GOtdKzdA","stars":3,"date":1390780800000,"text":"I thought the pho here was ok. I came on a recommendation but didn't find the broth a standout. I did notice that it was empty at dinner time on a weeknight but filled up when we finished around 9pm.","useful":0,"funny":0,"cool":0}
{"review_id":"YGVbjhIL_L-kiVWRVI2JfA","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"HKfW6AZ-lW7jwLJwNlcLLQ","stars":1,"date":1454716800000,"text":"Service was really great fast quick friendly but the food was a terrible..... \n\nBlanco roll was the worst..  it's like someone squished egg, tuna from a can and panko crumbs and made it a roll.... As if that's not bad enough they make it resemble some back ally hotdog by adding pickled jalapeño to it.... Gross if you like fish cakes and hotdogs this roll is for you. If not I highly recommend staying away. \n\nIf they made it simple with avocado raw fish and other non over powering tastes then sliced raw jalapeño over it then torched the butter fish it would probably be the best sushi roll here. \n\nVolcano roll was okay but really over done with the sauce quantity which took away from enjoying fish ... Which is why I go out for sushi. \n\nThe sashimi plater (30 pieces) was pretty bad aside from the octopus and 3 of the 9 cuts of salmon.... Everything else was off temperature. \n\nComplimentary salad was small cute and good. \n\nThe miso soup was good. \n\nTea was average. \n\nGinger is really good here.\n\nWasabi is really weak here. \n\n\nI hope the chef seriously considers the suggestion I made about the less sauce and torched raw jalapeño.... Ja Bistro has mastered it and it's incredible.... Maybe the chef should check it out and see what I mean. \n\nWould not recommend this place. Will not be coming back.","useful":5,"funny":0,"cool":0}
{"review_id":"3_waRRDQRPmAUB5u8g_emg","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"GhGN_eerrkfnWjNXvIb21Q","stars":1,"date":1450656000000,"text":"-5 stars!! Worst place ever. Don't bother going here you will definitely regret it. \n\nSave your money for a better serviced, hygienic, more organized and professional establishment. \n\n\n(You would think when a party of 40+ people are coming they would provide better service considering all the money you just brought into this dump for them) \n\n\nNo one from that birthday will ever be wasting our time making that mistake again.","useful":3,"funny":3,"cool":1}
{"review_id":"LjKdXV1xL8_WbttC-BLf2Q","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"e5sG3W76VcRXsmIBHPEMhQ","stars":5,"date":1366243200000,"text":"All I have to say is .... if you're going to get a tattoo and want it done RIGHT and like no other place in toronto go see RAIDEL at adrenaline!!!! \n\nI originally had an amaZing tattoo artist in Kensington (Vince) who unfortunately moved back to Venice, Italy. Fate brought me to the hands of the very talented RAIDEL! \n\nHis passion for creative designs and art is phenomenal! He has done quite a large AMAZING piece on me and most of it he just did FREEHAND  (That is talent!)  \n\nThe thing I LOVE the MOST about his many talents is the fact that he has something that I find is SO RARE in a tattoo artist... he can create that FLOW into making your tattoo not look like a stamp ... but a part of you... an art that can even take previous pieces and make them one! I have about 1 3rd or fourth of my body tattooed and this tattoo SAVIOUR turned my several prior tattoo pieces (ribs, shoulders upper back) and with his new addition turned my body into a canvas with one solid flowing united piece. Brilliant engineer in designing.     \n\nAdrenaline is quite pricey ..but if you are getting it done with him IT'S WELL WORTH IT. If I wasn't so broke ass I would give him a HUGE TIP as appreciation for his VERY hard work and TALENT! I intend to repay him some day by surprise for the lack of the TIP he deserved that I didn't have at the time.\n\n\nThis HARD working FRIENDLY always smiling singing ARTIST will make you NEVER WANT to go anywhere else with all his talent and positive energy!","useful":0,"funny":1,"cool":0}
{"review_id":"Y3A4AS0_LEj3RA4nDZ0h0w","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"K-tKnqhblGR7K4R3roKmqA","stars":5,"date":1442361600000,"text":"Quick very friendly service this evening! She was very welcoming and made some suggestions after knowing it was our first time. \n\nButter Chix- Creamy subtle kick of butter chicken spice... Saucy very enjoyable!  \n\nMum's Chicken Pie - Classic  was not disappointed LOVE the touch of Chardonnay really gave it that extra little something \n\nTraditional Aussie - Saucey , meaty, has a little potato (not too much... Which I really appreciate because I didn't have an allergic reaction to it from that very reason ) \n\nSurprisingly even though these little guys are the size of your palm they are actually decently filling ! ... You might just need 2-4 to fill you up depending on how much you can handle. \n\nPrice is okay ... About $7 each Palm sized pie. They have 4 pies for $24 to take home and cook located in the freezer ( I feel that is a better suited price for the cooked ones too)   \n\nOn the plus size the hand held sizes lets you try more flavours!! \n\nWould recommend people to check it out!","useful":0,"funny":0,"cool":0}
{"review_id":"I8x6dVFeBVGS6XI6ryTQ2Q","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"NEYMAeK1BeR2E_vELnEIDA","stars":5,"date":1463616000000,"text":"Love love love Quantum Coffee  100% better then Starbucks (and done properly) Lattes, Cappuccinos and flats, Oh my!   \n\n\nAlso a few cents cheaper then Starbucks(but WAY better in quality)! \n\nService is always great baked goods are always amazing and super fresh! (Also sent in from local bakeries ) \n\n\nDid I mention they now have a reward coffee card ? That's right Starbucks .... You have zippoooo on Quantum... Suck my kiss.","useful":1,"funny":0,"cool":1}
{"review_id":"ql_y3bNefJJHbCKZKm0k3g","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"4twpbw7n4DmsLxAm6-sMkg","stars":5,"date":1444089600000,"text":"LOVE the food here! \n\nAlways amazing friendly service. The atmosphere is good it's a very simple place inside out but the food is killer! I always come here when I need my Korean food fix! \n\nThe pork bone soup is awesome the meat basically falls of the bone! (Perfection) \n\nThe Bibimbap is always my go to dish! It tastes like the best mothers home cooked meal! \n\nI love how they are always attentive to make sure you get your pickles and such at the beginning and how friendly and welcoming they are. Great place to go with a family, group, as a couple or alone!","useful":0,"funny":0,"cool":0}
{"review_id":"qO81z1KiEviyr2TEVOXaeg","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"VRwT0pscR5vESCrAnUpNwQ","stars":2,"date":1435622400000,"text":"The fish taco is really good. \n\nBurrito boys makes the best burritos this place... WAY too much bread ratio not enough of anything else. \n\nThe other meat tacos  not good meat tastes more like old leftovers from earlier that week. Lol gross. \n\nTIP: if your going only get fish tacos","useful":0,"funny":0,"cool":0}
{"review_id":"RO7Ca7ER1Vo06jTlvHCEbw","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"SW0NcZwZsbSpsk0ZPgJKmQ","stars":4,"date":1462147200000,"text":"Authentic home made curries ...\n\nGreat Tom Yum \n\nPad Thai is good \n\n\nVibes are relaxed \n\nMusic not too loud \n\nFills up quick because it is a small Resturant. \n\nStaff pleasant.","useful":1,"funny":0,"cool":0}
{"review_id":"pwINZpmTYiXybGdlRrbEwg","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"nBl_4gw5ecGzNkHyzfii8g","stars":5,"date":1452643200000,"text":"Use to come here all the time and loved it! \n\nService needs a little work but more importantly lets get to the food reviews \n\nStarting with my personal favorite...\n\nRavioli di Zio Paperone -Great \nhomemade ravioli stuffed with duck confit, fig, roasted butternut squash, sauteed with oyster, button mushrooms and parmigiano\n\nTonnarelli alla Norcina - Good \nItalian black truffle shavings, homemade spicy sausage, pecorino \n\n\nTagliatelle alla Bolognese- Great \ntraditional bolognese ragù, parmigiano \n\n\n\nTonnarelli ai Funghi - Good \noyster and honey mushrooms, porcini sauce \n\n\nCavatelli al Ragu' D'Agnello -Great \nhandmade cavatelli, lamb braised in tomato sauce, Pecorino \n\n\nGnocchi alla Simi- Good \ntomato sauce, fresh ricotta, basil, parmigiano \n\n\nRigatoni Arcobaleno - Good \nmozzarella di bufala, zucchini, light cherry tomato sauce, basil \n\n\nAgnolotti alla Lilli -Good \nstuffed with spinach, ricotta and pecorino, butter, sage and parmigiano\n\nSpaghetti in Canna a Mare - Okay \nfresh clams and mussels, calamari, scallops and tiger shrimp, light tomato sauce \n\n\n\nApristomaco - Appetizers \n\n\nCarpaccio di Manzo- Great \nhand cut, raw beef tenderloin, lemon juice, extra virgin olive oil, parmigiano reggiano shavings, arugola\n\n\nFunghi Assoluti - Good \nbasked oyster mushrooms, parmigian, bread crumbs, extra-virgin olive oil, balsamic vinegar, arugola \n\nFrittura di Calamari - Okay\ndeep fried lightly floured calamari\n\nTagliere del Salumiere -Good \nselection of Italian and local cured meats \nTagliere di Formaggi - Good \nselection of italian cheeses served with honey and homemade jam \n\nInsalate - Salad \n\nOnly one I have tried is Caprese and it was Good. \n\n\nPizze - Pizza \n\nThey are well done thin crusts .... I personally like Napoli, Margherita, Bufalina, Quattro Stagioni, Santo Stefano, Da Dó a Dá, Smendozzata, Li Pecuri, and finally C't Mang. \n\n\nDessert ... I always get a flourless chocolate cake heated .... It's a perfect finish for my dinner with a cappuccino or latte","useful":2,"funny":0,"cool":0}
{"review_id":"PiQ6nRjJSeuC7tv3uFWklg","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"SW6ZQk22G1_CV81_gfnvNQ","stars":3,"date":1427760000000,"text":"\"In cod we trust\" great deep fried fish toco (but fish portion is small) \n\n\"Beef Cheek\" braised and good portion \n\nTuna Chive in hard shell toco okay portion ( a little too drenched in sauce) \n\n\nWe had some ribs \"special of the day\" portion not worth the price AT ALL ... Sauce is a type of honey garlic (drenched in mayo ) not worth the money. \n\n I had high hopes for great food here after reading the reviews ...but was over all not really that impressed.","useful":0,"funny":1,"cool":0}
{"review_id":"64d0b-8YJE8BJNv7Xb9lBw","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"_cjPEH9wXhKS-HQe_U3M4Q","stars":3,"date":1444089600000,"text":"This place is a hit and miss some times the food is really great and flavourful and other times I have ordered food that was over salted or just bland. \n\nService has been okay. Portions are a hit and miss for some things. I don't think I will be going back after my last visit though.","useful":0,"funny":0,"cool":0}
{"review_id":"KW3cBdgVled03ARMevnpHA","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"-J6FVdY9pSgAdFmmalO-pQ","stars":1,"date":1457222400000,"text":"Not authentic at all..... NOT AT ALL \n\nKhao Soi ..... Not sure who paid all these reviewers to call it \"authentic\" ... I am a HUGE fan of Thai food and have NEVER had coleslaw ... Yes that's right ... Literally COLESLAW in the Khao Soi. It is disgusting. Beef was not tenderized and undercooked.  \n\nTom Yum - the only average thing worth maybe trying if there is nothing else open and you need food. It is heavy on the lemon grass and is missing the fundamental herbs and spices.... For starters galangal .... Had no freshness to the soup .... Tasted like over cooked boiled veggies that had some paste added  choice of meat and severed.  \n\n\nCurry is not authentic at all .... It is a pre-made paste added again to something cooked separate.... Then served. A paste at a Resturant considered to be authentic should be made in house and better quality.\n\n\nService was fast. \n\nServers were fine. \n\nMusic was fine. \n\n\n\nOverall poor quality food.... Will not be coming back and DO NOT recommend this place to anyone.","useful":0,"funny":0,"cool":0}
{"review_id":"6TfdJodXZ94VyV2z3xg-OQ","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"2X5I7wY_bqYWOub-q2Ba3Q","stars":5,"date":1442361600000,"text":"Awesome home cooked style food! What a little gem we found! The outside is a little off putting but once you go in its a completely different situation.\n\nService was great ! Friendly professional classy staff and great priced filling traditional food!  \n\nCabbage rolls - saucy simple and tasty \n\nPerigees- loved the potato ones!! \n\nSchnitzel- tender, not oily, tasty  \n\nVery fresh ingredients ... Really satisfied our home cooked craving","useful":2,"funny":0,"cool":0}
{"review_id":"f0rTZVLTxipXkgoFT7ZoDA","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"ErTB7R4rJNUUV8nsUVG26Q","stars":3,"date":1444867200000,"text":"I have been here before but my last experience was not good at all. \n\n\nThe bad - the younger lady who served us seemed like she does not like her job ... She made our visit unpleasant right from the entrance ... She seemed a little arrogant too.... And was not very familiar with the desserts. \nI am not a fan of lemon desserts but I do not mind something with a tiny note of it (as I know a lot of baked desserts often do have a little in them) ... When I specifically asked for her recommendation she gave me an extremely lemony dessert. I also requested a no foam latte and she seemed to also miss that one as she handed me something that closely resembled a cappuccino. \n\nI love the heart of this place ... It was actually a bit heart breaking with my last visit as I have come in several times throughout the past couple years and have not received this type of treatment. \n\nThe good- Love the desserts here I usually always grab a mix box of the traditional southern Italian almond and pistachio biscuits and am always very pleased with the texture, the flavour and the combination of them! \nThe bread here is amazing highly recommend you try anyone of them (I am sure you will love it! ) \n\nThe coffee beans they use here are also very robust and strong which I love.\n\n\nI try to ignore the treatment I got here last time .....because maybe she was just having a bad day and was taking it out on us .....but to be honest that's no excuse, ever ... And it will effect me to now go closer to Bathurst and collage to go get my almond pistachio fixes from more pleasant staff.","useful":5,"funny":0,"cool":0}
{"review_id":"N6uYKO8sow0QoBKpcJZNGQ","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"c35qzLN6ItDpVIoj2uQW4Q","stars":5,"date":1452643200000,"text":"I really love the butternut squash soup here... It's one of the things that has always stayed consistent even after the change of hands after the owner passed away.  \n\n\nCurry Lamb Wrap - Good \nHas a great spicy kick .... Perfect for winter and autumn days. \n\nChicken Wrap- Good \nChicken is tender and cooked simple but well. Can't go wrong with the chicken. \n\nSteak Wrap- Usually great but last time was way over cooked... They need the cook to keep a closer eye on the meat to make sure it's still pink on the inside of the beef.... \n\nThe fact that it was over cooked made me think maybe they downgraded the meat quality ? Regardless now I will only be going there for soup!","useful":0,"funny":0,"cool":0}
{"review_id":"cyPaZNZ77Kc2nZas20FqsA","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"LB7r3hZmb4NXb2jDQmmQ9w","stars":4,"date":1421020800000,"text":"Food is good. Fresh house made broth great flavour and not salty like most soups I have at restaurants... Fair price for quantity and quality of food. Beef Flank soup is really good here. Service was fast!","useful":0,"funny":0,"cool":0}
{"review_id":"AVutsGbOCKlesul0HrXSFg","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"gEv1Og5uGDLw9HkbKSGUZw","stars":5,"date":1456531200000,"text":"Love love love this place! \n\n\nTacos tacos  \n\nFirstly just need to say I put the habanero hot sauce on everything here to give it a little kick! ... If you love spice defiantly try it.  Also rule of thumb *squeeze* that lime on everything ! Tacos and in drinks .... Just go wild. \n\nShrimp tacos were juicy and great \n\nFish taco was great and flaky \n\nThey had a Trout taco day feature which was great (with a little lime and hot sauce)\n\nChicken and beef tacos had a decent amount of meat in them and were nicely cooked and shredded. \n\nThe Vegetarian option was surprisingly also very tasty and flavourful \n\n\nCeviche love the jalapeño touch inside but fish and tomatoes needs to be chopped up more for better chip grabbing fun. \n\n\nMargarita pitcher could use a little more lime less agave and more tequila.... Less sweetness and more pungent twist and kick in the mouth to go with those tasty tacos. (I just ordered extra tequila and added to my cup.... But I would say about 4 more shots in the pitcher would fix it)\n\nOver all very great vibes...music is beautiful loud and upbeat. Friendly staff. Great place to go grab a bite laugh and enjoy a fun Latin vibes time","useful":0,"funny":0,"cool":0}
{"review_id":"bDKAD52T5_dWnuTjZwzXgA","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"J8cLxK-DIl8ZweElFLec7Q","stars":3,"date":1442361600000,"text":"Great, friendly, quick service.... The Red , yellow and green curries are great  creamy and has a nice flavour \n\nRed - personal favorite we get this all the time. \n\nGreen - little spicier so not recommended for those who do not like spice \n\nYellow - good .. not spicy","useful":0,"funny":0,"cool":0}
{"review_id":"lnU-YB13acJD5b3Hos9bYw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"WTGmtvIE1v9uEBZxiyXImQ","stars":5,"date":1341532800000,"text":"Relaxing atmosphere, educational chalk based corn diagrams, and air conditioning... what more could you ask for? Well, add to all of that, that the food is delicious. Maizal is a recent addition to the Liberty Village area. They have vegan and gluten-free options in addition to non-vegan\/veg ones.\n\nThe menu is short and simple. At the moment, the vegan options are: grilled quesadillas sin queso (ask for no cheese\/dairy) with either poblano peppers or mushrooms, the sopes with black beans, tlacoyos (bean filled tortillas), and opales (cactus.) All very yummy sounding options. Their tortillas are entirely corn based (and gluten-free) and made fresh every morning. (they also happen to be delicious.)\n\nOther things on the menu I should mention: the horchata. Traditionally milk-less, it's rice based at Maizal, with a cinnamon spice, and perfectly ice cold. \n\nOutdoor patio space is out front on Jefferson, and small but decent. Interior space is ample, but I imagine it's going to be an area lunch time takeout place pleaser, a tasty, healthy meal for under ten dollars. If you sit in like we did, you can read about the history and cultivation of corn on the very aesthetically pleasing chalkboards (and no joke, it really is interesting.) And let me say it again: Air Conditioning.\n\nWe each ordered 2 grilled quesadillas sin-queso (no cheese.) We sat sipping on horchata's while we waited and enjoyed the corn diagrams. They arrived, with pico de gallo on shredded lettuce, and a side of refried beans.  One poblano pepper and one mushroom. One bite and I've decided these tortillas are made of tasty magic. That one bite was all tortilla, and it was so rich in maizey-flavour and texturally superior to nearly all other tortillas I've had up until now (so I eat a lot of tacos...)\n\nThe fillings for both were great, both hearty and satisfying with rich savory flavours. Add some of the pico and a touch of lettuce and it is perfection. The folks at Maizal are doing exciting things with food, and I'm looking forward to seeing more, and eating much more from them.\n\np.s. prices are reasonable.","useful":7,"funny":4,"cool":4}
{"review_id":"ZWGcxdt0-60YpvS7L57qiA","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"eMLvsFmMFtzTaIn1LJJbdQ","stars":3,"date":1298851200000,"text":"This is another place I'd never have stumbled upon had it not been for the Indie Coffee Passport. I'm never in the George Brown area. We dropped in on a Saturday morning and it was mostly empty.  Walking by, it looks like an old antique furniture store with a random assortment of unmatched pieces.\n\nNo, but really, I like random, and I like the atmosphere, it's weird but well lit. I'll call it... cozy. I liked the big wooden table by the window I didn't have any luck connecting to their wifi with my ipod but I saw other people on laptops tapping away. Minimal plug ins, but they exist.\n\nIt was a beautiful looking cup of coffee, but it may have also been the worst almond latte I've ever drank. I think it's great that they offer almond milk, but I'm not convinced they knew how to use it that day. Overall... my problem was that the coffee was very bitter. Way too bitter. \n\nAlthough it didn't effect me, this place is cash only. No Debit Cards Allowed!","useful":3,"funny":3,"cool":3}
{"review_id":"8ZMhRRoj3TEq32TQkGfgIA","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"EJmiKQKlWfY-0iVlya7FOQ","stars":2,"date":1304035200000,"text":"I went to Z-Teca for the first time a few weeks ago after being really excited to try it out. Unfortunately, as with most over hyped oversold places, once I did try it, I was really disappointed.\n\nService was friendly but the flavour was lacking. It felt like I had gone to Chipotle, but so much worse. The rice and vegetables were boring, and rice was in copious amounts. Beans are optional\/extra? What is up with that? It's a burrito!\n\nI doused my burrito in hot sauce to give it some flavour, and vowed to find some where else to go next time I was hungry in Fairview Mall.","useful":5,"funny":3,"cool":2}
{"review_id":"xyNUC_p5KPI8LOCrAXZHnw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"XdY36-Qh_DxnCaFpTPfYMg","stars":5,"date":1331251200000,"text":"So it's the first day Tori's Bakeshop is open, so maybe it's premature to review them... but I can't help it. Yelp must know about a new vegan & gluten free friendly bakery.\n\nIt took me about 40 minutes on the Queen streetcar  to get here after work... but it was worth it. Since it was the end of the day, they had already run out of many of their sweet baked treats (even after apparently baking 3 day's worth of things) but I grabbed a vanilla cupcake with butter cream frosting, a delicious chocolate chip cookie, and a gluten free butter tart (and a non gluten free butter tart). They were all delicious. The cupcake was spongy and fluffy, the icing sweet, whipped, and not stiff at all. I was especially partial to the GF butter tart.\n\nFriendly service, and great interior design. I loved the overhead lights - they're freaking lamps made from giant beaters, plus every table had fresh flowers on it. One word sums this place up -  adorable. (In two words - adorably delicious.) I love the random jars with stuff in it aesthetic. Lots of greens and neutral tones.\n\nAlso - wifi.Free functional wifi. There are outlets all over the place if you look for them (one main one that I know of is right at the front corner with the comfy seating. Yes.\n\nGolly I wish this was closer to parkdale\/trinity-bellwoods - though odds are, I'll be back really really soon.","useful":7,"funny":0,"cool":5}
{"review_id":"J0WxHbfHRJRwR8v5eZSv5A","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"gOBxVkHpqtjRRxHBIrpnMA","stars":2,"date":1289606400000,"text":"I'm not quite sure what the fuss is about about Chipotle. My burrito was flavourless and unexciting. When I bit into it I couldn't help but think... wow, I waited 15 minutes in line for THIS? \n\nI think it didn't help that one of the members of counter staff left right as I got to her station, so I stood there an extra 5 or 6 minutes waiting for someone further down the chain to realize... oh nothing is happening.\n\nThe one of the things I did like was the tortilla chips with the hint of lime and the fresh pico.\n\nMaybe I had a bad experience, maybe I've just had really amazing Mexican food, maybe I should try them again, or maybe I should just try a different location.","useful":3,"funny":1,"cool":1}
{"review_id":"LmB8A15Vah5-SDchzKzJlw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"YWd0I1BxSzFG61lSyC3IyQ","stars":4,"date":1344816000000,"text":"I've lived in Toronto for two whole years as of this month, and I have never once had  a bad time there. More often than not, we've gone there for brunch, and the service has been stellar. Not just hey they'll bring me my order the way I asked for it, but they'll do that AND be friendly, helpful, and fast. Service is great, they have on repeat occasions gone out of their way to be accommodating (without attitude).\n\nA big one for me is they are vegan friendly (including the best most delicious vegan caesars in town) with most brunch items available veganized (and like every other brunch place they are omnivore and lacto-ovo-vegetarian friendly too,) you sit where you want, you can play board games if you want, you can drink bottomless coffee with your brunch if you want, you can ask for their fancy cocktail menu (yes, they have one), or just check out what's on offer to drink on the chalkboard.\n\nI'll also say, that the food is okay. Tofu scramble is hit or miss, but usually it's decent enough that even on it's worse. I've had worse tofu scrambles at places catering to vegetarians, so there is that.\n\nI've gone with friends, I've gone with family, I've gone in pairs, I've gone in big groups. Go for brunch. It's great. Go for drinks, it's fun. \n\nOther stuff: Cash only (but there is an ATM inside), they have baked goods and cheesecake from Through Being Cool (vegan) bakery, and conveniently close to Nazareth Ethiopian restaurant (eat delicious Ethiopian food then go drinking).","useful":0,"funny":1,"cool":0}
{"review_id":"OEGEWMmywVHgVR3TuZYZ6A","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"yHCoJZh5nx0Onr5xgMaUHg","stars":3,"date":1289433600000,"text":"I'd like to say I loved this place, because for the most part I did.\n\nThe veggie selection was beautiful, the store was bright and clean, but ultimately, all of that was ruined by my experience at the check out.\n\nI went through the self check out, you know, so I could avoid talking to cashiers and go through the process quickly? Instead the attendant would not leave me alone and it took twice as long.\n\nHe hovered and hassled me the entire time I was going through the check out, he yelled out the veggies at me that I was buying from his station, and it was really frustrating. It totally ruined the whole experience for me. \n\nIf I do go back, I'm not going to bother doing self check-out (and I don't recommend anyone else does either), not much point if someone is going to micromanage the entire process.\n\nI would have given this place a five, I wanted to give this place a two after I left, but it gets a begrudging three because it has such a nice selection and a clean bright location.","useful":4,"funny":3,"cool":2}
{"review_id":"drex7uO1HzcbS4iG6HZLBA","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"yxdmX8dXk5Se9zJ4WAW1pw","stars":5,"date":1290211200000,"text":"First of all, this is probably the best Vegetarian restaurant I've been to in the Toronto area, and probably in my top ten of vegetarian restaurants I've been to in North America.\n\nI took a big burly omnivore with me, and he loved everything we ordered, so I take that as a great sign.\n\nWe started things off with an order of crispy oyster mushrooms and seared dumplings. I wish we had ordered two orders of the crispy oyster mushrooms because I can never have enough, they are so rich and flavourful and the sweet slightly spiced sauce is a perfect compliment for it.\n\nWe both ordered the Special of the Day, which was a tofu skin wrapped taro root mash on a bed of greens, with a side of noodles, and a flavour explosion of a mango salad. \n\nOur waitress totally sold it. Her description got my mouth watering from the very beginning. It adds so much to a meal when the server is friendly, and she was wonderful. Moreover, she clearly loved the place and the food, which is exactly the type of person I want advising me on what to order.\n\nI was feeling pretty full after finishing my plate, but there is always room for dessert. My dining companion and I shared a piece of chocolate cake and a brownie sundae (but since they were out of brownie, they used lightly warmed chocolate cookies.)  What can I say, other than delicious! delicious! delicious! \n\nThe chocolate cake was good, but not as good as the sundae. Though I'm glad our server made sure we took the left over chocolate cake home, because while it wasn't as awesome when it went head to head with the sundae, it was fantastic by itself at 3am.\n\nIn Short: \n- order the crispy mushrooms, you wont be disappointed. \n- And the Special; it's consistently amazing.","useful":11,"funny":3,"cool":9}
{"review_id":"dZ_a6D96J3Of26svfe8Cng","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"7cMnc_zSPenfSQa9_199CA","stars":5,"date":1409184000000,"text":"I've been travelling a lot lately and in the time I was away having fun and eating lots of great food, Bloomers opened and I was really looking forward to coming home and visiting this (still) new vegan cafe and bakery in Bloorcourt.\n\nSo finally,I got to visit them today. \n\nFirst impressions are: I love the wide open space, that there are multiple options for seating (booths, tables, high tables, etc). They've got free wifi (I didn't look for power outlets this time). Service was really nice and friendly. And I felt pretty comfortable just hanging out with my coffee for a bit\n\nToday I saw a couple of different kinds of donuts, fluffy coconut donut holes, chocolate chip cookies, butter tarts, blueberry tarts, BAGELS, and a donut Bread pudding, and probably more, but I was especially drawn to the bagels, as I haven't seen bagels around any of the fine vegan bakeries we have in our city AND I happen to really like bagels (and usually end up making them myself). as an added bonus they had tofutti cream cheese available. \n\nThey've got a variety of kombuchas, teas, blue sky soda, and assorted bottled fruit juices, in addition to fancy (and more regular) coffee options. \n\nI hear there is a menu extension coming in September with sandwiches and the like coming soon, so I'm pretty excited to check that out too when it appears.\n\nI liked it here, I would (and will) be back again soon. \n\nAccessibility-wise: Today the door was wide open (otherwise it's not powered), but there is a bit of a quarter step to get in. And  in a wonderful departure from the usual Toronto bathroom in the basement style the restroom is on the main floor.\n\nAnd regarding one of the other reviews... it seems a little (no, it seems a lot) ridiculous to complain about the lack of dairy products at a vegan cafe.","useful":3,"funny":2,"cool":1}
{"review_id":"jcDEi86UzPtvyo-5X_y6aw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"cInYKKK7p9y1FokuKClNtw","stars":5,"date":1292198400000,"text":"You know those times when you visit a cafe or store and leave with the desire to tell everyone you meet how wonderful it is? That's how I feel about this place.\n\nThey have a great warm inviting atmosphere, and it's a cozy (i.e., kind of a small space). While there is room for about three people to sit in the window area, prepare to either stand and eat, or take a box home (or eat there, AND take a box of treats home like I did...)\n\nThe people working there are friendly and helpful, and when I walked in, all wide-eyed and overwhelmed with options, they gave me a run down of what they had and offered some recommendations. Bunner's was just all around fantastic from the start. And then... I ate one of the \"gypsy\" cookies, and I was completely sold. Oats, melty chocolate chips, dried cranberries and a few other things combined into a soft chewy cookie. I want to go back, right now, and get another one.\n\nI should probably mention that in my experience gluten free tends to secretly mean gross, and I have been known to occasionally thank my body for not having celiac disease. So what I'm saying when I say this place is good, is that it's not just gluten-free good. It's actually good.\n\nWhen I went in today there were cupcakes (three different kinds: vanilla, chocolate and red velvet), DONUTS, amazingly yummy cookies (gypsy cookie), freshly baked loaves of bread (which I'm kicking myself for not trying), muffins, and cookie sandwiches!\n\nWhat I'm going to hope for is that every coffee shop in town starts using them as their source for vegan (and\/or gluten free) treats. While they have decent enough coffee (and Silk Soy creamer is available), I sure wouldn't mind having one of their cookies or muffins with a nice soy latte. (Of course... Crema Coffee is just across the street...)","useful":14,"funny":2,"cool":8}
{"review_id":"0JMRNpqIu1emDdydUmzXAw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"iZJ5pdY558VodrEumGyVug","stars":4,"date":1286755200000,"text":"I went to Nazareth yesterday and we lucked out because it was nearly empty inside (however it filled up within 30 minutes of our arrival and then there was a bit of a line.)\n\nThe service was fast and friendly, but there was a bit of a wait to get our actual plate, but it wasn't uncomfortably long. Our server checked on us regularly and was very pleasant.\n\nWe ordered one order of the vegetarian combination plate, and between the two of us, we still didn't finish all of it.\n\nOver all it was a great experience, we got there at just the right time and the bill was ridiculously cheap.","useful":4,"funny":0,"cool":2}
{"review_id":"jU4FaU01qNMLOwlQB8Ta0A","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"w4SY_FlZnIfAb8UjDABPsQ","stars":4,"date":1287360000000,"text":"I like this place, I guess that's why I keep coming back. The seats are comfortable, I like that I can lean back, and the temperature has always been decent (unlike some places). The location can't be beat (easy access from Dundas Subway).\n\nI know some people aren't into the \"butter flavoured topping\" that AMC has going on, but I love that it's available. Not that it's in anyway good for you (mmm soybean oil...), just that all signs point to its veganness, which works for me.\n\nAs with every movie theater, they will gouge you at the concession, and make you wish you had the foresight to sneak in your own snacks.","useful":4,"funny":0,"cool":3}
{"review_id":"N7WCcnQgXuYF_ITflWyhOA","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"dn_ipqbm7_jUz5X3rDez_A","stars":5,"date":1284076800000,"text":"Todd English's latest is incredible!  Great atmosphere (cool bar, outdoor pub tables, red leather booths inside) and our server (Paul) was phenomenal.  Expansive bar and a huge selection of beers on tap, including some very enticing samplers.  No blue cheese olives for the martinis (bummer, since that's a signature drink at Olives).  Prices are high, as to be expected in City Center.  The seafood is the freshest I've had in all of Vegas- it's flown in every morning.  Their live bar comes by the piece- east and west coast oysters and delicious jumbo shrimp cocktail served on a gorgeous platter over ice and garnished with sea plants.  The duck buns were incredible- the meat was sweet and tender and the buns were like soft little pillows!  I've been dreaming about these ever since and I plan to come back for them!!  Lobster rolls were delicious- sweet rolls lightly buttered and grilled, then stuffed with lots of sauteed lobster meat.  The coleslaw they were served with was the best I've had.  The moules frites (mussels) came in a rich, delicious curry broth and even the fries were perfect.  We also had the pickles (three house-made varieties, thought they came with bottled mustard and not stone ground).  The smoked salmon quesadilla was incredible- with buttered yukon golds and fried capers.  They also do a fabulous bread pudding that is served with fresh whipped cream, salted caramel ice cream, and a delicious toffee sauce.  The bread pudding itself was the perfect texture and is one of my favorite desserts in all of Vegas.  This place rules, I cant wait to come back and try the carvery menu- chose your meat, sauces and bread.  Definitely recommended.","useful":2,"funny":0,"cool":1}
{"review_id":"BNTyVDQ1rm0AFdv0da0Trg","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"QDeB3ZtWYzVJJ0KK-HM-PA","stars":5,"date":1271808000000,"text":"BEST DONUTS EVER.  Seriously... they're amazing.  Huge selection of every variety imaginable- IF you come early.  Favs are the apple fritters (they let you chose from lighter or darker ones, depending on how done you like them), and their old fashioned buttermilk.  The donuts on the top two rows of the case are vegan,  but you'd never know it.  Their chocolate glazed cream filled (soymilk) and glazed raspberry jelly (gelatin-free) are crazy good.  I dream of these things.  Hole-in-the-wall smack dab in Chinatown.  The owner & her husband are as sweet as can be.  I only wish they were open 24 hours!","useful":1,"funny":1,"cool":1}
{"review_id":"E7vDhV3f9_Ve4h7GSO5v4g","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"-yApKLEFAvvNyifvpNKWCA","stars":4,"date":1275868800000,"text":"I am updating my review of Luv-it... still the best frozen custard in Vegas (by a mile).  However, it is super lame that they use styrofoam cups in this day and age.  Polystyrene is not accepted by recycling (Waste Mgmt) in Las Vegas, it's a possible carcinogen, it's made with petroleum, it is clogging our landfills, ETC. (google it!).  With so many eateries going green and switching to eco-friendly packaging, I wish Luv-it would too.  This guy sells a ton of custard every day and I cant imagine how many of these cups he goes through.  You gotta get with the times!","useful":0,"funny":0,"cool":0}
{"review_id":"OWt9XHjSAvqHNcoCDvFiMQ","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"m5niZy68d2gTtVWz89elfA","stars":4,"date":1273708800000,"text":"MAD LOVE for the slider truck.  What a great concept, I am so glad this place is getting the attention it deserves.  Finally we have a gourmet mobile restaurant!  The weekly schedule is posted on their website www.slidinthru.com and on twitter.  My fav is the caprese (grilled eggplant, mozarella, toms, basil, balsamic).  They also have a pulled pork slider, a beef one with tzatziki and feta, a bbq one with carmelized jalapenos, and a classic with cheddar, bacon and special sauce.  Supposedly they are going to start doing a chicken one too- fantastic news for me and my husband since we dont eat red meat!  Their buns are great and everything has a really nice smokey flavor from the grill.  They have regular fries, and really good sweet potato fries (tossed in cinnamon and sugar).  Only thing I wish they had is unsweetened iced tea, and I am looking forward to more chicken and fish specials.  Prices are reasonable, ingredients are high quality, and these guys (especially Ric) are total chillers.  There is always a line and your sliders are made to order, so be prepared to wait a couple minutes.   If you haven't been here, be sure to check it out.  I cannot give this place enough praise, mad props for a guy in his 20's acting on a really great idea- Vegas SO needed this!","useful":0,"funny":0,"cool":0}
{"review_id":"eOCdS3327PEwWLYhH6-vgg","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"QJR4qBUHegWEozSQrGmBPw","stars":5,"date":1273104000000,"text":"Olive's is a fantastic restaurant, exactly what you'd expect from Todd English.  The flavors are somewhat mediteranean and they've got a great menu.  Their cocktails are fabulous, I love their white peach belini and my husband is crazy about their dirty martini with blue cheese stuffed olives.  The bread basked comes with fresh baked onion foccacia and two kinds of olive tapenade.  They have some really good apps, including a great ahi tartare and some really nice flatbreads (one with proscuitto and figs, another with mushrooms, and a great classic tomato-basil-mozarella).  Favs on the dinner menu include the scallops (perfectly seared, served with risotto), the butternut squash tortellini, and the chestnut ravioli (served on a bed of creamed spinach-heavenly!).  Do not skip dessert here- they have a souflee that is crazy good.  Flavors change but the strawberry is incredible, so is the vanilla.  My husband and I order two, that's how delicious they are.  Service here is always great, very attentive.  I recommend sitting on the patio, it's much more private and has a beautiful view of the Bellagio fountains and water show.  Definitely make reservations or you could be waiting 2 hours for a table.","useful":1,"funny":0,"cool":1}
{"review_id":"Hu4-DKakumqEqlAG1yGD6w","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"UMqfeCItzQ2glr4d9apGlA","stars":4,"date":1273795200000,"text":"Great coffee shop in the Henderson part of town.  They have really good iced tea, avaiable in 3 flavors- including unsweetened peach black tea and passion berry (amazing!).  Their coffee is fair trade organic and varies daily.  They have a small selection of pastries and some breakfast and lunch options (vegan friendly).  They have a good breakfast burrito with eggs, potatoes, beans, cheese, fresh avocado and lots of spinach.  There are comfy seats and a bookcase full of books, however they are only open till 8pm.  Awesome eclectic staff, super friendly and knowledgeable about their coffees.  I wish they had a larger\/better pastry selection and were open later.  We need a place in Vegas that is comparable to the living room in SD, and this is the closest I have found so far!  I so wish they'd open one in the Summerlin-ish area!!","useful":0,"funny":0,"cool":0}
{"review_id":"Qy2hvB_xQ0dFUYYZA7la4Q","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"XkvvUNCmLIvOts0OftXegw","stars":4,"date":1273708800000,"text":"Original Pancake is one of the best breakfast places ever.  They are a chain, and their locations in Rancho Santa Fe (SD), Palm Desert, Chicago, etc are all way more charming than this one.  That said, breakfast here is always consistently delicious and the service is great.  Their omelettes are fluffy and baked with the ingredients inside, almost like a souflee.  They do a great dutch baby, german apple pancake, and a dutch garden (dutch baby topped with veggies and cheese).  Their pancakes are my favorite- thin and flavorful, you can smell the buttermilk.  They come in every flavor, including seasonal pumpkin (amazing!) and fresh strawberry with whipped cream (during summer months, with fresh not canned whipped cream).  They also have classics like eggs benedict, corned beef hash, and amazing swedish pancakes (thin like crepes).  They also have a location in GVR that is newly expanded, for people on the Henderson side of town.","useful":3,"funny":0,"cool":1}
{"review_id":"vwmo-62vWfCKnR97895Opw","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"YavRvjbLsvh4DYDJPAfJIA","stars":4,"date":1272499200000,"text":"This place is super clean (major bonus points!) and they have great vegetarian pho.  I am mostly restaurant vegetarian and it's hard to find pho that is not either a beef or chicken broth.  Their's (I think called tofu\/vegetable) is very flavorful, salty, and comes with a platter of very fresh veggies to arrange in your soup as you like.  My husband and I each get a large bowl- it is huge and takes forever to eat!  Their fresh spring rolls (the cold ones) are good, but not the best i've had.  The sweet sauce that comes with them is great.  Major bonus points for a place that offers a veg pho on par with the traditional beef one!","useful":2,"funny":0,"cool":1}
{"review_id":"rUoMvoXxdqTCxCmIL2CrpQ","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"JWDiG0nSsM7GQ9QFRTxU9w","stars":3,"date":1281830400000,"text":"Glazier's is pretty middle of the road for me. Let me start off by saying that the store has a very strong, strange odor that has lingered since they first opened (my husband says its tolerable, I find it hard to bear). The layout is nice and the store looks impressive compared to most regular grocery stores (Smiths, Vons, etc). They have a large produce selection at very affordable prices. Lots of exotic fruit, vegetables, and peppers that cannot be found at conventional grocers. However, their herbs and most greens are less than fresh and their selection of organic produce is lacking (and way too expensive when compared to Trader Joes, Whole Foods, or even Vons). They have a great selection of ready made food, but few healthy options. Pizza, ice cream, sushi, pasta salads, pasta entrees, vegetable and starch sides, etc. Some of what I've tried has been good, including salmon stuffed with spinach and pesto, green beans almondine, mixed vegetable rice, broccoli with peppers, etc. They also have a nice looking coffee and tea bar and a good selection of gourmet bread (La Brea Bakery olive bread, jalapeno cheddar, pain rustic, organic whole grain, etc). They have a huge bakery with donuts, pastries, pies and cakes at shockingly low prices, but nothing even remotely health conscious. Salad bar is run of the mill and cant hold a candle to Whole Foods, but again the prices here are incredibly reasonable. They do have an organic\/natural food section but they do not have organic eggs, meat, etc. \nI could not do my regular grocery shopping here, but this place is great for specialty items and anyone shopping on a budget. It is far better than a Walmart or Smart and Final and I like the fact that it's family owned. Their produce selection is worth a trip alone. I also find myself coming here when I get home late and don't want to cook- their ready made and pre-packaged food is available 'till they close at midnight. I wish they'd offer reusable bags, a discount card, and a juice bar among their ready made food stations. I also wish they'd refresh their magazines- I feel like I am in the twilight zone when I stand in line and see covers from weeks ago.","useful":2,"funny":1,"cool":0}
{"review_id":"gx3y9GCoW8HjHomYvj0cbg","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"3-0Q3D3lC5hDys3EX0Ai9g","stars":5,"date":1406073600000,"text":"This place is fab... they have every single toy imaginable- from the typical pet store brands to more boutique style game\/brain teaser toys (my dogs are currently obsessed w\/ hide-a-squirrel!).  They also have food, treats, leashes, harnesses and more- all discounted.  Love this place.","useful":0,"funny":0,"cool":0}
{"review_id":"j95JQtJde3A7rm_Y3HHZmQ","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"0CB7YB1qRSWLQvMbHw3Fmw","stars":4,"date":1271808000000,"text":"This is one of the best places for boba tea in the city.  They have an extensive menu featuring the usual flavored black and green teas, slushes, snow ices, and smoothies.  Their prices are more reasonable than most tea houses in Chinatown, the service is friendly, and the place is clean as can be.  There are always people getting take-out drinks here and there are a couple tables inside and out front.  Favs include the strawberry milk tea and passion fruit black tea, both with boba.  My husband loves their fruit slushes.","useful":1,"funny":0,"cool":1}
{"review_id":"zmVpf7r00n7zNvZ-htWvVg","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"uUEKndnFbHD8mVkGiirtpA","stars":5,"date":1273708800000,"text":"Tommy Bahamas is great.  I have eaten at their restaurants in Maui, Palm Desert, and here in Vegas- they are all consistently fabulous.  Service is always attentive and they have a great happy hour in the bar (there are also comfy booths if you dont want to sit at the actual bar).  Happy hour is I think from 4-7pm weekdays- discounted apps and drinks, and some really good fish tacos.  Their bread is in the shape of a crown, served hot with a sweet cinammon butter.  Great apps- favs include the coconut shrimp, cayman lollipops (chicken drumettes with mango bbq sauce), goat cheese with mango salsa and flatbread, and the ahi poke.  At lunch they have really nice salads and some great sandwiches, including a beer-battered crispy fish sandwich with tarter sauce and honey roasted onions.  For dinner, they have great seafood and a really great stuffed chicken (herb cheese and roasted red pepper cream).  Dessert here is a must, the pina colada cake is good but the butterscotch pudding is incredible.  Most desserts are available in small sizes, though they dont display this on the menu so you'll have to ask.  I highly recommend this place, especially for dinner on the patio on warm summer nights.","useful":1,"funny":0,"cool":1}
{"review_id":"UsS8p8xwZcMfcL8ba2hT1g","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"Ssa6XY_RdDRRB9wuVIeIWw","stars":4,"date":1296086400000,"text":"Hedary's is legit Lebanese food.  Really yummy mango juice (more like a nectar and not overly sweet).  Solid hummus, good tabouli and Greek salads, and an incredible lentil soup.  Falafel are flavorful and not overly fried, although the sandwich was a bit on the dry side (needed more veggies\/sauce to balance out the grittiness of the falafel balls).  Pita bread alone is worth the visit here- sweet, puffy, and served hot out of the oven.  I definitely want to come back for their lunch specials, and to try the shrimp scampi (ordered by the table next to us- smelled and looked amazing!).  Hummus, pita & that lentil soup are better here than anywhere else in the valley.","useful":1,"funny":0,"cool":1}
{"review_id":"VQR9u5gWigPQqttg12zo-A","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"4Bw9XffSa0AMy2SrNCS2KA","stars":5,"date":1275436800000,"text":"Sababa has moved up to five star status- strictly based on their falafel.  Let me be perfectly clear, I have never had anything else here.  However, this is the best falafel in Vegas- and I have tried many.  The falafel and hummus comes in a pita pocket filled with tahini, tomatoes, pickles, cabbage, cucumbers, and lettuce.  They have an incredible green parsley hot sauce (crazy hot!) and their falafel is moist all the way through (not dry in the center like many others).  The falafels are fried to order and the sandwich is made in front of you.  Still wish they had fresh brewed iced tea, but I usually get takeout anyway.  This place is Israeli owned and about as authentic as it gets.","useful":2,"funny":0,"cool":1}
{"review_id":"8g3N6sHKf89MwS6znhqraQ","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"t6WY1IrohUecqNjd9bG42Q","stars":4,"date":1271894400000,"text":"I love Red Velvet Cafe, for their baked goods alone.  I have never eaten the food here, but have visited many times for tea and cake and often pick up their baked goods to bring home.  The owner's wife does all the baking herself, and it is clear that great care has gone into developing her recipes.  My favorite is the red velvet cake, which looks like a large cupcake and is topped with a deliciously sweet frosting and a whole strawberry.   They also do a delicious chocolate peanut butter cake, also in the shape of a large cupcake with a moist chocolate cake and rich peanut butter frosting.  The best part about these cakes is that they are under 200 calories, vegan, and free of any saturated or trans fats.  She does not use artificial sweeteners or make things that are low fat but still unhealthy- these cakes are all natural, preservative free, and taste delicious.  I highly recommend this place for their baked goods alone, and I look forward to trying their food.  The menu features sandwiches, pastas, salads, and an assortment of vegan meats and cheeses that are all made on site.","useful":1,"funny":0,"cool":1}
{"review_id":"zyXCUPpiotXHwuaQHR--cw","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"Sr-TfSJOxrcnByDPeAzQLQ","stars":3,"date":1295222400000,"text":"Went back to Fresh 52 today with the desperate hope that they'd expanded and added a few more vendors.  Unfortunately you can literally walk through the entire place in under 5 mins, so it's hardly worth the drive across town.  However, there are a couple places that will keep me coming back (at least on occasion).  The bread from Bon Breads is solid and they have lots of varieties (white chocolate batard, multigrain, pretzel rolls, ciabatta, etc).  Also the salsa and chutneys from Miguel's rock!  The salsas all have a great kick, and they have a mango one too.  They have jalapeno jellies and an amazing apricot jalapeno chutney that is super flavorful.  A couple places have come in since summer and a couple have gone out- there is still a decent sized produce stand but its strange that there was only the one vendor.  There is a face painting station, a dog store, and a booth that sells Scentsy.  There is also an organic, loose leaf tea stand and another with baked goods (although there were very few options).  There is a crepe stand too, but they were mostly dessert flavors rather than breakfast options.  I wish this place was 10 times the size it is, but it's still worth checking out and most of the vendors were solid.","useful":5,"funny":0,"cool":1}
{"review_id":"7BjS2cOrQXEIPpAKXBLvuw","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"0UlMUHtEDgDMkycBQpoAew","stars":3,"date":1406073600000,"text":"This review is for the spa only.  It's a fab property that I've enjoyed coming to for years... unfortunately this place is pretty dead lately and the staff are not friendly.  My masseuses have all been good but nail techs not so much.  If they are struggling for clients they need to up the ante and make it a great experience worth the drive.  Also, the pool was closed due to it being a weekday (so we couldn't use the full spa amenities, which is why we go).","useful":3,"funny":1,"cool":1}
{"review_id":"jQIvBD-o4wux2r64D53h9Q","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"oH6QAuoTLFaX97oqqpLTMg","stars":4,"date":1271808000000,"text":"Familia is in a strip mall on Durango and delivers to the surrounding area super fast.  Good service & they always get your order right.  Love their garlic knots, greek salad, and pizzas (cheese w\/ ricotta & basil is our standby).  They also have calzones and stromboli.  Good cannolis- thick cream with cinnamon and chocolate chips, filled to order in their homemade shells.  Spumoni ice cream for sale by the tub.  Way better than Marcos or some of the other chains in the vicinity!","useful":2,"funny":0,"cool":2}
{"review_id":"Rr7DUgBcjzKGQ3KiONi-7A","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"O7ot_LMlCfLpOP9tBqeNfw","stars":4,"date":1271808000000,"text":"Love this sushi spot, I've been coming here for the past few years.  They're in Town Square across the street from H&M, next to Yogurtland.  Atmosphere is warm and trendy and is why I often prefer Kabuki to other places in the area.  Comfy private booths, tables, sushi bar, and an outdoor patio.  Usually crowded from happy hour (great specials) to closing, but I've never had to wait more than 10-15 mins.  Extensive cocktail menu, decent wine selection and several flavored non-alcoholic drinks including sweet mango iced tea and mint lemonade.  Edamame comes with all sushi orders.  Good miso soup and house salad with ginger dressing, decent seaweed salad but not my fav.  Lots of apps, including fried eggplant and calamari.  Large selection of specialty sushi rolls, fav is the Lotus on Fire roll (spicy tuna, jalapeno and lotus root on california rolls).  Extensive menu with lots of pictures, and lots of non-sushi items including teriyaki, noodle dishes, soups, seafood, etc.  Fresh fish, great service & atmosphere!","useful":1,"funny":0,"cool":1}
{"review_id":"uvYEVAqZYIrfcSk6VHrZoA","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"7P3Z4HTUM8M8Y9Yw3cc7Pg","stars":5,"date":1379116800000,"text":"5 stars for the chai latte at Tipsy- best chai I've found in Vegas.  Spicy and not overly sweet, and major bonus points for being able to order it with almond or soy milk.  The chocolates here are also great- the s'mores bar is graham cracker-y, peanut buttery amazingness.  Definitely a spot worth checking out.","useful":4,"funny":1,"cool":3}
{"review_id":"rMxsO1121Ki9O2NfDOQYEw","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"0ldxjei8v4q95fApIei3Lg","stars":5,"date":1281830400000,"text":"Lucilles is really great BBQ, definitely the best in Vegas by far. They're located in The District in GVR and the atmosphere is really great, very southern. Expect an insane wait here on weekends, but it's well worth it. They have some of the best sweet tea I've had, served in a huge maison jar. The bread basket is stuffed with buttermilk biscuits and apple butter, and they have some really good apps like pulled chicken sliders on sweet rolls, fried green tomatoes with red pepper cream, and fried pickles (spears, not chips served with remoulade). They have delicious salads (one with sauteed shrimp, one with smoked salmon and a peach vinaigrette, one with BBQ chicken and onion strings). They have the usual meat platters with brisket, tri tip, ribs, chicken, etc. They have a good blackened catfish and some incredible sandwiches- my favorite is the BBQ chicken sandwich with melted cheddar, onion straws, and lots of field greens on a french roll (they also have yummy potato buns). Sides are awesome- good mac n cheese, peanut slaw, sweet potato fries, cheese grits, etc.  Mad props for being one of the few BBQ joints that also caters to vegetarians- veggie burger, salad, or a really good marinated portobello sandwich with melted cheese and garlic mayo. Desserts include fruit cobbler, pecan pie, peach bread pudding, banana pudding, and red velvet cake !! There is a separate take out area near the entrance that absolutely kills it. Service is great and prices are reasonable, especially given the huge portions and quality. This is the only place my husband and I go when we crave BBQ, and we often take out of town guests here for the great atmosphere and food.","useful":5,"funny":1,"cool":4}
{"review_id":"_qSZqFuPeRhFX9TKv7DlKg","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"kYD9E14AijONhJ7rFsyLrg","stars":5,"date":1428710400000,"text":"We came here for dinner and the service was outstanding and the food was just excellent.  This restaurant is a hidden gem!","useful":0,"funny":0,"cool":0}
{"review_id":"u7FA0sWOM_BbtJx4aLPp3A","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"GcxE5hK_TaHP4EZFDYz2mg","stars":4,"date":1438387200000,"text":"We came for the Sunday brunch.  It's expensive but you can skip lunch after eating here.  Great variety - typical breakfast food like omelets , a variety of cheeses, breads and fruit but also has crepes and nice salads.  They also bring six different meats to your table - the Chicken Parmesan was my favorite (even better than the beef).  It costs $30 per person - I would recommend this for a nice brunch with lots of variety.","useful":0,"funny":0,"cool":0}
{"review_id":"r_2zT5Jw9GGQMFCxP9ps7A","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"dsIHIXyAl_ldqkd8QekvTQ","stars":1,"date":1447459200000,"text":"I walked in here to try it and had a Greenhouse Juicery bottle in my hand and I was asked to put it away.  Please.  I was immediately irritated.  In no way was my juice going to take away from the business I gave to you - until you said that.  Then I ordered less simply because of the rudeness.  Your food is nowhere in the same league so you should take whatever business you can get and be glad anyone stops in.","useful":0,"funny":0,"cool":0}
{"review_id":"m0dZSmXPWlDJ_VGgCWZa9w","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"r48H_sNUGmcRGX1LsEc2mg","stars":3,"date":1447459200000,"text":"My husband and I came here for appetizers and drinks only.  Reasonably priced, nice interior, accommodating waitress, and food was pretty good.  It wasn't anything fantastic but I'd return for a decent meal.  The drinks we ordered were small, however, and not that much bigger than a shot glass it seemed.  Maybe it was just the type of drink we ordered but the glasses were quite small.","useful":0,"funny":0,"cool":0}
{"review_id":"r35AtF1luGvnojz7js615w","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"UxWH8zRYIBgs6Q2oykvRdw","stars":3,"date":1441756800000,"text":"Came here for brunch and had the mushroom and artichoke omelette. It was very good and served with a small salad. Very nice atmosphere.","useful":0,"funny":0,"cool":0}
{"review_id":"-mKxNOVHiQQhDpteGtH1pw","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"a8pmtlVKf7NiSLI-4KejIw","stars":4,"date":1438387200000,"text":"Nice place to eat on a patio in the summer.  We ordered the guacamole which our waiter said was the best.  I wouldn't say it was the best but it was quite good.  Our dishes were also tasty and we didn't walk out of this restaurant feeling stuffed (unlike most Mexican restaurants).  The mojitos are excellent.","useful":0,"funny":0,"cool":0}
{"review_id":"7MBS2ZSO0Lcx4GwOasyDGA","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"tEfmHuo_dNanyTaC5PyoOQ","stars":3,"date":1446940800000,"text":"Food was very good.  My friend had the torn pasta and I had the roasted pickerel.  Portion sizes are good and you don't feel stuffed after the meal.  For some reason I didn't think it was fantastic though.","useful":0,"funny":0,"cool":0}
{"review_id":"tQMLT4RBPHL1AObWElWSRA","user_id":"ZdUFyF5eNyZxete-T4bmZA","business_id":"EnCIojgP5KTr1leaysFE3A","stars":4,"date":1360108800000,"text":"Love the new location...much more comfortable, and will be even more so when the summer heat gets here.  Tried the ribs and the chicken and both were awesome.  One star loss for the fries which were a little oily and limp, and the black beans which were a bit dry.  But the ribs and chicken were worth coming back for again and again.","useful":1,"funny":0,"cool":1}
{"review_id":"WR0jhOoHNrwlx2sPnpfbiQ","user_id":"ZdUFyF5eNyZxete-T4bmZA","business_id":"b7Y4dIggAacPum1tF3NpKg","stars":2,"date":1378166400000,"text":"Called in an order for delivery to my home, 2 miles from the shop.  Medium, 3-ingedient pizza and a small greek salad...$33 and change!  Add to that the five bucks I would give the delivery guy and I'm into it for just shy of $40.  Their pizza is o.k., but not even close to the quality that would command that price.  I know, delivery charge, taxes, blah blah blah...it's just a bottom line issue...waaay too much for an average pizza.  Sorry Rosati's, but we're done.","useful":1,"funny":0,"cool":0}
{"review_id":"VH6VxzEjVouFIu0C8q6ylA","user_id":"ZdUFyF5eNyZxete-T4bmZA","business_id":"MTtI2bqoNHN_0m2cHbY2ug","stars":4,"date":1439942400000,"text":"I found all the staff to be professional , knowledgable, and friendly... Except for the ER admitting desk. On more than one occasion I've been given the impression that I was an inconvenience to them, and that my acute and obvious pain and discomfort were not their concern. I've watched them treat others this way as well. At least I know that once i've made it past them, I'm going to get professional treatment","useful":2,"funny":0,"cool":0}
{"review_id":"nmo1EESQLD-I4RnX2GaxjQ","user_id":"ZdUFyF5eNyZxete-T4bmZA","business_id":"LYWbyu1EQM2o5hwHG5_Ldg","stars":5,"date":1364774400000,"text":"so, maybe a little expensive...but outstanding preparation and quality.  Beyond that, I have to give special mention to our waiter, Clifton(?), the most knowledgable waiter I've come across in a long time.  He really knew and understood the menu, and provided information and sugggestions without being overbearing or patronizing.  An excellent expreince.","useful":0,"funny":0,"cool":0}
{"review_id":"Uts0KOO_cZ3WC6Fi09nQog","user_id":"ZdUFyF5eNyZxete-T4bmZA","business_id":"pWjcb5g3YEvBEOKS8VkZ9g","stars":4,"date":1342742400000,"text":"I've had no experience with the sales department...this is strictly based on the service department.\n\nThe last few times I've been to the service department I had Brian waiting on me.  They guy is great...personable, professional...makes having to get a battery replaced, or whatever, a whole lot easier.  Whoever reads these at Planet Hyundai...give Brian a raise!","useful":2,"funny":1,"cool":3}
{"review_id":"DNfAwVJJG1knqPSVZwlIQQ","user_id":"ZdUFyF5eNyZxete-T4bmZA","business_id":"nqiTujxNtEpA8dPATEQRrg","stars":4,"date":1472601600000,"text":"Four stars for the service. Grace lived up to her name. Gracious and patient. It was as if she is an actress. Hope we'll get a chance to return.","useful":1,"funny":0,"cool":0}
{"review_id":"de812DE8MgF3LvrlyDFjcA","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"A-KVm7iKLOe1X1yAQP13FA","stars":3,"date":1407888000000,"text":"Cheap and cheerful.  Been here a few times and service and food quality is consistent. Nothing super special but its not terrible either.\n\nI always get the masala dosa - pretty traditional and standard. Could use more filling because I find myself eating a lot of the wrap at the end and just dipping it into the sauce. \n\nHad the pani puri - pretty good, but not really the best deal for the price - I expect a few more. \n\nChaat papri was good as well - but again - could have been more generous with the portion size. \n\nService here is quick - I was seated promptly and the wait staff are attentive, so ordering was quick and easy.","useful":1,"funny":0,"cool":0}
